{"id":1009,"date":"2022-05-25T03:18:05","date_gmt":"2022-05-25T03:18:05","guid":{"rendered":"https:\/\/infobloom.site\/vat-on-nfts-for-entrepreneurs-and-professionals\/"},"modified":"2022-05-25T03:18:05","modified_gmt":"2022-05-25T03:18:05","slug":"vat-on-nfts-for-entrepreneurs-and-professionals","status":"publish","type":"post","link":"https:\/\/infobloom.site\/vat-on-nfts-for-entrepreneurs-and-professionals\/","title":{"rendered":"VAT on NFTs for entrepreneurs and professionals"},"content":{"rendered":"<p>On March 10, 2022, the General Directorate of Taxes, which depends on the State Administration of the Tax Agency, issued a binding consultation on the VAT treatment in the sale of NFTs by an entrepreneur or professional.<\/p>\n<p>In said consultation, the question of how the sale of these NFTs is taxed in VAT is raised, especially when there is total uncertainty as to where their clients are established, since the creator of NFTs cannot identify them.<\/p>\n<h2>The sale of NFTs by an entrepreneur or professional are operations subject to and not exempt from VAT<\/h2>\n<p>In this sense, the General Directorate of Taxes clarifies that the sale of NFTs cannot have the same treatment for VAT purposes as the sale of cryptocurrencies, so they would be subject operations and not exempt.<\/p>\n<h2>The sale of NFTs is treated for VAT purposes of services provided electronically, which are taxed at 21%.<\/h2>\n<p>It also emphasizes that they are not personalized files, but unique and original digital goods and that what is transmitted in said sale is the digital certificate of authenticity that represents the NFT.  For this reason, the General Directorate of Taxes interprets that for VAT purposes these services are considered services provided electronically, and this operation is not considered a delivery of goods.<\/p>\n<p>Likewise, it clarifies that in the event in which the creator of NFTs sells directly through a decentralized digital platform, there is a direct relationship between the seller and the buyer, so said operation must be invoiced by the creator of the NFT directly. and not by the digital platform through which the sale is made.<\/p>\n<h2>Location of sales of NFTs in VAT<\/h2>\n<p>On the other hand, the question of the place of performance of the services provided electronically is addressed, where it is understood that those services sold to clients established in the territory of application of the Tax (Spain, excluding Ceuta, Melilla and the Canary Islands) will be subject to Spanish VAT. Canary Islands), as well as for those sales made in the European Union, provided that these do not exceed the threshold of 10,000 euros per year.<\/p>\n<p>Otherwise, if said limit is exceeded, these sales made to third countries of the European Union will be subject to taxation in said countries, and for this purpose it may be decided to apply a special Mini Single Window system, which allows savings of administrative management to pay VAT in each third European country.  However, it leaves the door open to the application of the VAT localization rule for the effective use of the service provided, commonly called closure, which tends to be a real catch-all, even more so in this type of service.<\/p>\n<p>Finally, the usual problem is addressed that the creators of NFTs do not know where their clients reside, which can be a big problem since, if they reside outside the European Union, said services may be exempt from VAT.  However, the General Directorate of Taxes is simply dedicated to bringing up some articles of Execution Regulation 282\/2011 on VAT, and does not make an interpretation of said articles, which are not adapted to the specific case of the creators of NFTs.<\/p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>On March 10, 2022, the General Directorate of Taxes, which depends on the State Administration of the Tax Agency, issued a binding consultation on the VAT treatment in the sale of NFTs by an entrepreneur or professional. In said consultation, the question of how the sale of these NFTs is taxed in VAT is raised, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1010,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1009"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1009"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1009\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1010"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1009"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1009"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1009"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}