{"id":1028,"date":"2022-05-25T07:28:34","date_gmt":"2022-05-25T07:28:34","guid":{"rendered":"https:\/\/infobloom.site\/the-crypto-companies-behind-the-project\/"},"modified":"2022-05-25T07:28:34","modified_gmt":"2022-05-25T07:28:34","slug":"the-crypto-companies-behind-the-project","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-crypto-companies-behind-the-project\/","title":{"rendered":"the crypto companies behind the project"},"content":{"rendered":"<p><\/p>\n<p>The heirs of Diego Maradona announced the launch of the soccer star&#8217;s first official collection of NFTs.  Under the name D10Snft,<strong> a limited edition of five thousand pieces will be sold<\/strong> which will include the highlights of the Ten.  It will be made and sold by the crypto companies Bitflix and DAO Maker.<\/p>\n<p>&#8220;We want to present you the first license granted by the heirs of Diego Maradona for a limited edition of NFTs&#8221;, begins the message with which they communicated the news.  As they point out, it is the first time that an official license has been granted to carry out NFTs of the former footballer <strong>although they did not disclose the date on which they will be available. <\/strong><\/p>\n<p><img class=\"caas-img caas-lazy has-preview\" alt=\"The first official Diego Maradona NFTs are released\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653463713_356_the-crypto-companies-behind-the-project.png\"\/><\/p>\n<p>The first official Diego Maradona NFTs are released<\/p>\n<p>Although the announcement indicates that &#8220;the heirs of Diego Maradona gave the rights&#8221; in the promotional video not all of his children appear.  In principle, those who announce the future collection of NFTs are Jana, Diego Jr. and Diego Fernando. <strong>Neither Dalma nor Gianinna appear in the same<\/strong>.<\/p>\n<h3>Who will make Maradona&#8217;s NFTs<\/h3>\n<p>The heirs of Diego Maradona gave Bitflix the rights to carry out the NFTs of the former footballer.  The platform was created in April 2021 and is intended to be <strong>&#8220;the Netflix of the metaverse&#8221;<\/strong>.  That is, a non-fungible film market based on blockchain technology.<\/p>\n<p>The goal of financier Tiger Miller, the creator of Bitflix, is to decentralize the movie industry.  Above all, Hollywood.  Movie and commercial creator for over 15 years, <strong>Miller worked with figures such as Keanu Reeves, Allen Iverson and the Kardashian sisters. <\/strong><\/p>\n<blockquote data-src=\"https:\/\/www.youtube-nocookie.com\/embed\/EotTVT1l2u4\"><\/blockquote>\n<p>All that experience, plus a newly developed passion for cryptocurrencies, led him to think about how he could make it <strong>bring cinema to the blockchain<\/strong>.  And the result of that process was Bitflix.<\/p>\n<p>Basically, an NFT movie is &#8220;a collectible behind-the-scenes clip of an iconic movie moment.&#8221;  &#8220;There is an inherent resale value <strong>if the actor&#8217;s career or the film&#8217;s intellectual property take off<\/strong>&#8220;, they indicate from the company.<\/p>\n<p>Continue reading the story<\/p>\n<p>On the other hand, the company indicated at its inception that it will market five categories of NFTs. <strong>They are: stars, movies, music, activists and trophies<\/strong>.  Buyers will enjoy certain benefits, including casting voting rights, executive producer film credits, and celebrity access through AMA live streaming sessions during film production.<\/p>\n<p><img class=\"caas-img caas-lazy has-preview\" alt=\"Maradona\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/the-crypto-companies-behind-the-project.jpeg\"\/><\/p>\n<p>One of Diego Maradona&#8217;s NFTs will be related to &#8220;The Hand of God&#8221;<\/p>\n<p>Bitflix recently revealed that they are currently producing a movie titled &#8216;LAVA&#8217;, the first ever fully crypto-funded movie.  Other films in the pipeline include &#8216;Berzerkerz&#8217; and <strong>&#8216;Finding Satoshi: The story of Bitcoin&#8217;.<\/strong><\/p>\n<h3>Another crypto company behind the project<\/h3>\n<p>Alongside Bitflix, another crypto company behind Diego Maradona&#8217;s NFTs is DAO Maker.  It works as an incubator for blockchain-based projects.  Its objective is that companies in this sector <strong>obtain the necessary financing to be able to carry out their work<\/strong>.<\/p>\n<p>To achieve its goal, DAO Maker <strong>focuses on the system of &#8220;social mining&#8221;<\/strong>.  It energizes the crypto community to participate in the growth and development of the selected projects.<\/p>\n<p>Some of the financial tools they offer are:<\/p>\n<ul class=\"caas-list caas-list-bullet\">\n<li>\n<p>Risk bonus for very low risks, but with reduced rewards<\/p>\n<\/li>\n<li>\n<p>Dynamic stock\/coin offerings for limited risks, but hold the highest rewards<\/p>\n<\/li>\n<li>\n<p>Redeemable offers from strong holders for public token sale successfully closing a private round<\/p>\n<\/li>\n<li>\n<p>Standard offers for the issuance of shares\/tokens without any protection<\/p>\n<\/li>\n<\/ul>\n<p><strong>In this way, the platform is attractive for crypto investors<\/strong>.  And the same for the startups behind the projects.  These join DAO Maker to guarantee safe, free and decentralized financing.  The latter means that they should not resort to banks or other traditional financial institutions to get the money.<\/p>\n<p>Once the financing is obtained, from DAO Maker also <strong>accompany startups during the early stages of development<\/strong>.  The purpose of this action is to provide advice to ensure the success of the project.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The heirs of Diego Maradona announced the launch of the soccer star&#8217;s first official collection of NFTs. Under the name D10Snft, a limited edition of five thousand pieces will be sold which will include the highlights of the Ten. It will be made and sold by the crypto companies Bitflix and DAO Maker. &#8220;We want [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1032,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1028"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1028"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1028\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1032"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1028"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1028"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1028"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}