{"id":1033,"date":"2022-05-25T08:05:22","date_gmt":"2022-05-25T08:05:22","guid":{"rendered":"https:\/\/infobloom.site\/cryptocurrency-scam-a-plot-falls-that-promised-thousands-of-young-people-to-get-rich\/"},"modified":"2022-05-25T13:11:11","modified_gmt":"2022-05-25T13:11:11","slug":"cryptocurrency-scam-a-plot-falls-that-promised-thousands-of-young-people-to-get-rich","status":"publish","type":"post","link":"https:\/\/infobloom.site\/cryptocurrency-scam-a-plot-falls-that-promised-thousands-of-young-people-to-get-rich\/","title":{"rendered":"Cryptocurrency scam |  A plot falls that promised thousands of young people to get rich"},"content":{"rendered":"<p>The <strong>National Police <\/strong>has dismantled a <strong>framework<\/strong> who allegedly recruited young people with the promise of making them rich <strong>investing in cryptocurrencies <\/strong>through classes on <strong>financial transactions <\/strong>not allowed in Spain. The investigation has concluded that the leaders of the plot &#8220;bordered on certain <strong>pressure techniques<\/strong> own of the <strong>sects<\/strong>&#8220;.<\/p>\n<p>In this sense, it is estimated that the main leader of the plot would have captured some <strong>2,500 people<\/strong>who pay a<strong> monthly fee <\/strong>150 euros for illicit training. The operation has resulted in eight people arrested, two of them in <strong>Barcelona<\/strong>.<\/p>\n<h3>a year researching<\/h3>\n<p>The investigation began a year ago, following a complaint filed by an association of victims of sects that detected the existence of a training academy in <strong>trading<\/strong> either <strong>negotiation<\/strong> short term of <strong>cryptocurrencies<\/strong> and other financial products. Since 2019, the network has captured young people, some of them minors, in Barcelona and, later, in the rest of the national territory.<\/p>\n<p>Upon investigation, the police discovered that it was a training platform that was the successor of another, called <strong>International Markets Live LTD <\/strong>(IMarketsLive), on which a warning from the <strong>National Stock Market Commission<\/strong>s since 2017. In addition, the owner had participated in other <strong>pyramid scams<\/strong>.<\/p>\n<p>Related news<\/p>\n<p>The police have indicated that the leaders of the plot, all of Spanish nationality, had changed the name of the company to prevent potential victims from suspecting the alleged fraud.<\/p>\n<p>The detainees are accused of <strong>fraud<\/strong>, <strong>false advertising<\/strong> and belonging to <strong>criminal organization, <\/strong>The National Police has informed. Among the eight arrested are the two leaders of the group.<\/p>\n<h3>This is how the pyramid scheme worked<\/h3>\n<p>The network captured young people, even minors, approaching them in public parks or through face-to-face events organized in hotels, so that they were promised training thanks to which they would earn large sums of money. <strong>money without working<\/strong>.<\/p>\n<p>The researchers detected a pattern: the network captured minors with a basic level of education and others who, if they had higher education, had no relationship with the financial markets. In addition, none of them with training or previous experience in <strong>stock investments<\/strong>.<\/p>\n<p>Once enrolled, teaching became a secondary role and the organization dedicated itself to pressuring them to attract new students, thus forming a <strong>pyramid scheme<\/strong>.<\/p>\n<p>They required a first income of <strong>200 euros<\/strong> and one <strong>monthly fee<\/strong> from <strong>150 euros<\/strong> for the alleged formation. If they recruited two more people, they stopped paying the monthly fee. From their third recruitment, they would begin to collect monthly from the &#8220;pyramid&#8221;, according to the Police, which reports that the leaders provided new members with scripts to approach and persuade potential new members.<\/p>\n<p>Once captured, they were given virtual classes recorded on video through which the <strong>binary options trading<\/strong> Y <strong>leveraged trading,<\/strong> prohibited transactions in <strong>Spain<\/strong> and in the <strong>European Union<\/strong>.<\/p>\n<p>To encourage these operations and reinforce the credibility of the profitability and reliability of the academy, one of the main trainers of the organization showed in his account, supposedly audited by a well-known financial auditing website, a history of negotiations that supposedly reflected that the investments they had had a success rate of between 75 and 80 percent.<\/p>\n<p>&#8220;Own pressure from sects&#8221;<\/p>\n<p>The Police stress that the pressure on young people to abandon their <strong>studies<\/strong> and even cut their <strong>family relationships<\/strong> was such that it &#8220;touched certain <strong>pressure techniques<\/strong> own of the <strong>sects<\/strong>&#8220;. It is estimated that the main leader alone could have been responsible for the direct and indirect recruitment of some 2,500 people.<\/p>\n<p>In this line, two adolescents captured when they were 17 years old came to leave the family home to live with members of the organization.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The National Police has dismantled a framework who allegedly recruited young people with the promise of making them rich investing in cryptocurrencies through classes on financial transactions not allowed in Spain. The investigation has concluded that the leaders of the plot &#8220;bordered on certain pressure techniques own of the sects&#8220;. In this sense, it is [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1034,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1033"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1033"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1033\/revisions"}],"predecessor-version":[{"id":1073,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1033\/revisions\/1073"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1034"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1033"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1033"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1033"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}