{"id":1040,"date":"2022-05-25T13:07:00","date_gmt":"2022-05-25T13:07:00","guid":{"rendered":"https:\/\/infobloom.site\/cancun-for-fraud-five-agencies-are-suspended-for-the-first-time\/"},"modified":"2022-05-25T13:11:38","modified_gmt":"2022-05-25T13:11:38","slug":"cancun-for-fraud-five-agencies-are-suspended-for-the-first-time","status":"publish","type":"post","link":"https:\/\/infobloom.site\/cancun-for-fraud-five-agencies-are-suspended-for-the-first-time\/","title":{"rendered":"Cancun: for fraud five agencies are suspended for the first time"},"content":{"rendered":"<p class=\"relacionadosSingle\">\n<p><\/p>\n<p>Five travel agencies have been disqualified for fraud in electronic sales, due to the collective complaint filed by the Quintana Roo State Tourism Secretariat with the Attorney General&#8217;s Office (FGR), something that occurs for the first time in the country. According to the investigations, there is an average of 18 cases with proof documents of the frauds of these five agencies.<\/p>\n<p>A large number of these cases have been detected through the Guest Assist platform. The phenomenon is carried out in the sale of tourist services on the Internet, with companies that are located in various parts of the republic, but when the tourist arrives in Quintana Roo and wants to stay, they find themselves without reservations or without tours in the excursions.<\/p>\n<p>These companies acquire various names and are offered on the Internet simply by saying trips to Cancun or other destinations in the country. For this reason, a complaint has been made in an unprecedented event to stop this type of fraud.<\/p>\n<p>“At least five companies are detained. No state, no ministry had ventured to file a collective complaint with the FGR. We receive cases that, without being developed locally, are important for the attention of tourists”, highlighted the Secretary of Tourism Marisol Vanegas.<\/p>\n<p>However, Vanegas acknowledged that it is very difficult to locate this type of company because they are constantly changing their name and location. In fact, every fortnight they move to a different destination and work with illegally purchased databases, making them difficult to trace.<\/p>\n<p>Despite the fact that there are only 18 complete files with the documentation that proves the fraud, some 180 cases of fraud have been identified whose amount exceeds 4 billion pesos. Regarding the actions that are followed, the secretary pointed out that there is a national mechanism where travel agencies with AMAV are advertised, which will be replicated so that the tourist can verify if the purchase he is making is real.<\/p>\n<p>Likewise, Vanegas assured that Sedetur already has a specific area to answer doubts and questions from tourists who are about to book a hotel or service. This measure responds to the support that the agency has had to give tourists in case of fraud.<\/p>\n<p>On the other hand, it should be noted that this is not the first time that this type of fraud exists. In December 2018, some 1,000 national and foreign tourists were affected by ghost agencies that sold illegal trips, as reported by REPORTUR.mx (Scam more than a thousand tourists with ghost trips to Quintana Roo), (Cancun agencies demand more control against tourist scams).<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Five travel agencies have been disqualified for fraud in electronic sales, due to the collective complaint filed by the Quintana Roo State Tourism Secretariat with the Attorney General&#8217;s Office (FGR), something that occurs for the first time in the country. According to the investigations, there is an average of 18 cases with proof documents of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1043,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1040"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1040"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1040\/revisions"}],"predecessor-version":[{"id":1079,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1040\/revisions\/1079"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1043"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1040"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1040"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1040"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}