{"id":1096,"date":"2022-05-25T16:35:17","date_gmt":"2022-05-25T16:35:17","guid":{"rendered":"https:\/\/infobloom.site\/examples-of-phishing-emails-and-how-to-recognize-them\/"},"modified":"2022-05-30T13:25:15","modified_gmt":"2022-05-30T13:25:15","slug":"examples-of-phishing-emails-and-how-to-recognize-them","status":"publish","type":"post","link":"https:\/\/infobloom.site\/examples-of-phishing-emails-and-how-to-recognize-them\/","title":{"rendered":"Examples of Phishing Emails and How to Recognize Them"},"content":{"rendered":"<h2><strong>Examples of Phishing Emails and How to Recognize Them<\/strong><\/h2>\n<p>Suppose you receive an email from citibanamex@sucuenta.com stating that they have identified suspicious activity on your credit card statement and asking you to verify your financial information. What are you doing? While you might be tempted to click the link to resolve the issue right away, this is likely the work of a cybercriminal. Phishing is a scam that tricks people into voluntarily providing sensitive personal information. To protect yourself, review some examples of phishing emails and learn more about this widespread scam.<\/p>\n<h3><strong>What is phishing?<\/strong><\/h3>\n<p>Phishing is a cybercrime that seeks to steal your confidential information. Scammers pose as large companies or other trusted entities to convince you to voluntarily give them your information, such as your website login credentials, or worse, your credit card number.<\/p>\n<h3><strong>What is a phishing email or text message?<\/strong><\/h3>\n<p>A phishing email or text message (also known as SMiShing) is a fraudulent message that appears legitimate. It typically asks you to provide sensitive personal information in a variety of ways. If you don&#8217;t look closely at emails or text messages, you may not be able to tell the difference between a normal message and a phishing message. Scammers go to great lengths to make phishing messages look a lot like emails and text messages sent by reputable companies, so be careful when opening these messages and avoid clicking any links they contain.<\/p>\n<h3><strong>How do I recognize a phishing message?<\/strong><\/h3>\n<p>Phishing scammers often give themselves away by making simple mistakes that are easy to spot when you learn to recognize them. Look for the following phishing signs every time you open an email or text message:<\/p>\n<h3><strong>is poorly written<\/strong><\/h3>\n<p>Even the largest companies make small errors in their communications from time to time. However, phishing messages often contain grammatical and spelling errors, or other fairly obvious errors that large corporations would not make. If you see several obvious grammatical errors in an email or text requesting your personal information, you may be the target of a phishing scam.<\/p>\n<h3><strong>The logo looks weird<\/strong><\/h3>\n<p>To make it look more legitimate, phishing scammers often steal the logos of the companies they are posing as. But in many cases, they don&#8217;t steal corporate logos correctly. A logo from a phishing email or text message might have the wrong dimensions or low resolution. If you have to squint to make out the logo in a message, it&#8217;s most likely phishing.<\/p>\n<h3><strong>The URL looks suspicious<\/strong><\/h3>\n<p>Phishing always targets the links it wants you to click on. Here are some ways to check if a link someone sent you is legitimate:<\/p>\n<ul>\n<li>Without clicking, hover over the link in the email to bring up the URL. Phishing URLs often contain misspellings, or numbers instead of letters, a common sign of phishing. If you hover over the link, you will see a preview of the link. If the URL looks suspicious, don&#8217;t interact with it.<\/li>\n<li>Right click on the link, copy and paste the URL into a word processor. This will allow you to examine the link in detail, looking for spelling or grammatical errors, without being directed to the potentially malicious web page.<\/li>\n<li>To check a link&#8217;s URL on mobile devices, touch and hold it with one finger.<\/li>\n<\/ul>\n<p>If the URL that appears does not match the entity that supposedly sent you the message, you probably received a phishing email.<\/p>\n<h3><strong>Types of Phishing Emails and SMS<\/strong><\/h3>\n<p>Phishing messages come in all shapes and sizes, but there are some types that are more common than others. Let&#8217;s review some examples of the most common phishing scams:<\/p>\n<h3><strong>Suspended account scam<\/strong><\/h3>\n<p>Some phishing messages supposedly notify you that your bank has temporarily suspended your account due to unusual activity. If you receive an account suspension email from a bank you haven&#8217;t opened an account with, don&#8217;t hesitate to delete it immediately. In contrast, phishing emails about suspension of accounts from banks that you are a customer of are more difficult to detect. Use the methods we listed above to verify the integrity of the email, and if all else fails, contact your bank directly instead of opening the links within the email you received.<\/p>\n<h3><strong>Two-factor authentication scam<\/strong><\/h3>\n<p>Two-factor authentication, or 2FA, has become common, so you&#8217;ve probably gotten used to receiving emails asking you to confirm your login information with six-digit numerical codes. Phishing scammers also know that 2FA has become standard and could take advantage of this service that is supposed to protect your identity. If you receive an email asking you to sign in to an account to confirm your identity, use the criteria above to verify the authenticity of the message. Be especially careful if you&#8217;re prompted for two-factor authentication for an account you haven&#8217;t accessed in a while.<\/p>\n<h3><strong>tax refund scam<\/strong><\/h3>\n<p>We all know how important tax season is. Phishing scammers know better when they send you bogus tax refund emails. Be wary when an email informs you that you&#8217;ve received an unexpected cash refund, and be especially wary of messages purporting to be from the tax office, as these government agencies only communicate with taxpayers by mail . Tax refund phishing scams can do serious damage, often asking for your identification numbers or bank account information.<\/p>\n<h3><strong>Order confirmation scam<\/strong><\/h3>\n<p>Sometimes cybercriminals will try to trick you by sending fake order confirmation emails. These messages often contain “purchase invoices” attached to the email or links that claim to contain more information about the purported order. However, criminals often use these attachments and links to infect their victims&#8217; devices with malware.<\/p>\n<h3><strong>Phishing at work<\/strong><\/h3>\n<p>You should also be careful about phishing when using your work email. A well-known phishing scam consists of emails designed to look like those sent by a company official. These messages ask workers to transfer funds to supposed clients, but this money is actually directed to the scammers. Use the tips above to spot these scam emails.<\/p>\n<h3><strong>When phishing goes unnoticed<\/strong><\/h3>\n<p>Hackers often look for ways to update old booby traps so that they are not detected by users who are already aware of certain cyber threats. Such is the case with the latest phishing evasion technique, which detects virtual machines in order to go unnoticed. Cybersecurity companies often use screenless computers or virtual machines (a computer file that behaves like a real computer) to determine if a website is actually a phishing page. But now, some phishing kits contain JavaScript, a programming language that allows complex functions to be executed on web pages, and which checks to see if a virtual machine is parsing the page. If it detects any scan attempts, the phishing kit will display a blank page instead of the phishing page, allowing the scam to evade detection. To make sure you don&#8217;t fall for the latest phishing scams, stay up to date on the latest phishing techniques so you can stay one step ahead of cybercriminals.<\/p>\n<h3><strong>What happens if I click on a link in a phishing email?<\/strong><\/h3>\n<p>Never click on links in suspicious emails. If you click on a link sent by a phishing scammer, the link will take you to a web page with a form asking you to enter sensitive information, such as your ID, credit card information, or login credentials. session. Do not enter any data on this page.<\/p>\n<h3><strong>What should I do if I suspect that I have been a victim of phishing?<\/strong><\/h3>\n<p>If you accidentally enter data on a web page linked to a suspicious email, run a full malware scan on your device. Once the scan is complete, back up all your files and change your passwords. Even if you only provided a phishing scammer with a single account details, you may have opened the door to other personal details as well, so it&#8217;s important to change all the passwords you use online after a potential phishing attack .<\/p>\n<h3><strong>Tips for recognizing a phishing email<\/strong><\/h3>\n<p>Let&#8217;s finish with some summary tips to avoid phishing emails:<\/p>\n<ul>\n<li>When in doubt, contact the organization that allegedly sent you the message directly instead of opening links in suspicious emails.<\/li>\n<li>Examine suspicious messages closely for signs of phishing, such as bad grammar, pixelated logos, or fake links.<\/li>\n<li>If you accidentally click on a phishing link, don&#8217;t enter any data and close the page.<\/li>\n<li>If you think you&#8217;ve been a phishing target, run a virus scan, back up your files, and change all your passwords.<\/li>\n<\/ul>\n<h3><strong>keep your protection<\/strong><\/h3>\n<p>Phishing emails only work with those who are not aware of them. Now that you know how to spot them and what to do if you suspect scammers are targeting you, you&#8217;re much less likely to fall for them. Remember to be careful with your personal information when you use the Internet. Don&#8217;t be afraid to err on the side of caution in cases where someone asks you to divulge sensitive details about your identity, finances, or login information.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Examples of Phishing Emails and How to Recognize Them Suppose you receive an email from citibanamex@sucuenta.com stating that they have identified suspicious activity on your credit card statement and asking you to verify your financial information. What are you doing? While you might be tempted to click the link to resolve the issue right away, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1097,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1096"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1096"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1096\/revisions"}],"predecessor-version":[{"id":1589,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1096\/revisions\/1589"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1097"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1096"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1096"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1096"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}