{"id":1100,"date":"2022-05-25T17:52:03","date_gmt":"2022-05-25T17:52:03","guid":{"rendered":"https:\/\/infobloom.site\/learn-to-identify-scams-hidden-in-fake-job-offers-employment-economy\/"},"modified":"2022-05-25T17:52:03","modified_gmt":"2022-05-25T17:52:03","slug":"learn-to-identify-scams-hidden-in-fake-job-offers-employment-economy","status":"publish","type":"post","link":"https:\/\/infobloom.site\/learn-to-identify-scams-hidden-in-fake-job-offers-employment-economy\/","title":{"rendered":"Learn to identify scams hidden in fake job offers |  Employment |  Economy"},"content":{"rendered":"<p class=\"parrafo first-parrafo\" id=\"p513166-m56-55-57\">In a labor market with an unemployment rate that stood at 8.4% in November of last year, the search for employment by those who are unemployed or those who seek to change jobs to improve their conditions is constant. <b>Taking advantage of these needs, and also of the ingenuity of some, unscrupulous people deceive people to swindle them with false requirements and even free days of work.<br \/><\/b><br \/>(Read: Five tips to negotiate your salary in a new job)<\/p>\n<p>Legis&#8217;s Gestionhumana.com portal made a compilation of those that are <b>the 10 most common forms of scam through job offers that, in many cases, turn out to be false.<\/b><\/p>\n<p>(Read: Hand in hand with the slowdown of the last two years, youth unemployment has increased)<\/p>\n<p class=\"parrafo\" id=\"p513166-m113-3-114\"><b>REQUEST MONEY FOR MEDICAL EXAMS OR ADMINISTRATIVE EXPENSES<\/b><\/p>\n<p>&#8220;This is the main warning sign to identify a false job offer because, legally, no one has the right to demand any payment of cash or &#8220;refundable&#8221; appropriations from candidates, at a pre-selection stage,&#8221; says Ángel. Quijano, editor of Gestionhumana.com.<\/p>\n<p><b>DEMANDING TEMPORARY JOBS “DISGUISED” AS TRAINING OR TRIALS<\/b><\/p>\n<p>On other occasions, false employers convince candidates to advance one or two days of work under the pretext of measuring their abilities.  Sometimes they even force them to do street sales under the promise of hooking them.  Then, without further explanation, they tell the applicants that they were not suitable for the job or that they did not achieve the expected results.  According to Quijano, &#8220;it is clearly illegal to provide labor services without remuneration, but above all without a signed and legalized employment contract.&#8221;<\/p>\n<p><b>CALLS THROUGH NON-CORPORATE MAILS<\/b><\/p>\n<p>You have to doubt those job offers that, although they are accompanied by the logos of a recognized company, come from personal emails and without corporate domains.  According to experts, this is a way to open the door to possible scams for people looking for a vacancy. <\/p>\n<p><b>NON-EXISTENT COMPANIES<\/b><\/p>\n<p>In a context in which companies are constantly opening and closing, it is possible to receive job offers from companies that the candidate may not know.  Although it may be a legitimate call, it never hurts to verify the existence and activity carried out by the company requesting the position.  You can do it initially through the internet, on the website of the bidding company or before the competent authorities.<\/p>\n<p><b>INCONSISTENCIES IN THE REQUESTED PROFILE<\/b><\/p>\n<p>A clear sign of a potential deception or scam through job offers is when there is no consistency in the description of the required profile.  &#8220;If the profile is not well defined and the requested experience does not coincide with the minimum skills of the candidate, there is a great possibility that the vacancy is not legal,&#8221; says Quijano.<\/p>\n<p><b>CALL THROUGH SOCIAL NETWORKS<\/b><\/p>\n<p>Although social networks expand the possibilities of contacting people who share or similar interests, the offers published on them must be questioned, especially if it is done from personal accounts.  In these cases, it is advisable to go directly to the public employment service providers to look for non-misleading offers.  In this case, it is advisable to search in recognized employment portals, in public agencies or in compensation funds, where there is a verification process by the Ministry of Labor, which ensures that the offers that are being published in these sites are legal.<\/p>\n<p><b>CHECK ADDRESSES AND PHONE NUMBERS<\/b><\/p>\n<p>A basic recommendation to keep in mind in the job search process is to verify the physical address of the company and the telephone numbers, to make sure that it is a serious offer.  This is a &#8216;mandatory&#8217; step when the offer is known through social networks.<\/p>\n<p><b>DOUBTING THOSE WHO REQUEST DOCUMENTS OUTSIDE THE CURRICULUM<\/b><\/p>\n<p>It must be taken into account that it is not legal for the company to ask its candidates for other documents in addition to the resume, such as utility bills or personal documentation related to the address or personal privacy, in the first stage of recruitment. of each one.<\/p>\n<p><b>REQUEST A HOME VISIT IN THE FIRST PART OF THE SELECTION PROCESS<\/b><\/p>\n<p>It is clearly suspicious that in the pre-selection stage, and before the personal interview, there is talk of a home visit.  This may show an irregularity or a lack of attention on the part of the organization that is making the selection.  The logical thing is that before announcing a home visit, there should be a personal interview or previous contact with the candidate.<\/p>\n<p><b>REQUIREMENTS THROUGH A PHONE CALL<\/b><\/p>\n<p>The normal thing in the cases in which they call you by phone is that the company communicates to coordinate the interview or the summons to present the psychotechnical tests.  They will never request the payment of any money or the delivery of documents through a telephone call.  <\/p>\n<p>As a final recommendation, Quijano considers that in order to avoid bad experiences, it is necessary to know and learn to manage recognized employment portals, as well as understand the Public Employment Service, where employers are referenced and can give a guarantee that what they offer are job vacancies. safe.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In a labor market with an unemployment rate that stood at 8.4% in November of last year, the search for employment by those who are unemployed or those who seek to change jobs to improve their conditions is constant. Taking advantage of these needs, and also of the ingenuity of some, unscrupulous people deceive people [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1101,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1100"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1100"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1100\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1101"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1100"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1100"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1100"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}