{"id":1109,"date":"2022-05-25T20:37:43","date_gmt":"2022-05-25T20:37:43","guid":{"rendered":"https:\/\/infobloom.site\/the-amazon-invest-scam\/"},"modified":"2022-05-25T20:37:43","modified_gmt":"2022-05-25T20:37:43","slug":"the-amazon-invest-scam","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-amazon-invest-scam\/","title":{"rendered":"The Amazon &#8216;invest&#8217; scam"},"content":{"rendered":"<p>The advertising industry has invaded the internet, due to the huge public that uses it, and therefore the great joint venture with large companies such as Google or Facebook.  The ease of advertising in this medium, added to the low cost compared to television or radio, has caused the number of advertisers to be currently disproportionate and, consequently, the great difficulty in controlling so many advertisements.  It is at this point that the <strong>clickbait,<\/strong> <strong>false advertising and scams<\/strong>.<\/p>\n<p>One of the most suspicious advertisements that we can find today while surfing the net is the one that offers <strong>invest in shares of the multinational Amazon<\/strong>, with the aim of not only recovering the investment, but also generating incredible profits in a short time.  What is true about these ads?  Is it really worth the investment?<\/p>\n<h4>what is this advertisement<\/h4>\n<p>The first point to address is the most basic: what advertising is it about?  They give us the opportunity to invest a not too high amount (around 200 euros) in alleged Amazon shares, stating that, thanks to the success of this company, <strong>those actions will create almost immediate economic benefits<\/strong> that we can enjoy.  The reality is somewhat different, since <strong>we are not buying shares<\/strong>, but in a financial derivative called contract for difference -CFD-.  These derivatives reflect the value of the price to us, but at no time are we owning those shares, we only have a contract with the <strong>broker<\/strong>, on which our money depends.  Investing using this route leads us to financial leverage, which we explain in the following chart.<\/p>\n<\/p>\n<p>It could also be the case of a positive movement that brings us benefits, but <strong>this probability is<\/strong> <strong>tiny <\/strong>taking into account above all that the people participating in this way to invest are unaware of this world.  In fact, the websites where these investments are made are obliged to show how successful they are, but, of course, they do so using the fine print.<\/p>\n<p><\/p>\n<p style=\"text-align: center;\">Examples of ads on different web pages.<\/p>\n<h4>why fool us<\/h4>\n<p>It may seem like a very obvious question, but it never hurts to clarify it.  They obviously want our money, but not all of it, they prefer many people to invest 200 euros, since <strong>his business is to attract many small investors.<\/strong> The people who manage this type of pages are called <strong>Introducing Broker<\/strong> (IB), and it could be said that they are mere intermediaries between the investor and the true broker, which is usually a company located in countries with more flexible laws in this area.  IBs <strong>they earn money for each investor they attract<\/strong> using those ads we analyzed.  Héctor Mohedano, private banking manager and expert in Spanish stock markets and markets, regrets that &#8220;they take advantage of ignorance&#8221; and that these advertisers &#8220;move in the line between what can be done and what cannot&#8221;, in addition to affirming that &#8221; we must distrust everything that guarantees us great profits, if you have doubts the best thing is to advise you with a professional”.<\/p>\n<h4>False advertising or phishing?<\/h4>\n<p>We can start by defining both concepts.  The <strong>false advertising<\/strong> It is described by the portal significations.com as &#8220;that which transmits false, incomplete or doubtful information about a product or service in order to mislead the consumer into an error so that he invests money in something that is not really what is exposed&#8221; .  For its part, Panda Security defines the <strong>phishing <\/strong>such as &#8220;sending emails that appear to come from trusted sources (such as banks, energy companies, etc.) but are actually intended to manipulate the recipient to steal sensitive information.&#8221;<\/p>\n<p>Considering the explanations about this scam, <strong>looks closer to the concept of misleading advertising<\/strong>, since the objective is not to obtain the credit card number, but for the user to invest, in addition to the fact that at no time do they impersonate any company or reliable person.  What they are trying to do is convince you that by spending a certain amount of money you will get a high profit.<\/p>\n<p>In any case, it is considered illicit advertising, mentioned in Article 3 of Law 34\/1988:<\/p>\n<blockquote>\n<p>It is illegal:<\/p>\n<p>e) Misleading advertising, unfair advertising and aggressive advertising, which will have the character of acts of unfair competition in the terms contemplated in the Unfair Competition Law.<\/p>\n<\/blockquote>\n<p style=\"text-align: center;\"><img alt=\"Screenshot of an email about investing in Amazon.\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/The-Amazon-invest-scam.gif\" class=\"lazyload\"  \/>Screenshot of an email about investing in Amazon.<\/p>\n<p>There are two main ways through which the creators of this advertising operate: <strong>email and google ads<\/strong>.  In the first, not much can be done since, after all, they are personal emails and should not be controlled.  The conflict is born in the second.  It is an unknown <strong>why google allows these types of ads to show<\/strong>and more so when the following is stated on its ad policy page:<\/p>\n<blockquote>\n<p>We want users to trust the ads on our platform.  That&#8217;s why we insist that these be clear and honest, and that they provide users with the information they need to make informed decisions.  We do not allow ads or destinations that mislead users by omitting relevant product information or providing misleading information about products, services, or companies.<\/p>\n<\/blockquote>\n<p>The multinational has not yet proposed solutions for this type of advertising, so it is up to us as users to inform and denounce each time we see one of them, in addition to remembering that money never comes so easy.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The advertising industry has invaded the internet, due to the huge public that uses it, and therefore the great joint venture with large companies such as Google or Facebook. The ease of advertising in this medium, added to the low cost compared to television or radio, has caused the number of advertisers to be currently [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1112,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1109"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1109"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1109\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1112"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1109"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1109"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1109"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}