{"id":1113,"date":"2022-05-25T21:11:17","date_gmt":"2022-05-25T21:11:17","guid":{"rendered":"https:\/\/infobloom.site\/nfts-and-the-global-registry-of-digital-asset-owners-in-the-metaverse\/"},"modified":"2022-05-25T21:11:17","modified_gmt":"2022-05-25T21:11:17","slug":"nfts-and-the-global-registry-of-digital-asset-owners-in-the-metaverse","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nfts-and-the-global-registry-of-digital-asset-owners-in-the-metaverse\/","title":{"rendered":"NFTs and the global registry of digital asset owners in the Metaverse"},"content":{"rendered":"<p>The <i><b>Non-Fungible Tokens<\/b><\/i>  either <i><b>NFT&#8217;s<\/b><\/i>  They catch my attention from minute one of their conception.  The idea of ​​removing from the digital world one of the most common properties, and bringing one of the properties of the physical world to remove it, is striking.  I talked about it in the &#8220;Playing god with technology&#8221; article that I published in my &#8220;The future is yet to be hacked&#8221; section.<br \/><\/p>\n<p><i>Figure 1: NFTs and the global registry of<\/i><\/p>\n<p><i>the owners of digital assets in the Metaverse<\/i><\/p>\n<p><\/p>\n<p>The <i><b>NFT&#8217;s<\/b><\/i>  they remove, or should remove, the ability for anyone to be the owner of the same digital object.  That is, guarantee that the owner of a digital asset is only one person.  That only one can obtain the rights that the possession of that digital asset gives.  And my head exploded when he started playing with this idea in the beginning.  Let me explain why.<\/p>\n<p><b><u>The global registry of digital asset owners<\/u><\/b><\/p>\n<p>This is the key idea.  Suppose we use one of the many Blockchain chains we have and we anchor in it the data of the owner of a digital object and anyone can consult it, and apply the rights that possession grants to the user.  This would allow you to always prove that you are the sole owner of that digital object, and preserve the cost and benefit that the possession of that asset has.  Let me explain with some examples. Suppose we buy art.  Artistic compositions in the form of videos, photos, sculptures, digital paintings, collections, etc., and the possession of them grants the right of total possession of that work through a SmartContract in which the contract of sale of that object is.  That is, that object has been sold with all the consequences in the digital world.<\/p>\n<p>Now suppose that three virtual worlds of the many that can be in the <i><b>metaverse<\/b><\/i>for example <i><b>Fortnite<\/b><\/i>, <i><b>Goal<\/b><\/i>, <i><b>Roblox<\/b><\/i>  either <i><b>Minecraft<\/b><\/i>decide to respect the property rights of the objects that are used in their virtual world, and each time one of the virtual objects is used in the form of <i><b>NFT<\/b><\/i>  is consulted &#8220;<u><i><b>the global registry of digital asset owners<\/b><\/i><\/u>&#8221; to see if a user can load it and use it in their virtual world.<\/p>\n<p><img border=\"0\" data-original-height=\"678\" data-original-width=\"940\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653513077_10_NFTs-and-the-global-registry-of-digital-asset-owners-in.jpeg\" width=\"470\"\/><\/p>\n<p>If these three characteristics were present, those virtual worlds would have agreed to eliminate the digital copy &#8211; something that in <i><b>Internet<\/b><\/i>  it was one of the great growth engines where anyone could access a copy of a song, picture, sheet music, book or movie &#8211; from those virtual worlds.<\/p>\n<p>In other words, suppose that the owner of the rights to a work in the physical world, such as Iker Casillas&#8217; gloves in the final of the <i><b>World Cup in South Africa<\/b><\/i>.  Let us imagine that the owner of those gloves, which will be a sports house, decides to sell them in the form of <i><b>NFT<\/b><\/i>  sole possession of those gloves.  That is, the owner of that <i><b>NFT<\/b><\/i>  is the one that has bought all the digital rights of use and commercialization of those gloves.  Or the same of a painting of Okupa.  Let us imagine that the great <i><b>okuda<\/b><\/i>  decides to make a painting in the digital world that only exists in the digital world and, instead of selling the frame, with the paintings, with his things, he sells his work in the form of <i><b>NFT<\/b><\/i>.The next fundamental step would be for the virtual worlds of the <i><b>metaverse<\/b><\/i>that is, the ones that in my example would be <i><b>Fortnite<\/b><\/i>, <i><b>Goal<\/b><\/i>, <i><b>Roblox<\/b><\/i>  Y <i><b>Minecraft<\/b><\/i>, they will consult that world registry of the owners of digital assets and allow to load or not, that object in the form of Iker Casillas&#8217; glove or Okuda&#8217;s painting within their digital world.  So the owners would be the only ones able to use them within those worlds.  They would be the only ones who could wear that glove as an avatar, or a museum could be built like the <i><b>Prado Museum<\/b><\/i>  within those virtual worlds, being only that place the only one that can exhibit those works, because they are the only ones that have that <i><b>NFT<\/b><\/i>.<\/p>\n<p>Of course, this has many &#8220;<i><b>ifs<\/b><\/i>&#8220;why manage that&#8221;<i><u><b>global registry of digital asset owners<\/b><\/u><\/i>&#8220;It would make it necessary to prove possession of the objects that are being marketed. It would no longer be registering the purchase process, but rather we would need another piece in the process, that is, how we register <i><u><b>&#8220;who is the first owner of a digital object not yet signed&#8221;<\/b><\/u><\/i>.<\/p>\n<p>That is, in <i><b>Open Sea<\/b><\/i>  a user has been put to sell <i><b>NFT&#8217;s<\/b><\/i>  of one of the images of Electronic Calico.  Of course it wasn&#8217;t us, we are the owners of Electronic Clico.  Any user has started to generate <i><b>NFT&#8217;s<\/b><\/i>  of images downloaded from the Internet that he sells in the form of <i><b>NFT&#8217;s<\/b><\/i>  in the shop of <i><b>Open Sea<\/b><\/i>.<br \/><img border=\"0\" data-original-height=\"771\" data-original-width=\"470\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653513077_508_NFTs-and-the-global-registry-of-digital-asset-owners-in.jpeg\"\/><\/p>\n<p><i>Figure 3: Fake NFT created with the Electronic Calico image in OpenSea<\/i><\/p>\n<p><\/p>\n<p>The buyer of those images is buying a <i><b>NFT<\/b><\/i>  without any value, since it is nothing more than a copy of an image that does not grant any right, neither the printing, nor the exhibition nor the use, nor of commercialization, nor of anything.  It&#8217;s just a simple signature in the form of <i><b>NFT<\/b><\/i>  in <i><b>Open Sea<\/b><\/i>  of an image that is on thousands of Internet sites. <\/p>\n<p>So, for this to work, we have to put in a process of authentic verification &#8211; at least the first time &#8211; of who owns a digital object.  So Okuda or the company that owns the rights in the physical world of Iker Casillas&#8217; gloves should make a strong, robust and sure verification that <i><b>okuda<\/b><\/i>  it is <i><b>okuda<\/b><\/i>that the painting has done <i><b>okuda<\/b><\/i>, and then register it as the first owner.  That is, we need the figure of <i><b><u>Notary<\/u><\/b><\/i>  and the <i><u><b>Registry<\/b><\/u><\/i>.<\/p>\n<p>But&#8230; how much would an object be worth in the digital world, for example, those leather gloves? <i><b>Iker Casillas<\/b><\/i>  or that painting <i><b>okuda<\/b><\/i>  if no one but the owner of that object could use it in the whole <i><b>metaverse<\/b><\/i>?  Well, a lot of money, surely.  But the fact is that if this were so, if we were able and decided to carry out this control, piracy would end in the <i><b>metaverse<\/b><\/i>.  It would be like turning around what has been <i><b>Internet<\/b><\/i>  for decades.<\/p>\n<p>Now imagine that in the <i><b>metaverse<\/b><\/i>  The same thing happened with books, songs and movies.  That is, only the one with a <i><b>NFT<\/b><\/i>  with the reproduction right could listen, see or read one of those objects in the <i><b>metaverse<\/b><\/i>. <\/p>\n<p>And my head flies.<\/p>\n<p>The truth is that we are still only at the dawn of this world.  Today you can buy objects in virtual worlds that use the image of trademarks, companies, and registered products.  For example, you can buy avatars with the design of <i><b>Electronic Calico<\/b><\/i>  which is a registered trademark.  You can design your own avatar by copying that of a registered trademark.  You can decorate a house with a copy of anyone&#8217;s painting, you can do a thousand things that the companies behind the platforms have not wanted to control.<\/p>\n<p>The question I ask myself is, will they want in the <i><b>metaverse<\/b><\/i>  control the possession of objects by means of <i><b>NFT&#8217;s<\/b><\/i>?  Will copying of objects be allowed, everyone can use it, but one will be the &#8220;original&#8221;?  Will the origin of a <i><b>NFT<\/b><\/i>?  These questions will mark a lot the evolution, and of course the price of the objects.  Because the same is not true depending on the case, and, of course, each action has a reaction, just as commercial software was followed by the appearance of <i><b>free software<\/b><\/i>or to &#8220;<i><b>control<\/b><\/i>&#8221; in <i><b>Internet<\/b><\/i>  FreeNet, TOR or I2P emerged on the Deep Web.<br \/>\n<center><br \/>\n      <\/center><\/p>\n<p>What is clear is that this technology, that is, <i><b>NFT&#8217;s<\/b><\/i>Smart Contracts <i><b>&#038;<\/b><\/i>  BlockChain can allow that, that in a virtual world only the owner of it has a digital object, but applying this implies creating bureaucracy, processes, and giving a big steering wheel turn to what has been the world of <i><b>Internet<\/b><\/i>  today.  And being the first to do this can give many advantages, or mean that users seek other virtual worlds without controls.  Who knows.  But it&#8217;s going to be exciting to see this revolution.<\/p>\n<p>Greetings Evil!<\/p>\n<p>\n<img border=\"0\" data-original-height=\"444\" data-original-width=\"800\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/NFTs-and-the-global-registry-of-digital-asset-owners-in.jpg\" width=\"450\"\/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Non-Fungible Tokens either NFT&#8217;s They catch my attention from minute one of their conception. The idea of ​​removing from the digital world one of the most common properties, and bringing one of the properties of the physical world to remove it, is striking. I talked about it in the &#8220;Playing god with technology&#8221; article [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1113"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1113"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1113\/revisions"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1113"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1113"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1113"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}