{"id":1118,"date":"2022-05-25T21:41:55","date_gmt":"2022-05-25T21:41:55","guid":{"rendered":"https:\/\/infobloom.site\/propheco-fraud-alert-of-an-agency-with-30-extortion-complaints\/"},"modified":"2022-05-25T21:41:55","modified_gmt":"2022-05-25T21:41:55","slug":"propheco-fraud-alert-of-an-agency-with-30-extortion-complaints","status":"publish","type":"post","link":"https:\/\/infobloom.site\/propheco-fraud-alert-of-an-agency-with-30-extortion-complaints\/","title":{"rendered":"Propheco fraud alert of an agency with 30 extortion complaints"},"content":{"rendered":"<p class=\"antetitulo\" style=\"margin-top: 10px;\">which begins with an informative talk<\/p>\n<p class=\"autor\" style=\"font-size: 12px; margin: 10px 0;\">RR |  Mexico City |  May 30, 2017<br \/>\n     600 comments\n\t\t<\/p>\n<p class=\"relacionadosSingle\"><b>RELATED TOPICS: Ghost travel agencies, Mexico City, Extortion, Fraud, Public Ministry, Profeco<\/b><\/p>\n<p>The Federal Consumer Attorney&#8217;s Office (Profeco) warned about the fraud in which the company with the Latin American and Caribbean Association of Travel Agencies SA de CV is incurring, which has accumulated in the last year, more than 30 complaints for extortion to his “clients” and refuses to conciliate in order to reach an agreement with them.<\/p>\n<p>The call was made after the anonymous complaint of an affected person was made public, who took her case to the media, which has been replicated several times, but so far has only resulted in 30 formal complaints.<\/p>\n<p>According to the testimony, the agency scheduled an appointment at a hotel on Paseo de la Reforma in Mexico City, to receive a travel-related award.  To grant it, you must provide your identification and credit card, as well as listen to the information about memberships, trips and destinations.<\/p>\n<p>This is a common practice of several operators and companies in the tourism industry in Mexico, however, on this occasion, the informative talk translates into extortion, where the client is forced to buy the memberships, and they are made to sign and acknowledge the charges. , for the services purchased.  The scam ends with a group of people escorting clients to the outskirts of the appointment venue.<\/p>\n<p>Despite having all the data of the companies, both the one that extorts and those that facilitate its operation, mostly hotels, Profeco has only limited itself to warning not to attend this type of meeting.<\/p>\n<p>The complaints filed with the Public Ministry remain without progress, so the possibility that the number of affected increases is very high;  also due to the lack of information from the public, which allows them to be an easy target for scammers, affecting the image of the formal industry.  (Ghost travel agencies ripping off card users.)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>which begins with an informative talk RR | Mexico City | May 30, 2017 600 comments RELATED TOPICS: Ghost travel agencies, Mexico City, Extortion, Fraud, Public Ministry, Profeco The Federal Consumer Attorney&#8217;s Office (Profeco) warned about the fraud in which the company with the Latin American and Caribbean Association of Travel Agencies SA de CV [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1041,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1118"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1118"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1118\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1041"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1118"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1118"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1118"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}