{"id":1119,"date":"2022-05-25T22:21:48","date_gmt":"2022-05-25T22:21:48","guid":{"rendered":"https:\/\/infobloom.site\/immersive-nfts-the-digital-fever-how-access-keys-to-3-0-experiences-work-epu\/"},"modified":"2022-05-25T22:21:48","modified_gmt":"2022-05-25T22:21:48","slug":"immersive-nfts-the-digital-fever-how-access-keys-to-3-0-experiences-work-epu","status":"publish","type":"post","link":"https:\/\/infobloom.site\/immersive-nfts-the-digital-fever-how-access-keys-to-3-0-experiences-work-epu\/","title":{"rendered":"Immersive NFTs, the digital fever: how access keys to 3.0 experiences work &#8211; EPU"},"content":{"rendered":"<p>Human heat, digital fever.  Maybe it&#8217;s about building on the obvious, but today the intrinsic value of the shows is possibly ahead of any type of experience: <strong>collective energy, irreplaceable connection<\/strong>.  However, the hearings <strong>they are more and more demanding<\/strong>increasingly proactive, seek to feel part of it and, with that impetus, long to amplify narratives towards new territories. <\/p>\n<p>“Immersive experiences come to fulfill just that: <strong>amplify the connection and continue to generate value between artists, brands or content and their communities<\/strong>&#8220;, Explain <strong>Manuela Kohlhuber<\/strong>, from WEPLAY CREATORS, a company dedicated to telling stories on the blockchain.  Stories that, strictly speaking, function as access keys to experiences 3.0.<\/p>\n<p>These days, from WEPLAY CREATORS they walk with their chests inflated since they come from successfully presenting Mute Immersive Experience, a milestone that proposed u<strong>A new experience in the world of electronic parties<\/strong>.<\/p>\n<p>  &#8220;An audio experience from another planet will transport you to a moment where you are the protagonist,&#8221; sold the flyer with a huge image of the Bosnian-German DJ Solomun.  “The experience included unlocking an insider access key, backstage tour passes, stage locations, production parking.<strong> Something that is often only accessed by those who work on the other side of the stage and not the public<\/strong>”, tells Manuela.<\/p>\n<p>“On Broadway and Hollywood there are already projects where, by buying an NFT, the owner can participate with the producers in key decisions such as the choice of actors, music and story elements.”<br \/>Manuela Kohlhuber, from WEPLAY CREATORS<\/p>\n<h2>The rise of NFTs<\/h2>\n<p>Meanwhile, the steam of the discussion rises towards the world of NFTs, the main password of these proposals.  There, then, the weight of <strong>how much can be innovated in that universe<\/strong>.  &#8220;Beyond the bubble and the controversy around what is or is not art, we perceive that innovation could be more related to<strong> opportunities to engage audiences<\/strong> directly, both in the creation of the work of their favorite artist and in profits, giving an economic return from the business to their followers or other types of benefits such as &#8216;tangible&#8217; experiences”, explains Moni Bega, from WEPLAY CREATORS.<\/p>\n<p>In that sense, NFTs function as <strong>ownership and creation certifications<\/strong>, validated by smart contracts.  &#8220;Thinking about this possibility of technology in favor of artists, I suppose that innovation will depend on how much each one is willing to take risks and get involved with their audiences,&#8221; continues Bega. <\/p>\n<p>For instance, NFTs open a <strong>cosmos of possibilities to, precisely, amplify the clarity of live shows and connect with fans before, during and after it<\/strong>.  They became a tool to interact and build community loyalty, which puts fans in a participatory place, as protagonists, and <strong>revolts the old notion of mere passive consumers<\/strong>.<\/p>\n<p>“On Broadway and Hollywood there are already projects where, when you buy an NFT, you unlock not only access to exclusive content, but also to the process of creating plays or series: the owner of the NFT <strong>can participate alongside the producers in key decisions such as the choice of actors, music and story elements<\/strong>”, details Manuela.<\/p>\n<p>In her case, like many, both Manuela and Moni came to the blockchain and web3 in the midst of a pandemic.  There, in that confinement, creativity prevailed and, in the absence of physical contact and presence, it was necessary to <strong>consolidate new alternatives<\/strong>.  “We work in the entertainment industry and with the total closure all our projects stopped. <\/p>\n<p>We started a search to reinvent ourselves, we began to look at what was happening in our industry in the rest of the world and what we could do from here to offer our artists <strong>new ways to monetize your art<\/strong>, through more transparent agreements.  And, also, to stay connected with their communities”, reveals Kohlhuber.<\/p>\n<p><img loading=\"lazy\" width=\"640\" height=\"354\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/Immersive-NFTs-the-digital-fever-how-access-keys-to-30.png\" alt=\"\" class=\"wp-image-70890\"   data-recalc-dims=\"1\"\/> “An NFT can be the certification of originality of almost anything that has value for a certain market: from a meme, a tweet, an image, a musical single, a video clip or a piece of art.” <\/p>\n<h2>Bubbles in the air?<\/h2>\n<p>At that time, the advance of NFTs and “crypto-art” in society also brought about another discussion linked to the true place they occupy and, likewise, from there, the possibility that they manifest as “bubbles” arises. <strong>Some bubbles that could well explode.<\/strong> <\/p>\n<p>In fact, clinging to that idea, even the animated series South Park –in its brand new pandemic specials– acidly slides this conjecture. <strong>“It happens as with everything that is new.  It is inevitable that both enthusiasts and detractors will emerge<\/strong>.  Today, the irruption of this &#8216;new&#8217; technology touches the interests and foundations of all industries, not only art, where a certain resistance is understandable, above all because there is also as much to unlearn as to learn”, says Bega.<\/p>\n<p>It is that, despite the media boom (with the enormous interest of the press that causes a kind of excitement among users), <strong>the phenomenon is still in very early stages<\/strong>.  &#8220;Crypto-art shares the logic of the traditional art market that recognizes a value in the intangible and, with the incorporation of renowned personalities, manages to make novelty visible and install the theme of technological change, possibly with political and social consequences,&#8221; supports Bega. .  And he continues: “Each step resignifies and <strong>redefines our roles in the entertainment industry<\/strong>”.<\/p>\n<h2>The functions of NFTs<\/h2>\n<p>In this context, NFTs can cover all possible scenes, whether artistic or not.  Strictly speaking, an NFT can be the certification of originality of almost anything that has value for a certain audience or market: <strong>from a meme, a tweet, an image, a musical single, a video clip, a piece of art or, really, anything<\/strong>.  &#8220;At WEPLAY we venture into those that are of interest and help us measure audiences,&#8221; says Bega.<\/p>\n<p>In this sense, the experiential value of the new digital immersions also makes up another heartbeat: the owners of the NFTs will be able to keep an immutable proof of having been there, at that precise moment where the events took place (an electronic party, a recital, a basketball game, a political party, a birthday with chips and sticks, whatever), replacing the old habit of keeping concert tickets as memorabilia in a drawer. <strong>The famous &#8220;I was there&#8221; but erected from the zeros and ones of the digital Matrix<\/strong>.<\/p>\n<p>From here on, anything can happen.  And while the electronic music scene seems to be a step ahead –many consider themselves to be early adopters of this technology, and there was even an interesting exchange of NFTs and content between national creators Samot Club and Solomun–, <strong>the rest of the artistic galaxy seems to be waiting for immersive experiences<\/strong>. <\/p>\n<p>And in our country, the adoption of NFTs compresses an educational stage where the tangible still weighs but, as was seen with the <strong>Mute Immersive Experience<\/strong>, there is an irrepressible desire to unlock new scenarios.  And that this kind of hole from Alice in Wonderland deposits them elsewhere, <strong>with other textures, with other anecdotes, with other perspectives, with other forms of consumption, with new collisions with the future<\/strong>.<\/p>\n<p><img loading=\"lazy\" width=\"640\" height=\"360\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653517308_665_Immersive-NFTs-the-digital-fever-how-access-keys-to-30.jpg\" alt=\"\" class=\"wp-image-70892\"   data-recalc-dims=\"1\"\/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Human heat, digital fever. Maybe it&#8217;s about building on the obvious, but today the intrinsic value of the shows is possibly ahead of any type of experience: collective energy, irreplaceable connection. However, the hearings they are more and more demandingincreasingly proactive, seek to feel part of it and, with that impetus, long to amplify narratives [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1123,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1119"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1119"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1119\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1123"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1119"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1119"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1119"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}