{"id":1138,"date":"2022-05-26T00:12:21","date_gmt":"2022-05-26T00:12:21","guid":{"rendered":"https:\/\/infobloom.site\/telefonica-creates-a-collection-of-nfts-together-with-ferran-adria\/"},"modified":"2022-05-26T00:12:21","modified_gmt":"2022-05-26T00:12:21","slug":"telefonica-creates-a-collection-of-nfts-together-with-ferran-adria","status":"publish","type":"post","link":"https:\/\/infobloom.site\/telefonica-creates-a-collection-of-nfts-together-with-ferran-adria\/","title":{"rendered":"Telefónica creates a collection of NFTs together with Ferran Adrià"},"content":{"rendered":"<p><\/p>\n<p>Telefónica today launches a collection of 114 NFTs associated with a series of 114 unique drawings in digital format made by Ferran Adrià that symbolize the history of culinary evolution.  Each NFT is an exclusive digital copy of each drawing, which is accompanied by a digital certificate of authenticity registered in the Blockchain that allows the attribution and proof of ownership of the content.  NFTs are non-fungible tokens, that is, a cryptographic asset that is certified as unique and unrepeatable.<\/p>\n<p>The collection was made by Ferran Adrià in 2013 and has been exhibited in prestigious galleries and international art fairs such as New York, Miami, Madrid or Buenos Aires, among other places.  In them he develops the theory of culinary evolution trying to capture the genealogy of the beginnings of gastronomy and break with them the usual account of the beginnings of humanity.<\/p>\n<p>Telefónica issues NFTs through TrustOS, a product developed and marketed by Telefónica Tech to make it easier for companies to interact with public and private Blockchain networks.  TrustOS processes the digitized collection of drawing images, uploads them to IPFS, the web3 decentralized reference storage system, and certifies the authenticity of the drawings before creating the NFT with a reference to both the image and the certificate.  The evidence included in the certificate serves to prove the ownership of the images in case of unauthorized publication of them, since the buyer will have ownership of the NFT, but not the intellectual and exploitation property of the drawing.<\/p>\n<p>The cost per NFT is 0.1846 Ether, which is equivalent to approximately 500 euros.  The collection of NFTs is sold through the elBullifoundation website or directly on OpenSea, the most widely used marketplace for exchanging NFTs.  All proceeds will go to elBullifoundation, a foundation that contributes to enhancing the gastronomic legacy created in elBulli throughout its history.<\/p>\n<p>To improve the experience of users interested in acquiring the NFTs of the drawings made by Ferran Adrià, Telefónica has developed a 3D space where it is possible to visit the collection, recreating the physical environment where the drawings will be exhibited in elBulli1846, the new museum space created at the elBulli location.  It is a virtual space enabled by TrustOS where the drawings are exhibited, constituting an immersion in the metaverse, which is connected to OpenSea to complete the purchase process.  All this with a multi-device interface and accessible from any web browser, without the need for glasses or other immersive devices.<\/p>\n<p class=\"has-medium-font-size\"><strong>See more: El Corte Inglés creates its own crypto exchange<\/strong><\/p>\n<p>Ferran Adrià comments: “This project reaffirms the mutual commitment that we established in 2010 with Telefónica as elBullifoundation&#8217;s technological partner.  The evolution of humanity is linked to the evolution of cooking and technology and in this collection of NFTs we bring together all these elements to promote innovation as a transforming element of society”.<\/p>\n<p>Yaiza Rubio, Chief Metaverse Officer at Telefónica, states: “We celebrate going hand in hand with Ferran Adrià in the first collection of NFTs from his personal drawing collection.  At Telefónica we are committed to continuing to explore use cases in the new technologies associated with NFTs, blockchain, Web3 and metaverse that represent the enormous business opportunity that they mean for the different industries and sectors”.<\/p>\n<p>With each NFT from this collection, you will have exclusive access to elBulli1846, the headquarters of elBullifoundation in Cala Montjoi, in Roses, before its official opening once the museification works are completed in the middle of next year 2023. In addition, each NFT grants a preferential right of acquisition in the next collection that goes on sale in the elBullifoundation profile of the marketplace.<\/p>\n<p><img loading=\"lazy\" width=\"1024\" height=\"537\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653523941_128_Telefonica-creates-a-collection-of-NFTs-together-with-Ferran-Adria.jpg\" alt=\"\" class=\"wp-image-149539\"  \/><\/p>\n<h2 class=\"has-medium-font-size\"><strong>Telefónica bets on the technologies of the future<\/strong><\/h2>\n<p>In the last edition of the Mobile World Congress (MWC), Telefónica Tech announced an agreement with Polygon, reinforcing the strategic positioning of its TrustOS product as an accelerator that allows the most appropriate combination of public and private Blockchain networks.  In addition, they anticipated that the solutions developed on TrustOS would have a new module available on the platform so that companies could easily issue and publish NFTs.  In this sense, the project with the work of Ferran Adrià is the first in which Telefónica issues NFTs in a public network.<\/p>\n<p>At the MWC, Telefónica also announced an agreement with Meta to jointly expand and explore metaverse technologies and announced the joint creation of a &#8216;Metaverse Innovation Hub&#8217; in Madrid for network, infrastructure and technological innovation testing for startups and developers.  It also launched Open2metaverse, a global search for startups with metaverse use cases.  With all these actions, the company reinforces its commitment to new technologies and highlights the possibilities that it can offer to companies and also to users in this digital environment of the future.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Telefónica today launches a collection of 114 NFTs associated with a series of 114 unique drawings in digital format made by Ferran Adrià that symbolize the history of culinary evolution. Each NFT is an exclusive digital copy of each drawing, which is accompanied by a digital certificate of authenticity registered in the Blockchain that allows [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1141,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1138"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1138"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1138\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1141"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1138"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1138"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1138"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}