{"id":1142,"date":"2022-05-26T01:27:01","date_gmt":"2022-05-26T01:27:01","guid":{"rendered":"https:\/\/infobloom.site\/the-by-mistake-transfer-scam-the-virtual-scam-that-simulates-sending-more-money\/"},"modified":"2022-05-26T01:27:01","modified_gmt":"2022-05-26T01:27:01","slug":"the-by-mistake-transfer-scam-the-virtual-scam-that-simulates-sending-more-money","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-by-mistake-transfer-scam-the-virtual-scam-that-simulates-sending-more-money\/","title":{"rendered":"The &#8220;by mistake&#8221; transfer scam: the virtual scam that simulates sending more money"},"content":{"rendered":"<p class=\"paragraph\">While many hacks, phishing, or ransomware require high tech savvy, most modern digital scams are much simpler and closer to home. <b>the classic “uncle stories”, but in a virtual version.<\/b> The new method involves a supposed purchase, a large transfer with an error and finally tricking the victim into transferring money or providing access to their home banking.<\/p>\n<p class=\"paragraph\">The system, similar to one that had already been denounced in Córdoba, has now reached San Juan.  A user reported on Facebook that someone contacted her about something she was selling, and that she was going to make a bank transfer to secure it.<\/p>\n<p class=\"paragraph\">The scam was not long in coming: the alleged buyer called her desperate because <b>Instead of 10,000 pesos, “he got confused” and sent him 100,000.<\/b><\/p>\n<p class=\"paragraph\">“In the minutes <b>They call me from the &#8216;Bank&#8217;, and they begin to give me the step by step that I should follow<\/b>they came to us at the same time as the call from the Santander code and they kept asking me to dictate it to them and thus they managed to block my homebanking to which we were unable to gain further access and when we went to the ATM we realized that they had emptied us completely the account”, detailed the woman in an extensive post.<\/p><source type=\"image\/jpg\" media=\"(max-width: 728px)\" \/><source type=\"image\/jpg\" media=\"(max-width: 1023px)\" \/><source type=\"image\/jpg\" \/><\/p>\n<p class=\"paragraph\">In addition to stealing the money from the account, they also took a bank loan, something that the Central Bank began to regulate very recently, and even made a transfer of 10,000 pesos through Mercado Pago.<\/p>\n<p class=\"interstitial--link margin_top-md margin_bottom-md\">\/\/ Banking scams: the new controls of the Central Bank and keys to avoid being victims of cybercriminals<\/p>\n<p class=\"paragraph\">“I am destroyed, they did not just steal money from us, they have stolen the effort of a long time at the cost of work and the hardest, believe me.  They took the last weight out of us,&#8221; added the victim, who shared it on networks to prevent others from falling into the same trap.<\/p>\n<h2 class=\"font--primary\">transfer error<\/h2>\n<p class=\"paragraph\">In cordoba, <b>trying to sell an armchair, a man fell into a similar trap<\/b>.  But they didn&#8217;t even have to &#8220;hack&#8221; his home banking: he made the transfer to the scammers.<\/p>\n<p class=\"paragraph\">Juan Pablo posted an armchair he owned on an online sales site.  He asked for 12 thousand pesos.  A person was interested in acquiring the piece of furniture and thus began a<b> exchange of messages via WhatsApp<\/b>.  After agreeing, he received a message that closed the agreement.  “Juan, there my wife made the transfer to you.  I am working.  We&#8217;ll talk in a little while, so we coordinate well, ”said the man who had shown interest in her chair.<\/p>\n<p class=\"interstitial--link margin_top-md margin_bottom-md\">\/\/ &#8220;Change me dollars, it&#8217;s urgent&#8221;: the new story of the digital uncle to scam by WhatsApp<\/p>\n<p class=\"paragraph\">Before long, the joy of the sale turned into a problem.  &#8220;Juan, listen to me, can you help me please, my wife&#8230; <b>There was a mistake.  He sent you extra money.  please attend me<\/b>”, exclaimed the would-be buyer.<\/p>\n<p class=\"paragraph\">That&#8217;s where the deception started.  The man told him that his wife had inadvertently added a zero to the agreed amount and <b>instead of 12,000 pesos he had transferred 120,000<\/b>.  And he sent her the capture of the supposed banking operation, with the logo of a well-known bank, his CBU number and the figure that he would have sent him by mistake.<\/p>\n<p class=\"paragraph\">That&#8217;s where Juan Pablo&#8217;s mistake came in, who trusted in the desperation of the supposed client.  And he believed that the voucher was true without expecting to see the amount reflected in his account through home banking.<\/p>\n<p class=\"paragraph\">“You enter in such a way that you end up feeling sorry and you end up doing the steps that he indicates to you,” he told her. <i>Telenoche<\/i>.<\/p>\n<p>The one that puts the digital community on alert (Photo: capture from Telenoche)<\/p>\n<p class=\"paragraph\">He added: “He caught me off guard.  You will never think that this type of situation will appear out of nowhere. <b>One tries to act in good faith to solve a problem for the person who was going to make the purchase and in reality he was scamming me<\/b>”.<\/p>\n<p class=\"paragraph\">Juan Pablo then transferred the difference to him: <b>108,000 pesos<\/b>.  &#8220;At one point it caught my attention because the transfer was not appearing and I thought&#8230; it&#8217;s Saturday and it takes time to visualize it,&#8221; she concluded.<\/p><source type=\"image\/jpg\" media=\"(max-width: 728px)\" \/><source type=\"image\/jpg\" media=\"(max-width: 1023px)\" \/><source type=\"image\/jpg\" \/><img loading=\"lazy\" class=\"margin_bottom image flex flex_column image_placeholder\" alt=\"The \"by mistake\" transfer scam: the virtual scam that simulates sending more money\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/The-by-mistake-transfer-scam-the-virtual-scam-that-simulates.jpg\"\/><\/p>\n<h2 class=\"font--primary\">Tips to avoid cyber scams<\/h2>\n<ul class=\"ul__list list\">\n<li class=\"list__item\">if received <b>a notice about a suspected error in making a bank transfer, these messages should not be responded to. <\/b>In case of any doubt, <b>You must contact the bank by phone.<\/b>.  It has to be the client who calls and never accept a call supposedly originated in the entity. <b>It is a new illegal practice detected that simulates an error in a bank transfer for the purchase of an offered good.<\/b><\/li>\n<li class=\"list__item\"><b>You should never go to an ATM, open the app or access the <\/b><i><b>home banking<\/b><\/i><b>  when a call supposedly coming from the bank is received<\/b>.  The client must be the originator of the call.<\/li>\n<li class=\"list__item\"><b>Do not provide any personal data<\/b> (users, keys, passwords, pin, Social Security Key, Key Token, original ID or photocopy, photo, or any type of data), <b>by phone, email, social network, WhatsApp or text message<\/b>.<\/li>\n<li class=\"list__item\"><b>Do not enter personal data on sites using links that arrive by email<\/b>, they could be fraudulent.  Beware of suspicious links and <b>always make sure you are on the legitimate page<\/b> before entering login information. <b>Read every email received carefully<\/b>.<\/li>\n<li class=\"list__item\"><b>Use strong passwords<\/b> mixing uppercase, lowercase and numbers.  They have to be easy to remember but hard for other people to guess.  Do not use the same password for different applications, accounts, platforms or sites.<\/li>\n<li class=\"list__item\"><b>Do not use public or third-party equipment <\/b>to access applications, social networks or personal accounts.<\/li>\n<li class=\"list__item\"><b>Do not use public Wi-Fi networks <\/b>to access sites that require passwords.<\/li>\n<li class=\"list__item\">Keep the browser, the operating system of the equipment and the applications updated, in addition to eliminating those that are not used.<\/li>\n<li class=\"list__item\"><b>Learn to differentiate a true profile from a false one on social networks<\/b>.  Legitimate profiles have a blue authenticity check mark.  Fake profiles usually only have very recent posts and few followers.  If a false profile is detected, the account can be reported as spam.<\/li>\n<li class=\"list__item\"><b>You should always take a minute before acting<\/b>.  Those who carry out this type of scam appeal to emotions, carelessness and emergencies.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>While many hacks, phishing, or ransomware require high tech savvy, most modern digital scams are much simpler and closer to home. the classic “uncle stories”, but in a virtual version. The new method involves a supposed purchase, a large transfer with an error and finally tricking the victim into transferring money or providing access to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1145,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1142"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1142"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1142\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1145"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1142"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1142"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1142"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}