{"id":1146,"date":"2022-05-26T01:59:35","date_gmt":"2022-05-26T01:59:35","guid":{"rendered":"https:\/\/infobloom.site\/cybercrime-the-4-most-common-computer-crimes\/"},"modified":"2022-05-30T13:27:57","modified_gmt":"2022-05-30T13:27:57","slug":"cybercrime-the-4-most-common-computer-crimes","status":"publish","type":"post","link":"https:\/\/infobloom.site\/cybercrime-the-4-most-common-computer-crimes\/","title":{"rendered":"Cybercrime: The 4 most common computer crimes"},"content":{"rendered":"<p>In this post we will make a brief introduction to the concept of cybercrime by answering the questions: <strong>what is cybercrime? What are the most common computer crimes? What can we do to avoid them?<\/strong><br \/>\nAre you interested?<\/p>\n<p>There are many computer crimes that are implemented through new technologies and the Internet. Cybercriminals use methods such as phishing (capturing passwords or credit card numbers by imitating emails from official bodies or organizations), keyboard monitoring, cyberbullying (bullying) or grooming (cybersexual sexual harassment of minors) to obtain its objectives.<br \/>\nFirst of all, let&#8217;s get some background.<\/p>\n<h2>What is cybercrime?<\/h2>\n<p>It could be said that cybercrime is that activity that through the network (whether public or private) or through a computer system &#8220;has the objective of attacking the confidentiality, integrity and availability of computer systems, networks and data, as well as the fraudulent use of such systems, networks and data”.<\/p>\n<p>Within cybercrimes there are also computer crimes such as identity theft, harassment or fraud.<\/p>\n<p>For example, the paralysis of hundreds of companies due to the attack of a computer virus called WannaCry, which installed itself on the computers of workers from different companies and caused the encryption of the files stored on the computers connected to the same network. .<\/p>\n<p>Likewise, the curious method that a group of kids from an institute in A Estrada (Pontevedra City Council) had to ensure approval without having to sink their elbows was also talked about in the Galician media.<\/p>\n<p>The method consisted of installing software on the center&#8217;s computers that monitored each of the keystrokes, and thus allowed the passwords necessary to authenticate in different accounts to be deciphered. With this software, a group of students from the center were able to access various email accounts of their teachers and thus obtain the exams that they would later have to take.<\/p>\n<p>These are 2 examples of <strong>types of cybercrimes<\/strong> that we can meet<\/p>\n<p>_________________________________________________________________________________________________<\/p>\n<p><strong>You might also be interested in:<\/strong><\/p>\n<p class=\"entry_title\"><strong>E-commerce from the legal point of view.<\/strong><\/p>\n<p class=\"entry_title\"><strong>What legal implications does a ChatBot have?<\/strong><\/p>\n<p class=\"entry_title\"><strong>What is the digital will?<\/strong><\/p>\n<p class=\"entry_title\">_________________________________________________________________________________________________<\/p>\n<p>Next, we will tell you about the cybercrimes on which we have to take special care.<\/p>\n<h3>The 4 most common threats associated with cybercrime<\/h3>\n<p><strong>Type 1 cybercrime. Computer scams:<\/strong> whose conduct consists of carrying out a deceitful activity producing a patrimonial displacement to the detriment of the victim and thus obtaining a profit motive.<\/p>\n<p>Computer fraud differs from normal fraud in that the acts of deception are directed at computer systems that also produce the consequent deception in the victim.<\/p>\n<p>This computer crime could be considered as one of the most committed in Spain, and can be carried out by a multitude of behaviors, among the most common are the Nigerian scam, where its author sends the victim an email promising a large amount of money to exchange for an income of a certain amount in advance.<\/p>\n<p>Within this type of cybercrime are:<\/p>\n<p>&#8211; The <strong>phishing<\/strong>: which consists of fraudulently obtaining bank passwords in order to transfer money to another bank account. In these cases, the jurisprudence has admitted that the payment services provider (the bank) would be liable, unless there is fraud or gross negligence on the part of the victim.<\/p>\n<p>&#8211; The <strong>carding<\/strong>: which consists of a copy of the victim&#8217;s credit cards to subsequently purchase goods with them.<\/p>\n<p><strong>Type 2 cybercrime. Damage computer crimes:<\/strong> This is the case of common computer viruses and in particular the Wanna Cry would be part of this criminal type. They are computer crimes that consist of deleting, damaging, deteriorating, making inaccessible, altering or deleting computer data without authorization and with a burdensome result for the injured party. What is relevant in this crime is that a minimum amount is not required for it to be understood as committed and to be sentenced.<\/p>\n<p><strong>Type 3 cybercrime. Telecommunications fraud:<\/strong> We have all known someone who thought they were very clever when illegally taking advantage of the neighbor&#8217;s Wi-Fi without their consent. This type of crime requires economic damage to be caused to the victim, and will be punished with a fine of three to twelve months if the damage exceeds €400.<\/p>\n<p><strong>Type 4 cybercrime. Cybercrimes against privacy:<\/strong> There are also notorious cases in which a person installs software on a certain device, thus accessing personal information on it without the authorization of its owner. He could be accused in this case of a crime of discovery and disclosure of secrets with penalties that are not minor.<\/p>\n<p>Now that you know a little more about the world of cybercrime, here we leave you <strong>7 recommendations so you can prevent future hacker attacks<\/strong>. We hope they&#8217;re useful to you!<\/p>\n<p style=\"padding-left: 90px; text-align: justify;\"><\/p>\n<h2>Conclusions<\/h2>\n<p>In this article we have seen what a cybercrime is, types that exist and how to know how to prevent any of them.<\/p>\n<p>We hope that with this article it has become a little clearer to you what we mean by &#8220;cybercrime&#8221; and that we have helped you to be alert about this type of criminal behavior that you can find on the Internet and with the use of new technologies.<\/p>\n<h3>Do you think it is important to apply prevention measures when you browse the Internet?<\/h3>\n<h3>Have you ever encountered any computer crime or cybercrime of this type?<\/h3>\n<p>If you liked the post, you can share it with a friend. And remember, if you have any questions or concerns about this topic, you can always contact us by doing <strong>click here<\/strong>.<br \/>\n<strong>Other articles that may interest you:<\/strong><\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<p>In this post we will make a brief introduction to the concept of cybercrime by answering the questions: what is cybercrime? What are the most common computer crimes? What can we do to avoid them? Are you interested? There are many computer crimes that are implemented through new technologies and the Internet. Cybercriminals use methods [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1148,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1146"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1146"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1146\/revisions"}],"predecessor-version":[{"id":1598,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1146\/revisions\/1598"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1148"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1146"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1146"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1146"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}