{"id":1149,"date":"2022-05-26T02:32:02","date_gmt":"2022-05-26T02:32:02","guid":{"rendered":"https:\/\/infobloom.site\/all-the-phrases-about-cheating\/"},"modified":"2022-05-26T02:32:02","modified_gmt":"2022-05-26T02:32:02","slug":"all-the-phrases-about-cheating","status":"publish","type":"post","link":"https:\/\/infobloom.site\/all-the-phrases-about-cheating\/","title":{"rendered":"All the phrases about cheating"},"content":{"rendered":"<p><strong>Collection of phrases about deception<\/strong> (lie, appearance, infidelity, falsehood, deceive, trick, fraud, artifice, ruse, swindle, betrayal)<\/p>\n<p>  Selection of phrases about the lack of truth in what is said, done, believed, thought or reasoned: the facts are not related, it seems like a hoax.<\/p>\n<p>  Giving the lie the appearance of truth or inducing another to believe and take for granted what is not.<\/p>\n<h2>cheating phrases<\/h2>\n<p class=\"frase\">01. Simple lies are the most difficult, curiously.<\/p>\n<p>Quotes of &#8220;<strong>The widow<\/strong>(2016) &#8211; Fiona Barton<\/p>\n<p class=\"frase\">02.I found myself after having incinerated the suits of deception.<\/p>\n<p>Quotes of &#8220;<strong>thresholds<\/strong>(2009) &#8211; Alejandro Lanus<\/p>\n<p class=\"frase\">03.The deception is sometimes successful, but always ends up committing suicide.<\/p>\n<p>Quotes of &#8220;<strong>sand and foam<\/strong>(1926) &#8211; Gibran Khalil Gibran<\/p>\n<p class=\"frase\">04.Sometimes people need to lie to themselves more than anything else.<\/p>\n<p>Quotes of &#8220;<strong>a monster comes to see me<\/strong>(2011) &#8211; Patrick Ness<\/p>\n<p class=\"frase\">05.How many times results from a deception, against the deceiver the greatest damage!<\/p>\n<p>Quotes of &#8220;<strong>moral fables<\/strong>&#8221; (1781) &#8211; Felix Maria Samaniego<\/p>\n<p class=\"frase\">06. I will deceive her but isn&#8217;t a pleasant deception worth more than an afflictive truth?<\/p>\n<p>Quotes of &#8220;<strong>Miss de Maupin<\/strong>&#8221; (1836) &#8211; Théophile Gautier<\/p>\n<p class=\"frase\">07.Perhaps, when men know that deception is useless, the human condition will improve.<\/p>\n<p>Quotes of &#8220;<strong>field of almond trees<\/strong>&#8220;(1968) &#8211; Max Aub<\/p>\n<p class=\"frase\">08. She became so sincere in the deception that she ended up consoling herself with her own lies.<\/p>\n<p>Quotes of &#8220;<strong>One hundred years of solitude<\/strong>&#8221; (1967) &#8211; Gabriel Garcia Marquez<\/p>\n<p class=\"frase\">09.Looks like lies are easy for your kind&#8230;It&#8217;s hard to know what to believe in this place.<\/p>\n<p>Quotes of &#8220;<strong>just the steel<\/strong>(2008) &#8211; Richard Morgan<\/p>\n<p class=\"frase\">10.Everyone pretends, everyone pretends to be something they are not.  The whole world is built on lies and deceit.<\/p>\n<p>Quotes of &#8220;<strong>the couple next door<\/strong>(2016) &#8211; Shari Lapena<\/p>\n<p class=\"frase\">11. I understand that lying is deception and the truth is not.  But both of them have fooled me.<\/p>\n<p>Quotes of &#8220;<strong>Voices<\/strong>&#8221; (1943) &#8211; Antonio Porchia<\/p>\n<p class=\"frase\">12.-Because you have deceived me -I replied looking into dad&#8217;s eyes-.  This is not the best place in the world.<\/p>\n<p>Quotes of &#8220;<strong>The glow of fireflies<\/strong>(2013) &#8211; Paul Pen<\/p>\n<p class=\"frase\">13.My care was always to persuade the woman that I was not cheating on her.  I will never be able to persuade this one that I don&#8217;t love her.<\/p>\n<p>Quotes of &#8220;<strong>Love&#8217;s stories<\/strong>(1972) &#8211; Adolfo Bioy Casares<\/p>\n<p class=\"frase\">14.Maybe the girl doesn&#8217;t remember me, although I know I&#8217;m wrong: you don&#8217;t forget the face of the person who was your last hope.<\/p>\n<p>Quotes of &#8220;<strong>The Hunger Games<\/strong>&#8220;(2008) &#8211; Suzanne Collins<\/p>\n<p class=\"frase\">15. The worst thing is not the deception or the excuse.  The worst is how I feel now and all the time I&#8217;ve wasted falling in love with you.<\/p>\n<p>Quotes of &#8220;<strong>Something as simple as tweeting I love you<\/strong>(2015) &#8211; Blue Jeans<\/p>\n<p class=\"frase\">16.Evil is the son of lies, which, once out of one, develops autonomously until it has a life of its own and becomes an autonomous being.<\/p>\n<p>Quotes of &#8220;<strong>The gold and the ash<\/strong>&#8221; (1997) &#8211; Éliette Abécassis<\/p>\n<p class=\"frase\">17.What I see in these cases is people taking advantage of everything, not heaven or saints or angels.  I see them taking advantage of any decent impulse and any human tragedy.<\/p>\n<p>Quotes of &#8220;<strong>Trap 22<\/strong>(1961) &#8211; Joseph Heller<\/p>\n<p class=\"frase\">18.The passions are lived one by one, if not, it is not true love, it is a deception and betrayal that ends in lamentation and crying, if not in stabs and shots.<\/p>\n<p>Quotes of &#8220;<strong>big tocaia<\/strong>&#8220;(1984) &#8211; Jorge Amado<\/p>\n<p class=\"frase\">19.(&#8230;) It reminded him of a pocket robbery, a cunning sleight of hand.  That was how it worked.  A good deception required two hands, one you pay attention to, the other you fail to notice.<\/p>\n<p>Quotes of &#8220;<strong>a darker magic<\/strong>(2015) &#8211; Victoria Schwab<\/p>\n<p class=\"frase\">20.The most difficult lies are those related to emotions that are experienced at that moment;  lying will be all the more difficult the more intense these emotions are and the greater the number of different emotions that must be hidden.<\/p>\n<p>Quotes of &#8220;<strong>How to detect lies<\/strong>(1985) &#8211; Paul Ekman<\/p>\n<p class=\"frase\">21.The intellectuals: superstructure officials who participate in the construction of hegemony.  Therefore, once again, Gramsci: all men are intellectuals, true, but not all men occupy the function of intellectuals in society, which consists of working for the spontaneous approval of the masses.<\/p>\n<p>Quotes of &#8220;<strong>The seventh function of language<\/strong>(2015) &#8211; Laurent Binet<\/p>\n<p class=\"frase\">22.The mind is a fertile field for concepts, ideas and opinions.  If someone tells us a lie and we believe it, that lie takes root in our mind and grows big and strong, like a tree.  A little lie can be very contagious, spreading its seeds from one person to another when we share it with them.<\/p>\n<p>Quotes of &#8220;<strong>the voice of knowledge<\/strong>(2004) &#8211; Miguel Ruiz<\/p>\n<p class=\"frase\">23.When a woman gives in to more important deceptions, with the intention of protecting her most precious conjugal interests, the evil is seen to increase proportionally.  Deception, which is the natural defensive weapon used by the weak against the strong, is then no longer confined within the limits assigned to it by self-respect and the restrictions of education.  In such a situation, a woman will lower herself, blinded, to petty acts that would disgust her if they were committed by someone else.<\/p>\n<p>Quotes of &#8220;<strong>the black robe<\/strong>(1881) &#8211; William Wilkie Collins<\/p>\n<p class=\"frase\">24. You have not learned anything, only that solitude does not teach anything, that indifference does not teach anything: it was a deception, a fascinating and treacherous illusion.  You were alone and that&#8217;s all, and you wanted to protect yourself;  that between the world and you the bridges were broken forever.  But you are very little and the world is a very high-sounding word: you have never done more than wander in a big city, more than walk a few kilometers of facades, shop windows, parks and docks.<\/p>\n<p>Quotes of &#8220;<strong>a sleeping man<\/strong>&#8221; (1967) &#8211; Georges Perec<\/p>\n<p class=\"frase\">25.A liar can decide that he is not going to lie.  Confusing the victim is a deliberate act;  the liar is meant to have her misinformed.  The lie may or may not be justified in the opinion of the person telling it or of the community to which it belongs.  The liar can be a good or a bad person, he can count on everyone&#8217;s sympathy or be unfriendly and unpleasant to everyone.  But the important thing is that the person who lies is in a position to choose between lying and telling the truth, and knows the difference.<\/p>\n<p>Quotes of &#8220;<strong>How to detect lies<\/strong>(1985) &#8211; Paul Ekman<\/p>\n<p class=\"frase\">26.As is known, deception works for two things.  First, the deceiver is very subtle and convincing in his plans, that is, he looks\/feels\/acts as if he were the real deal.  Second, and equally important, the deceived subject must be predisposed to believe that the deceiver is indeed authentic.  These two criteria work inversely with each other: a sufficiently deceitful guy can convince a skeptical victim, while a victim who desperately wants to believe will be able to overlook serious flaws in the person he trusts.<\/p>\n<p>Quotes of &#8220;<strong>android dream<\/strong>(2006) &#8211; John Scalzi<\/p>\n<p class=\"frase\">27. Nothing was true anymore.  At the end of this afternoon, at the end of this year, there was nothing left, Fintan had kept nothing.  It was all deceitful, like those stories that children are told to make their eyes shine.<\/p>\n<p>Jean-Marie Gustave Le Clezio<\/p>\n<p class=\"frase\">28.(&#8230;) One-armed and sick lies, violent and wicked, lies with legs and wheels, lies with a jacket and lies with a mustache.  Some lies that he invented instantly, without thinking that one day he would have to meet them again.<\/p>\n<p>Etgar Keret<\/p>\n<p class=\"frase\">29. As far as women are concerned, it is about reciprocal deceptions that do not enter into the account, because when love gets in the way, it is common for one to deceive the other.<\/p>\n<p>Giacomo Casanova<\/p>\n<p class=\"frase\">30.When witnesses make up lies, they tend to forget the most obvious issues.  And the same goes for their lawyers.  They become so obsessed with deception that some detail is always overlooked.<\/p>\n<p>John Grisham<\/p>\n<p class=\"frase\">31. The simple suggestion of fame and fortune fills everything with glamour.  It is quite alarming how quickly people turn someone&#8217;s deception into fact in order to fuel their own deceptions.<\/p>\n<p>Libba Bray<\/p>\n<p class=\"frase\">32.Something more, something less, my dear boy, the voices of men are all a delusion;  we are only honest when we are children, and then in the grave.<\/p>\n<p>Hermann Hesse<\/p>\n<p class=\"frase\">33. I knew that continuing to cheat on her wasn&#8217;t a solution either, but there was nothing else I could do: one day was a day, even if it was cheating.<\/p>\n<p>yu hua<\/p>\n<p class=\"frase\">34.His happiness laughed in his soul.  But it was all a hoax.  That laugh didn&#8217;t last long.<\/p>\n<p>Henri Michael<\/p>\n<p class=\"frase\">35. Although the analogy is often misleading, it is the least misleading thing we have.<\/p>\n<p>Samuel Butler<\/p>\n<p class=\"frase\">36.In times of universal deception, telling the truth becomes a revolutionary act.<\/p>\n<p>George Orwell<\/p>\n<p class=\"frase\">37. There are things that even if they are said, they are not meant to be understood.<\/p>\n<p>Pedro Calderon De La Barca<\/p>\n<p class=\"frase\">38. The one who can best cover them can better use their appetites.<\/p>\n<p>Seneca<\/p>\n<p class=\"frase\">39. Art is the most beautiful of all deceptions.<\/p>\n<p>Claude Debussy<\/p>\n<p class=\"frase\">40. There is deception when what is first denied is granted.<\/p>\n<p>Seneca<\/p>\n<p class=\"frase\">41. He who receives what he cannot pay, cheats.<\/p>\n<p>Seneca<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Collection of phrases about deception (lie, appearance, infidelity, falsehood, deceive, trick, fraud, artifice, ruse, swindle, betrayal) Selection of phrases about the lack of truth in what is said, done, believed, thought or reasoned: the facts are not related, it seems like a hoax. Giving the lie the appearance of truth or inducing another to believe [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1150,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1149"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1149"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1149\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1150"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1149"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1149"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1149"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}