{"id":1176,"date":"2022-05-26T07:54:03","date_gmt":"2022-05-26T07:54:03","guid":{"rendered":"https:\/\/infobloom.site\/what-are-the-most-common-frauds-suffered-by-companies\/"},"modified":"2022-05-30T13:28:50","modified_gmt":"2022-05-30T13:28:50","slug":"what-are-the-most-common-frauds-suffered-by-companies","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-the-most-common-frauds-suffered-by-companies\/","title":{"rendered":"What are the most common frauds suffered by companies"},"content":{"rendered":"<p>Regardless of the size of the companies, fraud is considered to represent losses between 5% and 10%. There are several cases that have been considered the most common: the excessive use of corporate cards to make purchases; travel and entertainment expenses appearing at those conferences to which you represented; supplier payment and purchasing processes can become a critical element if not reviewed in detail; the size of your company must correspond to the real needs, neither more nor less; the danger of the returns What happens with the bonds?; and the evasion of controls by administrative figures.<\/p>\n<p><strong>INCP writing based on the article by John Verver published in Auditool<\/strong><\/p>\n<p>For more information, you can review the article titled “What are the most common cases of employee fraud?” from the Auditool source.<\/p>\n<p><strong>What are the most common cases of employee fraud?<\/strong><\/p>\n<p><strong>How can companies reduce the risk to which they are exposed?<\/strong><\/p>\n<p>You&#8217;ve heard the statistic: In just companies of any size, fraud accounts for 5-10% of annual revenue. Some fraudulent activity comes from outside sources (such as theft or cyber breaches), but much of the fraud comes from insiders. ACL (Software Company) is taking a close look at how employees frequently take advantage of internal systems for personal gain and what organizations can do to reduce their exposure to these fraud risks.<\/p>\n<p>Many managers may not think about the likelihood of their team members committing fraud. They spend most of their time thinking about how to achieve their goals and get their work done. Even the most demanding bosses tend to believe in the integrity of the people they work with. These are likely to be some of the reasons employee fraud occurs and often goes undiscovered.<\/p>\n<p>So what are the most common cases of employee fraud that managers and executives should be aware of? And how can they find out if fraudulent activities have occurred?<\/p>\n<p><strong>Corporate purchase cards (P-cards)<\/strong><\/p>\n<p>The use of credit cards or corporate purchases can achieve good business performance. These radically reduce the costs of the purchase orders and payment cycle, by reducing expenses and purchase items. However, these are particularly prone to abuse by employees. Perhaps that recent purchase of the high-end corporate card and a big-screen computer monitor was completely justified and helped improve employee productivity, but what if the monitor ended up with the employee&#8217;s kid who loves video games? computer games? what about the $5,000 spent at Home Depot for office improvements by the branch supervisor? Maybe the supervisor now has a much better rec room. What about duplicate purchases? Was one valid and one for personal use?<\/p>\n<p>Of course, all purchases and expenses made through the purchase card (P-card) must be approved by the authorized administrator. But this is where the lack of control appears. If a manager has to approve card use for 50 or more employees on a monthly basis, is he really going to spend time to make sure each purchase was justified?<\/p>\n<p>There is a relatively simple answer to this problem. Credit card companies provide detailed information for each transaction. The data can be analyzed to identify many indicators of fraud. Merchant category codes can be reviewed and anything that looks suspicious can be selected for review. There have been cases where one employee used his corporate card to spend a lot of money on psychic readings, while another bought a cow at auction for his ranch.<\/p>\n<p><strong>Travel and entertainment (E&amp;E) expenses<\/strong><\/p>\n<p>Fraud risks in purchase card systems (P-card) can also be applied to travel and entertainment expenses. Fraud opportunities are very similar in terms of out-of-pocket costs to the business. Also, duplicate charges can be a sign of fraud; for example, multiple employees are charging for the same lavish entertainment for an important client. Was the expense of the trip to Florida to &#8220;meet a client&#8221; really justified, when it was during spring break and coincided with vacation days?<\/p>\n<p>Again, it&#8217;s a relatively simple process to analyze the data and find the red flags of duplicate billing claims and expenses, which don&#8217;t seem right.<\/p>\n<p><strong>Suppliers and the purchasing and payment process<\/strong><\/p>\n<p>Vendor systems and the purchasing and payment process also pose fraud risks. Employees may create “ghost vendors” in order to process fraudulent invoices for nonexistent products and services and then make payments to bank accounts controlled by the employee. Also, employees can collude with suppliers and approve the purchase of goods and services at extremely high prices. Suppliers can express their appreciation by shipping products directly to the employee&#8217;s home.<\/p>\n<p>There are many ways to review these activities. For example, supplier addresses can be analyzed to identify fictitious addresses or to see if they match an employee&#8217;s address. The prices of the supplier&#8217;s products and services can be analyzed in detail to find cases where prices are far from statistical norms.<\/p>\n<p><strong>Payroll<\/strong><\/p>\n<p>The risks of payroll fraud tend to increase according to the size of the company. It should be a simple job to keep an eye on a department of only 100 employees at a branch. But what happens when there are hundreds or thousands of employees spread across different branches? How do you know that each person on the payroll actually goes to work and does their job?<\/p>\n<p>It is normally placed quite a bit of trust in the departmental and regional administrations to ensure that the activities in the payroll are valid, contributing to the employees. Some supervisors may be tempted to include friends or family members as employees and share the payroll monies. Even if employees do show up for work, what if the supervisor generously approves big bonuses and overtime pay?<\/p>\n<p>One way to keep an eye on things is to analyze records of employee activities, such as electronic login and security logs. How often was the employee registered in the company&#8217;s system? How often was the magnetic stripe card used to enter the company premises?<\/p>\n<p><strong>Sales<\/strong><\/p>\n<p>When thinking about anti-fraud measures, people tend to focus on the expense side. But there are also plenty of opportunities for employee fraud on the revenue side. Let&#8217;s say a sales executive made a big sale at the end of the period and received a nice commission and bonus. After a month, the sale was reversed and a credit note was issued. What about commission and bonuses? Who makes sure these are reversed as well?<\/p>\n<p>Opportunities to collude with customers tend to mirror those with suppliers. A seller can give discounts at extremely generous prices in exchange for a bribe or tip, and somehow half of the products shipped to the customer seem to make their way to the seller&#8217;s house.<\/p>\n<p>The analysis of discounts, prices, sales reversals and credit notes, and terms, can allow the identification of fraud indicators. These are the same analytics that can match shipping addresses and employee addresses.<\/p>\n<p><strong>Evasion of controls established by administrators<\/strong><\/p>\n<p>One of the key anti-fraud controls in almost any business process is management approval. Admins are trusted to review and approve purchases and expenses in their areas, but only to a certain point. There are approval limits according to the level of responsibility of the administrator and the budget. The risk of a large fraudulent spend approved by an administrator is presumably limited if, for example, you are only authorized to approve purchases up to $50,000. Still, if the manager approves 5 purchases of $49,000 each, he could actually be approving a fraudulent purchase of $245,000.<\/p>\n<p>Scrutinizing data, for this approved form of separate purchases, is a simple and effective task.<\/p>\n<p>Coincidentally, one of my favorite and innovative ways to check if management approvals are being appropriate is to analyze the stamp data of when the manager approves the charge of an employee monthly corporate card. In one case, analysis showed that an administrator had approved a large number of charges in about 80 seconds (not exactly reassuring that due diligence took place).<\/p>\n<p>Whether it is data analysis or forensic accounting, all businesses, large and small, are encouraged to use any and all available resources to eradicate fraud, reduce waste, and optimize performance.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Regardless of the size of the companies, fraud is considered to represent losses between 5% and 10%. There are several cases that have been considered the most common: the excessive use of corporate cards to make purchases; travel and entertainment expenses appearing at those conferences to which you represented; supplier payment and purchasing processes can [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1178,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1176"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1176"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1176\/revisions"}],"predecessor-version":[{"id":1606,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1176\/revisions\/1606"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1178"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1176"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1176"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1176"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}