{"id":118,"date":"2022-05-03T12:27:58","date_gmt":"2022-05-03T12:27:58","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-and-how-do-they-work\/"},"modified":"2022-05-03T12:27:58","modified_gmt":"2022-05-03T12:27:58","slug":"what-are-nfts-and-how-do-they-work","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-and-how-do-they-work\/","title":{"rendered":"What are NFTs and how do they work?"},"content":{"rendered":"<p>we will explain <strong>what are NFTs and how do they work<\/strong>, so that you can understand what is behind news like the one about that person who paid 260,000 euros for a rock drawing.  In Xataka you already have an article explaining it in a more technical and complete way, but in Xataka Basics we are going to try that anyone can understand the concept of how it works.<\/p>\n<p>Therefore, we are going to try to move away from technicalities to <strong>make the explanation as simple as possible<\/strong>.  We will first tell you what non-expendable property is, as it is a vital concept in understanding NFTs.  Then, we will go on to tell you what NFTs are and we will also briefly go into how they work.<\/p>\n<h2>First, what are non-expendable property<\/h2>\n<p>To understand the concept of NFTs, we first have to know and understand that in our legal system, there are <strong>expendable and non-expendable property<\/strong>.  Fungible goods are those that can be exchanged, having a value based on their number, size or weight.  And non-expendable goods are those that are not substitutable.<\/p>\n<p><strong>An example of fungible goods is money.<\/strong>.  If you have a 20 euro bill, this is a consumable good, since you can easily exchange it for another 20 euro bill, it does not lose value and it is exactly the same.  Also, this ticket is consumed when you use it.<\/p>\n<p>And on the other hand, <strong>an example of a non-expendable item would be a work of art<\/strong>.  If you have a tile at home, it is not consumed when used and cannot be replaced by another tile. <strong>One work of art is not equivalent to another<\/strong>and therefore cannot be simply exchanged like a 20 euro note.<\/p>\n<h2>What are NFTs<\/h2>\n<p>NFT stands for Non-Fungible Token, a non-fungible token.  Tokens are units of value that are assigned to a business model, such as cryptocurrencies.  And it is that NFTs have a close relationship with cryptocurrencies, at least technologically, although they are opposites, since a Bitcoin is a fungible good, and an NFT is a non-fungible good, but in essence, they are like the two sides of a technological currency.<\/p>\n<p>For your understanding, we can think of cryptocurrencies as a store of value, <strong>something like gold<\/strong>.  You can buy and sell gold, and when the number of buyers increases the price goes up, to go down when this number of buyers decreases.  It is a behavior equal to that of cryptocurrencies.<\/p>\n<p>But gold is gold in the end, and you can trade one nugget for another with no problem.  However, there are other goods made of gold that also have a value, but they are unique, and that fact makes the difference and gives them another type of value.  Just like that value made with gold or a work of art, <strong>NFTs are unique assets that cannot be changed or exchanged for another of the same value<\/strong>since no two NFTs are equivalent just as no two frames are.<\/p>\n<p>    <\/p>\n<p>Therefore, you can think of an NFT as a great work of art, like Da Vinci&#8217;s Mona Lisa.  There is only one and it is in a specific art gallery.  If you want it, you can only buy the original if it was for sale.  You could also get a copy, but it would have another value, since it would not be the original.  Well, that is exactly what the NFT does, but digitally.<\/p>\n<p>To understand it better, an NFT would be like a unique work of art, for example, Michelangelo&#8217;s David, there is only one and it is in the Accademia Gallery in Florence;  if someone wanted to have that particular David, they should buy it (if it were for sale) or get a copy, in which case, we would no longer be talking about the original, which is what gives value to the sculpture.<\/p>\n<p>For this reason, NFTs are usually attached to some digital works or illustrations.  Its price is really what people want to give it, and now that they are at a peak of popularity, we can find that there are people who pay 260,000 euros for the drawing of a rock attached to an NFT. <\/p>\n<h2>How NFTs work<\/h2>\n<p>NFTs work <strong>through blockchain technology<\/strong> or blockchain.  It is the same technology as cryptocurrencies, which work through a decentralized computer network, with blocks or nodes linked and secured using cryptography.  Each block links to a previous block, as well as date and transaction data, and is by design resistant to data modification.<\/p>\n<p>NFTs are assigned a kind of digital certificate of authenticity, a series of metadata that cannot be modified.  In these metadata its authenticity is guaranteed, the starting value and all the acquisitions or transactions that have been made are recorded, as well as its author. <\/p>\n<p>This means that if you buy a digital content tokenized with NFT, at all times there will always be proof of the first value it had, and how much you bought it for.  It&#8217;s like when you buy a painting and keep track of where it moves.<\/p>\n<p>In general, most &#8220;tokens&#8221; or NFTs are usually based on the standards of the Ethereum network and its blockchain.  Thanks to using a well-known and popular technology, <strong>it is easy to operate with them to buy and sell them<\/strong> using certain wallets that also work with Ethereum.  However, we are talking about unique works, so there is no active trading as in digital currencies.<\/p>\n<p>    <img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/What-are-NFTs-and-how-do-they-work.jpg\" alt=\"'Axie Infinity' is one of the games with the highest revenue growth in history: the &quot;Pokemon of the NFTs&quot; who sells that we can earn money playing\"\/><\/p>\n<h2>Why do people buy NFTs?<\/h2>\n<p>If NFTs can&#8217;t be bought and sold as easily as Bitcoin, then why do people buy and spend so much money on them?  Well, it&#8217;s simple, because they believe that its value will increase over time, and then they can sell it for more money.  Nobody spends 260,000 euros for a rock drawing because they like rock drawings, since they can have them for free, but because of the value of this particular drawing as it is an NFT.<\/p>\n<p>The idea, therefore, is that if I buy an NFT for 100,000 euros, <strong>in the future I can resell it for more money<\/strong>.  It is a unique asset, which in theory should give it a higher value as there is no other like it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>we will explain what are NFTs and how do they work, so that you can understand what is behind news like the one about that person who paid 260,000 euros for a rock drawing. In Xataka you already have an article explaining it in a more technical and complete way, but in Xataka Basics we [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":121,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/118"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=118"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/118\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/121"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=118"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=118"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=118"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}