{"id":1181,"date":"2022-05-26T09:04:18","date_gmt":"2022-05-26T09:04:18","guid":{"rendered":"https:\/\/infobloom.site\/online-fraud-the-5-most-common-methods-of-scammers\/"},"modified":"2022-05-26T09:04:18","modified_gmt":"2022-05-26T09:04:18","slug":"online-fraud-the-5-most-common-methods-of-scammers","status":"publish","type":"post","link":"https:\/\/infobloom.site\/online-fraud-the-5-most-common-methods-of-scammers\/","title":{"rendered":"Online fraud: the 5 most common methods of scammers"},"content":{"rendered":"<p>Spam and phishing are often closely related, as scammers send mass emails with the intention of collecting information from recipients.  For them, the <strong>personal data of users<\/strong> they are a prize and a desired value, as evidenced by media publications and our own spam flow analysis.  One of the most common objectives is to gain access to your accounts or bank card numbers through the <strong>email phishing<\/strong> and the <strong>social engineering techniques<\/strong>.<\/p>\n<p>In this article, we are going to collect the 5 most common tricks used by <strong>cyber criminals<\/strong>.<\/p>\n<h2>1. Fake social media notifications<\/h2>\n<p>Scammers often send fake notifications that appear to come from social media about new friends, their activity, comments, likes, and more.  These types of messages are identical to the real ones, the only difference is that they have a <strong>phishing link<\/strong>, which is not always easy to detect.  In that link, users are encouraged to enter their username and password on a fake login page.<\/p>\n<p>These messages are also used as fake threat alerts, to announce that suspicious activity has been detected in your account or that a new feature has been introduced and users who do not consent will be blocked.  Either way, the message will contain a button with a link to a phishing login page.<\/p>\n<p><\/p>\n<p id=\"caption-attachment-17523\" class=\"wp-caption-text\">The most popular tricks of scammers: Fake notifications from social networks<\/p>\n<h2>2. Phishing in banks<\/h2>\n<p>Phishing that seeks users&#8217; bank card information remains the type of <strong>online fraud<\/strong> more popular.  These fake messages can be sent on behalf of banks or payment systems reporting a possible account lockout or “suspicious activity” in the customer&#8217;s personal account.<\/p>\n<p>Under the guise of restoring access, confirming identity or canceling a transaction, the user is asked to enter their banking information (often with the CVV\/CVC code) on a fake banking website.  After receiving the data, the criminals immediately withdraw the money from the victim&#8217;s account.  The same happens with payment systems, but in these cases, users are only required to log in to their accounts.<\/p>\n<p><img aria-describedby=\"caption-attachment-17524\" loading=\"lazy\" class=\"wp-image-17524 size-full\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653555856_144_Online-fraud-the-5-most-common-methods-of-scammers.png\" alt=\"\" width=\"1002\" height=\"904\"\/><\/p>\n<p id=\"caption-attachment-17524\" class=\"wp-caption-text\">The most popular tricks of scammers: fake notifications from banks and payment systems<\/p>\n<h2>3. Fake notifications from service and sales sites<\/h2>\n<p>These are also created <strong>fake notifications<\/strong> on behalf of online brands, delivery services, booking sites, multimedia platforms, job boards and other popular online services.  Cybercriminals rely on the odds that their <strong>spam messages<\/strong> reach a user of these services, they will surely panic and click on the link.<\/p>\n<p><img aria-describedby=\"caption-attachment-17525\" loading=\"lazy\" class=\"wp-image-17525 size-full\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653555857_675_Online-fraud-the-5-most-common-methods-of-scammers.png\" alt=\"\" width=\"1002\" height=\"793\"\/><\/p>\n<p id=\"caption-attachment-17525\" class=\"wp-caption-text\">The most popular tricks of scammers: Fake notifications from service and sales sites<\/p>\n<h2>4. Fake notifications from email services<\/h2>\n<p>Fraudsters use this type of <strong>online scam<\/strong> to collect usernames and passwords for email services.  One of the two most common pretexts is for users to reset their password or to increase the available space in the supposedly full inbox.  In the latter case, the phishing link promises more storage capacity, which is hardly suspicious in the age of cloud computing and the increasing need to store large amounts of data.<\/p>\n<p><img aria-describedby=\"caption-attachment-17526\" loading=\"lazy\" class=\"wp-image-17526 size-full\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653555857_119_Online-fraud-the-5-most-common-methods-of-scammers.png\" alt=\"\" width=\"1002\" height=\"539\"\/><\/p>\n<p id=\"caption-attachment-17526\" class=\"wp-caption-text\">The most popular tricks of scammers: Fake notifications from email services<\/p>\n<h2>5. The “Nigerian Prince” fraud<\/h2>\n<p>Finally, one of the oldest types of spam, the promise of a fortune from a relative or lawyer of a dead millionaire in exchange for an advance payment, continues to do its tricks.  Sometimes he <strong>cyber criminal <\/strong>poses as a celebrity in a sticky situation.  The victim will supposedly receive a good reward if he helps the millionaire to withdraw paralyzed funds in banks.  To do this, they must first send detailed information about themselves (passport, account details, etc.) and a small amount of money for paperwork.<\/p>\n<p><img aria-describedby=\"caption-attachment-17527\" loading=\"lazy\" class=\"wp-image-17527 size-full\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653555857_244_Online-fraud-the-5-most-common-methods-of-scammers.png\" alt=\"\" width=\"1002\" height=\"756\"\/><\/p>\n<p id=\"caption-attachment-17527\" class=\"wp-caption-text\">The most popular tricks of scammers: The Nigerian prince fraud<\/p>\n<p>The list of topics and techniques preferred by scammers does not end here, but these five that we have just described are the most effective and, therefore, the <strong>most common internet scams<\/strong>.<\/p>\n<h2>Do not fall in the trap<\/h2>\n<p>The best <strong>advice to avoid online fraud<\/strong> What we can give you is that you be cautious and, as this is a bit vague, we recommend that you follow this series of steps:<\/p>\n<ul>\n<li>When you receive a message with a notification from a company or service, check that it comes from an authentic address.  For example, a message from Google should be no-reply@accounts.<strong>Google com<\/strong> and not no-reply@accounts.<strong>google.scroogle.com<\/strong>or something like that.<\/li>\n<li>If you click on a link in one of these messages, make sure it is not a <strong>fake website<\/strong>.<\/li>\n<li>Use a trusted security solution with <strong>spam and phishing protection<\/strong>it will detect fraudulent emails and notify you immediately.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Spam and phishing are often closely related, as scammers send mass emails with the intention of collecting information from recipients. For them, the personal data of users they are a prize and a desired value, as evidenced by media publications and our own spam flow analysis. One of the most common objectives is to gain [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1187,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1181"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1181"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1181\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1187"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1181"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1181"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1181"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}