{"id":1188,"date":"2022-05-26T09:36:38","date_gmt":"2022-05-26T09:36:38","guid":{"rendered":"https:\/\/infobloom.site\/how-to-recognize-fake-dollars-avoid-scams-with-counterfeit-bills-and-coins-on-christmas-purchases\/"},"modified":"2022-05-30T13:29:18","modified_gmt":"2022-05-30T13:29:18","slug":"how-to-recognize-fake-dollars-avoid-scams-with-counterfeit-bills-and-coins-on-christmas-purchases","status":"publish","type":"post","link":"https:\/\/infobloom.site\/how-to-recognize-fake-dollars-avoid-scams-with-counterfeit-bills-and-coins-on-christmas-purchases\/","title":{"rendered":"How to recognize fake dollars?  Avoid scams with counterfeit bills and coins on Christmas purchases"},"content":{"rendered":"<p>Have you ever been cheated with a counterfeit bill? Tens or thousands of these species <b>circulate <\/b>in it <b>Ecuador <\/b>without the authorities being able to calculate its exact amount. The <b>detected <\/b>They are only those who reach the <b>Finance system<\/b> national.<\/p>\n<p>When the <b>coins <\/b>or the <b>fake currency<\/b> are taken to <b>financial entities<\/b>these are retained and sent as &#8220;presumably false species&#8221; to the Central Bank of Ecuador (BCE) for verification.<\/p>\n<p>Once <b>verified<\/b>go to your <b>final status<\/b>which can be a <b>currency <\/b>either <b>counterfeit bill<\/b>depending on the case.<\/p>\n<p>“The Central Bank carries out a technical review of the species retained by banks and cooperatives. Once analyzed, they respond to the institutions at the national level and indicate the definitive status of the monetary species. If any is false, it is handed over to the Judicial Police to carry out the respective investigations. The ECB does not keep any counterfeit notes, it is only a temporary custodian,&#8221; he said. <b>Charles Grandson<\/b>technician responsible for<b> False Species System<\/b> Of the entity.<\/p>\n<p>the time of elder <b>circulation <\/b>of coins <b>false <\/b>in Ecuador is that of <b>increased circulation<\/b> from <b>cash<\/b>like the Christmas season. In this period, the <b>public workers<\/b>, <b>private<\/b>, <b>retirees <\/b>Y <b>food pensioners <\/b>receive payment from <b>thirteenth <\/b>loose or Christmas bonus.<\/p>\n<p>From the weekend of Saturday the 14th and Sunday the 15th of December, thousands of people attended the <b>malls<\/b>, <b>christmas markets<\/b> Y <b>fairs<\/b> where they are offered <b>discounts <\/b>Y <b>offers <\/b>to make the purchases of this time.<\/p>\n<p>The authorities ask the <b>citizenship <\/b>check the characteristics of <b>security <\/b>from <b>coins <\/b>Y <b>banknotes <\/b>to avoid being <b>victims <\/b>of a scam with <b>counterfeit money<\/b>.<\/p>\n<p>The <b>fake currency<\/b> that circulate the most in the <b>Ecuador <\/b>they are the low denomination ones, USD 20, USD 10 and USD 5, since the species of USD 100 or USD 50 are not common in the stores of the country. However, the Central Bank has detected an increase in <b>false species<\/b> in <b>banknotes <\/b>of USD 50, which are concentrated in cities <b>border<\/b>Nieto added.<\/p>\n<p>To more than <b>fake currency<\/b>there&#8217;s also <b>metallic coins<\/b> <b>counterfeit <\/b>that circulate in the <b>Ecuador<\/b>. The USD 1 (one dollar) and 50 national cents are the most common.<\/p>\n<p>&#8220;According to our data, the largest number of counterfeit coins in circulation are one dollar, in gold presentation,&#8221; Nieto said. These can be the ones with the face of the North American aboriginal with the child on her back or the commemorative pieces where the portraits of the presidents of <b>USA<\/b>. According to the official, there are also fake $1 silver coins, but in smaller quantities<\/p>\n<p>some coins <b>fractional <\/b>50-cent nationals have also been <b>counterfeit<\/b>. There are no records of other smaller denomination pieces since it is not a business for counterfeiters. The same goes for the smallest denomination American currency. These cases have not been found because the model of the lower value is more complex and more difficult to falsify, Nieto maintains.<\/p>\n<p>According to the statistics of <b>ECB<\/b>, <b>Quito <\/b>is the city with the highest circulation of false species, but it has also been identified in <b>tulcan<\/b>, <b>Ibarra<\/b>, <b>Ambato<\/b>, <b>Santo Domingo<\/b>, <b>Guayaquil<\/b>. Every month it fluctuates, the official added.<\/p>\n<p>The technician called on the public to be vigilant so as not to be <b>victims <\/b>of this kind of <b>scams<\/b>especially in this time of cash purchases and hassles.<\/p>\n<p>“The circulation of counterfeit coins on buses is common. For example, a person gets on the bus, pays, they give him the change, he only limits himself to saying that he is okay. Then they notice and realize that they have given him a fake coin, or some currency from another country, casino chips, old Trolley chips, etc. This is more because of the rush.”<\/p>\n<p>To avoid being <b>victim <\/b>from <b>fraud <\/b>with <b>banknotes<\/b> either <b>fake coins<\/b>The important thing is to take the time to <b>check the money<\/b> that comes into your hands. There are many ways to <b>detect <\/b>if a species is not true.<\/p>\n<p>In the <b>banknotes<\/b>people should take into account the <b>paper money<\/b>, which should be consistent. Not smooth or too rough. They should also look at the <b>colour<\/b>the <b>sharpness <\/b>of the <b>microprints <\/b>and the <b>traits <\/b>of the <b>characters<\/b>.<\/p>\n<p>To recognize the <b>fake coins<\/b>the <b>users <\/b>They must pay attention to the color, the borders, the definition of the characters and the <b>engravings<\/b>. Nieto details that &#8220;American coins have a gold and reddish edge, however, many of these false coins are armed, like a pasted cookie or in turn have a single color, darker, very yellowish or look rusty.&#8221;<\/p>\n<p>The <b>official <\/b>He said that “it goes without saying that if a citizen receives a counterfeit bill or coin, perhaps due to carelessness or an error, he should not look for another person to harm. The best thing that can be done there is to break the circle at that moment and prevent further harm from being caused, and even worse, to the people who work honestly.”<\/p>\n<p>Article 304 of the <b>Comprehensive Criminal Code<\/b> (COIP) has a <b>sanction <\/b>for people who circulate a <b>false species <\/b>with up to three years in prison. The law establishes that &#8220;the person who introduces, acquires, commercializes, circulates or circulates adulterated, modified or falsified currency in any way, will be sanctioned with a custodial sentence of one to three years.&#8221;<\/p>\n<p>If you are going to do <b>transactions <\/b>in <b>cash<\/b>check very well the bills and coins you receive so as not to be victims of <b>scams <\/b>with <b>counterfeit monetary species<\/b>.<\/p>\n<p>The <b>ECB <\/b>provides training services, aimed at <b>public entities<\/b>, <b>private <\/b>Already <b>general citizenship<\/b>such as groups, collectives or associations that have a specific need, to learn to identify the <b>false species<\/b> of the real ones. In these talks, the subject of securities and the care of paper money, banknotes and monetary species that are mistreated are insisted on, Nieto pointed out.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever been cheated with a counterfeit bill? Tens or thousands of these species circulate in it Ecuador without the authorities being able to calculate its exact amount. The detected They are only those who reach the Finance system national. When the coins or the fake currency are taken to financial entitiesthese are retained [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1188"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1188"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1188\/revisions"}],"predecessor-version":[{"id":1609,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1188\/revisions\/1609"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1188"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1188"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1188"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}