{"id":1190,"date":"2022-05-26T10:59:09","date_gmt":"2022-05-26T10:59:09","guid":{"rendered":"https:\/\/infobloom.site\/world-intellectual-property-day-lets-talk-about-nfts\/"},"modified":"2022-05-30T13:29:35","modified_gmt":"2022-05-30T13:29:35","slug":"world-intellectual-property-day-lets-talk-about-nfts","status":"publish","type":"post","link":"https:\/\/infobloom.site\/world-intellectual-property-day-lets-talk-about-nfts\/","title":{"rendered":"World Intellectual Property Day: let&#8217;s talk about NFTs"},"content":{"rendered":"<p>Non-Fungible Tokens have certified, controlled and protected authorship.<\/p>\n<p>In 2000, the UN established the<strong> World Intellectual Property Day<\/strong>through the World Intellectual Property Organization (WIPO), an event that is celebrated <strong>every April 26.<\/strong><\/p>\n<p>This date seeks to promote the importance of intellectual property rights, in order to <strong>valuing and safeguarding creativity and innovation<\/strong> of those who produce artistic, literary and scientific works, which may be tangible or intangible.<\/p>\n<p>More precisely, intellectual property is a legal discipline that protects names, symbols, images, among other productions that are used commercially. With this legal guideline, <strong>it is possible to prevent any creative work from being plagiarized, since in the event that this happens, the corresponding sanctions will be applied.<\/strong><\/p>\n<p>The figure of the <strong>patents<\/strong> takes relevance in the legal framework of the protection of intellectual property. When a person &#8220;patents&#8221; his work, he achieves recognition, prestige, authenticity and profit.<\/p>\n<p>Currently in the digital world, a large number of productions circulate on the Internet: a gif, a tweet, an image, among other elements, which are often unique and arise from the exclusive creativity of a person.<\/p>\n<p>However, it can hardly remain on the network without being imitated, plagiarized or intervened. The good news is that although it is difficult to protect these productions, it is not impossible. The <strong>NFT&#8217;s<\/strong> They came to color the “grays” that exist regarding the intellectual property of digital works.<\/p>\n<h3>First, what are NFTs?<\/h3>\n<p>NFTs means <strong>Non-Fungible Tokens<\/strong> or, what would be the same, a <strong>“non-expendable asset”<\/strong>. It is a type of digital asset that cannot be modified and is unique.<\/p>\n<p>For example, a work of art. There may be many copies of a single Picasso painting, however, there is only one that is the original. <strong>NFTS work the same way, but in a digital format.<\/strong><\/p>\n<p>As has already been said, NFTS are digital, this means that they involve non-tangible objects. The inimitable archives can be bought and sold like any other type of property, except that they cannot be “collected” or physically kept like conventional works.<\/p>\n<p>To make it simpler: you can have a work of art that is just a file on your computer and you can&#8217;t take it with you. But with a digital certificate that proves that it is our property, its validity and exclusivity is ratified.<\/p>\n<h3>Characteristics of NFTs<\/h3>\n<p>The first characteristic of Non-Fungible Tokens is that no two are the same (generally, not always) and they are personal and unique. There will be copies, there will be some similar ones, but none exactly the same and there is a certificate -or there should be- that shows who the owner is. an authorship <strong>certified, controlled and protected. <\/strong><\/p>\n<p>Being personal, you cannot buy a license for a work and share it, it does not belong to several people, because the good belongs only to the person who acquires it.<\/p>\n<p>The rigor on which its protection is based is directly related to the technology <strong>blockchain<\/strong>, and this is another of its main features. NFTs are <strong>encrypted<\/strong>this mechanism works as follows:<\/p>\n<p>There is a chain of blocks that <strong>follow the history<\/strong> of that NFT, of <strong>who has been its owner at all times from its creator to the present.<\/strong> Through what hands has it been passing? That <strong>Ethereum blockchain or blockchain<\/strong> It allows you to verify who it belongs to, in the same way that the cryptocurrency procedure operates.<\/p>\n<h3>NFT tokens in prices<\/h3>\n<p>They usually vary in amount. But the interested user can consult on the web<strong> Coinraking<\/strong>. This platform provides the profitability or the price of cryptocurrencies in real time, but it also has a specific NFTs section: what are the most expensive tokens, those that were sold at the highest price in history, find out the last price, what was it and how long.<\/p>\n<h3>risks<\/h3>\n<ul>\n<li>Keep in mind that it is a file that &#8220;is&#8221; on a website and for which, perhaps, thousands of euros have been paid. Now, what happens if that website disappears?<\/li>\n<li>By having, for example, a work of art stored in a house, there is a risk that it will be stolen or the house will catch fire. However, the control, broadly speaking, is with the owner.<\/li>\n<li>The problem with digital tokens is that users depend on <strong>web servers<\/strong>in which they are and what can make them run out of their digital collection, and without money.<\/li>\n<li>It does not mean that the risk is always valid, but that it will depend on the company or platform that the person has chosen. It will depend on the site, on the investment.<\/li>\n<li>Another of the disadvantages related to NFTs is not related to their security, but to the <strong>fingerprint <\/strong>that supposes to operate with the chains of clones, that is to say, with the <strong>blockchain.<\/strong><\/li>\n<li>In this sense, the <strong>energy consumption<\/strong> that you need to operate with <strong>ethereum<\/strong> it can imply a problem because of its carbon “footprint”.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Non-Fungible Tokens have certified, controlled and protected authorship. In 2000, the UN established the World Intellectual Property Daythrough the World Intellectual Property Organization (WIPO), an event that is celebrated every April 26. This date seeks to promote the importance of intellectual property rights, in order to valuing and safeguarding creativity and innovation of those who [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1192,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1190"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1190"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1190\/revisions"}],"predecessor-version":[{"id":1611,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1190\/revisions\/1611"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1192"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1190"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1190"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1190"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}