{"id":1195,"date":"2022-05-26T12:05:45","date_gmt":"2022-05-26T12:05:45","guid":{"rendered":"https:\/\/infobloom.site\/fraudulent-investments-and-other-scams-that-misuse-the-name-of-the-world-bank\/"},"modified":"2022-05-30T13:29:48","modified_gmt":"2022-05-30T13:29:48","slug":"fraudulent-investments-and-other-scams-that-misuse-the-name-of-the-world-bank","status":"publish","type":"post","link":"https:\/\/infobloom.site\/fraudulent-investments-and-other-scams-that-misuse-the-name-of-the-world-bank\/","title":{"rendered":"Fraudulent investments and other scams that misuse the name of the World Bank"},"content":{"rendered":"<p>Vice Presidency of Institutional Integrity (i)<\/p>\n<p>Fraud and Corruption<\/p>\n<h3>Frequent questions<\/h3>\n<ol>\n<li><b>Should individuals and companies be wary of investment fraud and other scams using the World Bank name?<\/b><\/li>\n<li><b>What form do these frauds take? <\/b><\/li>\n<li><b>What should you do if you receive suspicious notifications of having earned money to be paid by the Bank, faxes, emails or other correspondence requesting a money transfer or payments that refer to the Bank or any institution of the Group of the Bank? World Bank or asking you to open a personal bank account with it?<\/b><\/li>\n<li><b>Fraudulent and other job offers: What should you do if you receive a suspicious notice about a job offer at the World Bank Group that asks you to send money as part of the hiring process?<\/b><\/li>\n<\/ol>\n<p><b>1. Should individuals and businesses be wary of investment fraud and other scams using the World Bank name?<\/b><\/p>\n<p style=\"margin-left: 40px;\">Yes, all individuals and businesses should be careful not to fall victim to investment scams, known as &#8220;prepayments.&#8221; Some of these scams use the name or pretend to be an institution affiliated with the World Bank Group.<\/p>\n<p>Many of these scams originate in Nigeria and are therefore called “Nigerian scams” ​​or “4-1-9” letters, referring to the number of the section of the Nigerian penal code that refers to this type of scam. There are also some frauds that have been created in Côte d&#8217;Ivoire and Sierra Leone.<\/p>\n<p>Police estimate that thousands of these requests are faxed or emailed weekly to individuals and companies around the world. Only a very small fraction uses the name of the Bank.<\/p>\n<p>Recently, two new types of scams have emerged in South Africa. Requests to open a personal bank account at the Bank, even though the Bank is not a commercial financial institution, or criminals leave phone messages notifying potential victims that they have won money that they can collect at the World Bank.<\/p>\n<p style=\"margin-left: 40px;\">Back to FAQ<\/p>\n<p style=\"margin-left: 40px;\">\n<p><b>2. What form do these frauds take?<\/b><\/p>\n<p style=\"margin-left: 40px;\">The use of sophisticated letterheads and forms to send what appears to be legitimate correspondence from the World Bank Group, as well as various schemes that refer to it, is becoming more and more common. In addition, some scammers often present themselves as auditors of the institution, or as members of the World Bank Regional Office in West Africa.<\/p>\n<p>Recently, the creditors of the Governments of said region received letters via fax in which the senders affirmed that they were empowered by said Governments to settle past debts. In this case, a Bank letterhead very similar to the official one was used.<\/p>\n<p style=\"margin-left: 40px;\">The applications typically ask potential victims to provide personal information, such as signatures or bank account details, and to pay certain up-front fees, commonly referred to as “processing fees.” In exchange, the victim is promised a certain sum of money, which is, of course, false. In some cases, scammers sign the letters with the real names of Bank staff in order to give them more credibility.<\/p>\n<p>See an example (i) (pdf) using apparently official Bank letterhead and signature.<\/p>\n<p>In South Africa, a new type of scam involves a message left on a cell phone saying that the recipient has won money to be paid by the Bank and asking to call a certain phone number to get it. This fraud was discovered when a potential victim arrived at a Bank office in a country to demand payment because the telephone number he had to contact, fortunately, did not work.<\/p>\n<p>See an example (i) (pdf) of fraud involving personal banking information.<\/p>\n<p>The institution has no involvement in these fraudulent letters and cautions the public to be very wary of these and similar requests that falsely claim to be related to the Bank or any member of the World Bank Group.<\/p>\n<p style=\"margin-left: 40px;\">Back to FAQ<\/p>\n<p style=\"margin-left: 40px;\">\n<p><b>3. What should you do if you receive suspicious notifications of having earned money that will be paid by the Bank, faxes, emails or other correspondence requesting a money transfer or payments that refer to the Bank or any institution of the Bank? World Bank Group or asking you to open a personal bank account with it?<\/b><\/p>\n<p style=\"margin-left: 40px;\">If you receive an unusual request for money that mentions a member of the World Bank Group or has any doubts about the involvement of any unit of the World Bank Group in a transaction, request, notification, directive or request, do not respond and do not send money or conduct information about your bank accounts.<\/p>\n<p style=\"margin-left: 40px;\">If you would like to verify if anyone is an employee of the World Bank, please contact the World Bank Human Resources Service Center at 202-473-2222 or hrsoperations@worldbank.org.<\/p>\n<p style=\"margin-left: 40px;\">Visit the website of the Vice Presidency of Institutional Integrity (i)<\/p>\n<p style=\"margin-left: 40px;\">Back to FAQ<\/p>\n<p style=\"margin-left: 40px;\">\n<p><b>4. Fraudulent and other job offers: What should you do if you receive a suspicious notice about a job offer at the World Bank Group asking to send money as part of the hiring process?<\/b><\/p>\n<p style=\"margin-left: 40px;\">There is a worldwide system that includes job and other fraudulent offers that appear to be or are associated with the World Bank Group and through which money and\/or personal information is sought.<\/p>\n<p style=\"margin-left: 40px;\">The World Bank Group never requires any amount of money as part of its hiring process.<\/p>\n<p style=\"margin-left: 40px;\">Official communication from the World Bank Group is always done through emails ending with @worldbankgroup.org or @ifc.org. If you believe you are a potential victim of a fraudulent job offer, please forward any information you have received to: ethics_helpline@worldbank.org.<\/p>\n<p style=\"margin-left: 40px;\">Back to FAQ<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Vice Presidency of Institutional Integrity (i) Fraud and Corruption Frequent questions Should individuals and companies be wary of investment fraud and other scams using the World Bank name? What form do these frauds take? What should you do if you receive suspicious notifications of having earned money to be paid by the Bank, faxes, emails [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1196,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1195"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1195"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1195\/revisions"}],"predecessor-version":[{"id":1612,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1195\/revisions\/1612"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1196"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1195"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1195"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1195"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}