{"id":1197,"date":"2022-05-26T12:39:54","date_gmt":"2022-05-26T12:39:54","guid":{"rendered":"https:\/\/infobloom.site\/medicinal-cannabis-and-nfts-an-undertaking-of-more-than-5-thousand-digital-works\/"},"modified":"2022-05-26T12:39:54","modified_gmt":"2022-05-26T12:39:54","slug":"medicinal-cannabis-and-nfts-an-undertaking-of-more-than-5-thousand-digital-works","status":"publish","type":"post","link":"https:\/\/infobloom.site\/medicinal-cannabis-and-nfts-an-undertaking-of-more-than-5-thousand-digital-works\/","title":{"rendered":"Medicinal Cannabis and NFTs: an undertaking of more than 5 thousand digital works"},"content":{"rendered":"<p style=\"text-align: justify;\">Amid the rapid growth of the global cannabis industry, the company that produces CBD oil and its plant-based health and beauty products is also looking to position itself as a new player in the world of digital assets, especially those that use NFT technology.<\/p>\n<p style=\"text-align: justify;\">The company, whose main objective is to provide physical and mental health to thousands of people through its medicines, has also set ambitious goals to allow the consolidation of this business with the crypto world.<\/p>\n<p style=\"text-align: justify;\">“This project aims to use technology to create an international community that sees the cannabis plant as a generator of change and Colombia as a world benchmark in its production.  We are bringing together the digital world of NFTs with tangible assets such as a Cannabis plant,” Juan Manuel Téllez, co-founder and CEO of Greenlab, told Forbes.<\/p>\n<p style=\"text-align: justify;\">Times Square was the setting chosen by the company and its investors to launch &#8216;Space Resistance&#8217;, a collection of 5,555 digital works by the artist, Julián Majín.  The theme of the coin, related to the cannabis industry, shows a group of astronauts traveling into space to ensure the survival of medical marijuana.<\/p>\n<p style=\"text-align: justify;\">“Join the resistance and become one of the 5,555 space rebels who will help radiate the magic of cannabis through the Ethereum blockchain”, they indicate on the “Space Resistance” website, where they add: “despite the multiple benefits offered by the Cannabis plant, its presence on Earth has been threatened.  That is why we launched this mission in order to take 5,555 astronauts into space and thus ensure the survival of this mystical plant”.<\/p>\n<p style=\"text-align: justify;\">In addition to receiving digital artwork, buyers will receive a medical cannabis product from Greenlab.<\/p>\n<p style=\"text-align: justify;\">“We chose Times Square for the official launch as this is where the world&#8217;s most renowned NFT collections are screened.  We wanted to be present on this stage to gain international visibility and for Colombia to become a benchmark by combining NFT technology with cannabis crops,” Téllez highlighted in a publication.<\/p>\n<p style=\"text-align: justify;\"><strong>What is an NFT<\/strong><\/p>\n<p style=\"text-align: justify;\">NFT stands for non-fungible token.  Tokens are units of value assigned to a business model, such as a cryptocurrency.  And it is that NFTs have a strong relationship with cryptocurrencies, at least in terms of technology, although they are opposites, since Bitcoin is a fungible commodity and NFT is a non-fungible commodity, but in essence they are two sides of the same coin.<\/p>\n<p style=\"text-align: justify;\">For a better understanding, an NFT is like a unique work of art, for example those of Julián Majín, which are already exhibited in Times Square in New York, United States.  If someone wants this particular Julián, they will have to buy it (if it is on sale) or get a copy, in which case we are no longer talking about the original, which is what gives value to the sculpture.<\/p>\n<p style=\"text-align: justify;\">For this reason, the NFT is usually associated with some digital work or illustration.  Its price is really what people want for it, and now that it is at the height of its popularity, you can see that there are people paying $100,000 for a painting of a rock tied to the NFT.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Amid the rapid growth of the global cannabis industry, the company that produces CBD oil and its plant-based health and beauty products is also looking to position itself as a new player in the world of digital assets, especially those that use NFT technology. The company, whose main objective is to provide physical and mental [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1198,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1197"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1197"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1197\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1198"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1197"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1197"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1197"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}