{"id":1199,"date":"2022-05-26T13:35:11","date_gmt":"2022-05-26T13:35:11","guid":{"rendered":"https:\/\/infobloom.site\/nfts-and-blockchain-in-the-music-and-entertainment-industry\/"},"modified":"2022-05-30T13:32:25","modified_gmt":"2022-05-30T13:32:25","slug":"nfts-and-blockchain-in-the-music-and-entertainment-industry","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nfts-and-blockchain-in-the-music-and-entertainment-industry\/","title":{"rendered":"NFTs and Blockchain in the music and entertainment industry"},"content":{"rendered":"<p><img class=\"wp-image-708319\" src=\"https:\/\/www.marketingdirecto.com\/wp-content\/uploads\/2022\/03\/bitcoin.jpg\" alt=\"\" width=\"1200\" height=\"675\" \/><\/p>\n<p>From John Legend to Thalia. From Tom Brady to Paris Hilton. From the Coachella Valley Festival to the Super Bowl. The list of artists, celebrities, brands, festivals, and events riding the NFT wave is getting longer by the day.<\/p>\n<p>The name or brand, its popularity and reputation are some of the essential assets to which these instruments are anchored, which can be used, among other things, for: launches, rewarding users or having a brand presence in the metaverse.<\/p>\n<p>But other emerging musicians, artists and companies in the Latin market are also taking advantage of the tide, seeing these digital instruments as a financing opportunity.<\/p>\n<p>The question is whether in this new world that we are discovering will NFTs and Blockchain reach the Hispanic audience with the same force as they do in the market or will they divide it between those who have and those who have not.<\/p>\n<p>Like any paradigm shift, we are facing a time of transitions where, while many are fully committed to the new era, others are cautious in their steps.<\/p>\n<h3><strong>How do NFTs work?<\/strong><\/h3>\n<p>The acronym NFTs corresponds to &#8216;Non fungible tokens&#8217; an asset that only exists in the virtual world and has a unique digital certificate registered in the blockchain and that is used to record the ownership of that asset as if it were a work of art or an object. of collection.<\/p>\n<p>This opened the door to new opportunities in many ways, even to undiscovered places.<\/p>\n<h3><strong>From music fans to angel investors and song owners<\/strong><\/h3>\n<p>The fan of a musical group, acquires through platforms or in some physical case, their album. If you are a big fan, buy the ticket for your show. And maybe buy the meet and greet as well. It is on this path, the next step is that when making a purchase you include an NFT that remembers that event or that is later used for exclusive content that can be redeemed in the “real” world. There are already companies that are implementing it in this sense.<\/p>\n<p>Another notable path where there are opportunities for the Hispanic market to ride the wave of NFTs is that of platforms such as royal.io, which offers artists and fans to be co-owners of songs. Additionally, those who want to invest can purchase royalty ownership in songs directly from their favorite artists in the form of tokens. Then, if the artist grows, they can claim royalties for the music they own after they&#8217;ve been accrued.<\/p>\n<h3><strong>Warner Music stands out in the metaverse with The Sandbox<\/strong><\/h3>\n<p>Since 2020 and in the face of the crisis caused by covid-19, with the cancellation of shows and the subsequent collapse of global consumption, the music and entertainment industry in general found in NFTs a vital ally for new businesses.<\/p>\n<p>A case to be highlighted is that of the recent alliance between Warner Music Group and The Sandbox, a play-to-earn blockchain game that allows participants to build a virtual world using NFTs.<\/p>\n<p>In this case, the leading artists of WMG will have, within the metaverse developed by the Korean company, a virtual world called “WMG LAND”, where they could offer concerts and events within immersive experiences. In addition to brand presence in the metaverse, fans will be able to interact, browse and engage with their favorite bands and artists.<\/p>\n<p>This model of alliances will be replicated in the long term in many markets, including Hispanics and Latinos, a variable that will provide predictability and the necessary time for those who are lagging behind in the adoption of these technologies, to feel more confident in participating in the market. ecosystem.<\/p>\n<h3><strong>A disruptive market on the rise<\/strong><\/h3>\n<p>According to DappRada, sales in NFTs, across all sectors, reached some $25 billion in 2021, as this speculative crypto asset exploded in popularity. In the same report, he says there were &#8220;signs of slowing growth&#8221; towards the end of the year.<\/p>\n<p>Keeping the market in a stable situation and not bursting like any other speculative bubble, of which we already know examples in recent history, is one of the main challenges of the ecosystem.<\/p>\n<p>It is no less important that fraud or cybersecurity attacks do not appear in transactions: the more operations there are, the greater the risk of cybercrime related to the activity, despite the fact that encrypted and decentralized technology is defined as secure.<\/p>\n<p><strong>Diego Prusky, CEO &amp; Chief Strategist of InPulse Digital<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>From John Legend to Thalia. From Tom Brady to Paris Hilton. From the Coachella Valley Festival to the Super Bowl. The list of artists, celebrities, brands, festivals, and events riding the NFT wave is getting longer by the day. The name or brand, its popularity and reputation are some of the essential assets to which [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1199"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1199"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1199\/revisions"}],"predecessor-version":[{"id":1627,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1199\/revisions\/1627"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1199"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1199"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1199"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}