{"id":1212,"date":"2022-05-26T15:43:44","date_gmt":"2022-05-26T15:43:44","guid":{"rendered":"https:\/\/infobloom.site\/how-nonfungible-tokens-work-and-where-they-get-their-value-a-cryptocurrency-expert-explains-nfts\/"},"modified":"2022-05-26T15:43:44","modified_gmt":"2022-05-26T15:43:44","slug":"how-nonfungible-tokens-work-and-where-they-get-their-value-a-cryptocurrency-expert-explains-nfts","status":"publish","type":"post","link":"https:\/\/infobloom.site\/how-nonfungible-tokens-work-and-where-they-get-their-value-a-cryptocurrency-expert-explains-nfts\/","title":{"rendered":"How nonfungible tokens work and where they get their value – a cryptocurrency expert explains NFTs"},"content":{"rendered":"<p><strong>Takeaways<\/strong><\/p>\n<p>· <strong>Nonfungible tokens provide ownership of a digital item – image, sound file or text – in the same way that people own crypto coins.<\/strong><\/p>\n<p>· <strong>Unlike crypto coins, which are identical and worth the same, NFTs are unique.<\/strong><\/p>\n<p>· <strong>An NFT is worth what someone is willing to pay for it, which can be a lot if the NFT is made by a famous artist and the buyer is a wealthy collector.<\/strong><\/p>\n<p>An attorney friend recently asked me out of the blue about nonfungible tokens, or NFTs.  What prompted his interest in him was the sale of a collage composed of 5,000 digital pieces, auctioned by Christie&#8217;s on March 11, 2021, for a remarkable US$69 million.  Mike Winkelmann, an artist known as Beeple, created this piece of digital art, made an NFT of it and offered it for sale.  The bidding started at $100, and the rest of the auctioning process transformed it into a historical event.<\/p>\n<p>Similarly, it was hard to miss the news about the iconic GIF Nyan Cat being sold as a piece of art, Twitter&#8217;s founder transforming the first tweet into an NFT and putting it up for sale, or an NFT of a New York Times column earning half a million dollars for charity. <\/p>\n<p>My friend&#8217;s questions were an attempt to understand where the underlying value of an NFT comes from.  The issue is that perceptions of what the buyer is paying for are not easily framed in legal terms.  NFT marketplaces do not always accurately describe the value proposition of the goods they are selling.  The truth is that the value of any NFT is speculative.  Its value is determined by what someone else is willing to pay for it and nothing else. <\/p>\n<p>Turning something as ephemeral as a tweet into an item that can be sold requires two things: making it unique and proving ownership.  The process is the same for cryptocurrencies, which turn strings of bits into virtual coins that have real-world value.  It boils down to cryptography.<\/p>\n<h2>keys and blocks<\/h2>\n<p>Cryptography is the technique used to protect privacy of a message by transforming it into a form that can be understood only by the intended recipients.  Everyone else will see it as only an unintelligible sequence of random characters.  This message manipulation is enabled by a pair of keys, public and private keys: You share your public key with your friend, who uses it to transform his message to you into an unintelligible sequence of random characters.  You then use your private key to put it back into its original form. <\/p>\n<p>The special mathematical properties of these two crypto keys are widely used to provide secrecy and integrity.  Two crypto keys play the role of digital signatures and are commonly used in blockchain to enable both authentication and anonymity for transactions.<\/p>\n<p>Blockchain is a crucial technology for creating NFTs.  It uses cryptography to chain blocks into a growing list of records.  Each block is locked by a cryptographic hash, or string of characters that uniquely identifies a set of data, to the previous block.  The transaction records of a chain of blocks are stored in a data structure called a Merkle tree.  This allows for fast retrieval of past records.  To be a party in blockchain-based transactions, each user needs to create a pair of keys: a public key and a private key.  This design makes it very difficult to alter transaction data stored in blockchain. <\/p>\n<p>Although blockchain was initially designed to support fungible assets like Bitcoin and other cryptocurrencies, it has evolved to enable users to create a special kind of crypto asset, one that is nonfungible, meaning provably unique.  Ethereum blockchain is the basis for most of the currently offered NFTs because it supports the ERC-721 token standard, enabling NFT creators to capture information of relevance to their digital artifacts and store it as tokens on the blockchain. <\/p>\n<p><br \/>\n            The first NFTs were made using the cryptographic technology underlying the Ethereum cryptocurrency.  Ivan Radic\/Flickr, CC BY<\/p>\n<p>When you pay for an NFT, what you get is the right to transfer the token to your digital wallet.  The token proves that your copy of a digital file is the original, like owning an original painting.  And just as masterpiece paintings can be copied and distributed as inexpensive posters, anyone can have a digital copy of your NFT.<\/p>\n<p>Your private crypto key is proof of ownership of the original.  The content creator&#8217;s public crypto key serves as a certificate of authenticity for that particular digital artifact.  This pair of the creator&#8217;s public key and the owner&#8217;s private key is primarily what determines the value of any NFT token. <\/p>\n<h2>The very short history of NFTs<\/h2>\n<p>NFTs came to prominence in 2017 with a game called CryptoKitties, which enables players to buy and “breed” limited-edition virtual cats.  From there, game developers adopted NFTs in a big way to allow gamers to win in-game items such as digital shields, swords or similar prizes, and other game collectibles.  Tokenization of game assets is a real game-changer, since it enables transferring tokens between different games or to another player via NFT specialized blockchain marketplaces. <\/p>\n<p>Besides gaming, NFTs are frequently used to sell a wide range of virtual collectibles, including NBA virtual trading cards, music, digital images, video clips and even virtual real estate in Decentraland, a virtual world.<\/p>\n<p>NonFungible.com, a website that tracks NFT projects and marketplaces, puts the value of the total NFT market at $250 million, a negligible fraction of the total crypto coin market but still highly attractive to content creators.  The contract behind the token, based on the ERC-721 standard for creating NFTs, can be set to let content creators continue to earn a percentage from all subsequent sales. <\/p>\n<p>The NFT market is likely to grow further because any piece of digital information can easily be “minted” into an NFT, a highly efficient way of managing and securing digital assets.<\/p>\n<h2>Blockchain&#8217;s carbon footprint<\/h2>\n<p>For all the excitement, there are also concerns that NFTs are not eco-friendly because they are built on the same blockchain technology used by some energy-hungry cryptocurrencies.  For example, each NFT transaction on the Ethereum network consumes the equivalent of daily energy used by two American households. <\/p>\n<p>Security for most of today&#8217;s blockchain networks is based on special computers called “miners” competing to solve complex math puzzles.  This is the proof-of-work principle, which keeps people from gaming the system and provides the incentive for building and maintaining it.  The miner who solves the math problem first gets awarded with a prize paid in virtual coins.  The mining requires a lot of computational power, which drives electricity consumption.<\/p>\n<p>Ethereum blockchain technology is evolving and moving toward a less computationally intensive design.  There are also emerging blockchain technologies like Cardano, which was designed from the outset to have a small carbon footprint and has recently launched its own fast-growing NFT platform called Cardano Kidz. <\/p>\n<p>The speed of transformation of blockchain technology into a newer, more eco-friendly variant might well decide the future of the NFT market in the short term.  Some artists who feel strongly about global warming trends are opposed to NFTs because of perceived ecological impact.<\/p>\n<h2>The coming crypto-economy<\/h2>\n<p>Whether or not the current NFT craze can keep its momentum going, NFTs have already accelerated a larger trend of digital economic innovation.  NFTs have confirmed that the public is feeling increasingly favorable toward a crypto-economy and is embracing short-term risks in return for creating new business possibilities.<\/p>\n<p>[Over 100,000 readers rely on The Conversation’s newsletter to understand the world. Sign up today.]<\/p>\n<p>NFTs have already made significant inroads into the luxury and gaming industries, and have plenty of room to grow beyond these initial applications.  The art sector will continue to be an important segment of the overall NFT market and is likely to gradually reach maturity over the next couple of years, although it is likely to be surpassed by other digital certificate applications like trademarks and patents, training and upskilling certificates. .<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Takeaways · Nonfungible tokens provide ownership of a digital item – image, sound file or text – in the same way that people own crypto coins. · Unlike crypto coins, which are identical and worth the same, NFTs are unique. · An NFT is worth what someone is willing to pay for it, which can [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1214,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1212"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1212"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1212\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1214"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1212"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1212"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1212"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}