{"id":1217,"date":"2022-05-26T16:48:17","date_gmt":"2022-05-26T16:48:17","guid":{"rendered":"https:\/\/infobloom.site\/preferential-fraud-in-spain-updated-2022\/"},"modified":"2022-05-26T16:48:17","modified_gmt":"2022-05-26T16:48:17","slug":"preferential-fraud-in-spain-updated-2022","status":"publish","type":"post","link":"https:\/\/infobloom.site\/preferential-fraud-in-spain-updated-2022\/","title":{"rendered":"Preferential fraud in Spain (updated 2022)"},"content":{"rendered":"<p>The preferred ones.  Who has not heard about this thorny issue of the preferred ones.  A few years ago, this term was only known by some as a new and highly profitable banking product, but today, 2017, almost all Spaniards, if not all and part of the foreigner, know much more about the preferential and other banking products and terminology due to the serious consequences that the sale of this product has had on many.  In this post we are going to try to explain easily and clearly how the preferred fraud (also known as the preferred scam) developed in Spain.<\/p>\n<h3>What are the preferred<\/h3>\n<p>Preferred shares (PPR) were <strong>securities issued by companies<\/strong> (bank or savings bank) <strong>that, not conferring the right to participate in its share capital or the right to vote<\/strong> they were perpetual in nature and had a high expected return, generally variable but not guaranteed.<\/p>\n<h3>What is preferred fraud<\/h3>\n<p>The fraud or scam of the preferentials experienced in Spain was conceived in the 90s of the last century, accentuating since 2003. <strong>With the start of the global economic and financial crisis in mid-2007, Spanish banks began to need more capital<\/strong> to cover its strong decreases in income and capitalize and the preferentials were massively removed from the sleeve in the period 2009 to 2011, when the real estate bubble burst and delinquency skyrocketed.<\/p>\n<p>The preferred companies had two circumstances that make the consequences on the approximately 700,000 affected by their purchase more serious.  They were marketed without due transparency since <strong>it was difficult to understand the product due to its complexity<\/strong> And in second place, <strong>recipients, seniors and pensioners with savings and a conservative investment profile<\/strong>they thought they were buying fixed income when in fact it was equities.<\/p>\n<p>The preferred ones, which reached a contracted value of around 30,000 million euros in Spain, had the initial approval of the Bank of Spain of the National Securities Market Commission (CNMV) but the reality is that they were placed with aggressive commercial techniques to savers without sufficient knowledge to understand what they were subscribing to.<\/p>\n<p>When the crisis broke out and these &#8220;shares without rights&#8221; lost their market value due to the banking crisis, the Government of Spain admitted that their marketing was a mistake and the CNMV also recognized that on many occasions they were marketed without complying with the law.<\/p>\n<h3>Affected by preferred<\/h3>\n<p>The “preferred” savers were deceived due to poor banking practices in their commercialization, abuses and inequality in the information received by clients, since they hid from them that the product had very high risks, causing them serious economic losses.<\/p>\n<p>This product, which the preference holders thought was a fixed income product, turned out to be a variable income product.  The bank or savings bank promised to pay a return according to its results, and could even give nothing.  Initially, they received high interest in the years when everything was going well, but they became zero euros, in many cases, during the crisis, due to the weak banking situation.  Hence the serious consequences of the marketing of this product.<\/p>\n<p>For more &#8220;inri&#8221;, in the event that the bank went bankrupt (and there were cases), the Deposit Guarantee Fund would only cover up to 100,000 euros of the &#8220;deposits in money and in securities or other financial instruments constituted in the entities of credit&#8221;.<\/p>\n<h3>First lawsuits<\/h3>\n<p>In mid-2011 the preferred market exploded.  Supervisory authorities said nothing.  Those affected who had invested their life savings in this product could not get their money back since their &#8220;shares&#8221; were worth nothing and they realized what a big scam they had been led into.  At the beginning of 2012, the mobilizations, protests, closures in town halls and lawsuits began.<\/p>\n<p><\/p>\n<p>The duration and extent of these protests made the governments of Galicia, Catalonia and the executive in Madrid quickly seek a solution to contain the social tension.  They made the decision to start returning the money in the most flagrant cases, obtaining the recovery of the money for almost 300,000 affected people.<\/p>\n<p>Many of them are still claiming their money in court and awaiting court rulings.<\/p>\n<p>After the preferred ones, in Spain, more misleading products have been appearing, such as floor clauses, multi-currency mortgages, swaps (financial swaps), IRPH mortgages and others that we will deal with in future articles.<\/p>\n<h3>The view of the Judges<\/h3>\n<p>The users affected by the preferential ones mobilized, they made themselves seen, so that the Justice would know the reality closely.  Many of them were elderly people, with little financial culture and with their life savings deposited in their “friendly bank”, who lost everything.<\/p>\n<p>These great abuses made the judges aware of the serious social problem.  The Courts of First Instance began to rule.  Then the Provincial Courts and finally the Supreme Court issued sentences where the financial entities were obliged to compensate those affected.<\/p>\n<p>This is the case of Bankia.  Due to its IPO with the issue of preferred shares, more than 103,994 lawsuits and extrajudicial claims were filed, with thousands of judgments being issued in favor of customers and the bank having to dedicate more than 4,000 million euros to satisfy the demands of preferred shareholders and shareholders.  Returns and lawsuits continue to this day.  On the Bankia website you can see the number of &#8220;arbitrage&#8221; requests accepted and those rejected as of September 2014 (very outdated data):<\/p>\n<p><img class=\"aligncenter size-full wp-image-8734\" alt=\"\" width=\"363\" height=\"502\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/Preferential-fraud-in-Spain-updated-2022.png\"\/><\/p>\n<p>Another case that we have discussed was that of Bankinter, which was sentenced by the Civil Chamber of the Supreme Court (TS) to return the money to a consumer client who was recommended to take out preferred shares (shares) in an Icelandic bank that later broke.<\/p>\n<h3>The problem of Preferentials outside of Spain<\/h3>\n<p>This bad practice was not only done in Spain.  The United Kingdom and the United States also issued them, but the only and notable difference with Spain is that they were severely punished by the supervisors with very serious sanctions.  For example, the ten main US and European banks, between 2009 and 20015, have received fines that have exceeded 150,000 million dollars, while in Spain the sanctions have been negligible.<\/p>\n<p>To this day we continue to read more articles about the preferred ones in the press.  Claims, lawsuits and lawsuits that are still being heard in court.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The preferred ones. Who has not heard about this thorny issue of the preferred ones. A few years ago, this term was only known by some as a new and highly profitable banking product, but today, 2017, almost all Spaniards, if not all and part of the foreigner, know much more about the preferential and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1220,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1217"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1217"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1217\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1220"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1217"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1217"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1217"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}