{"id":122,"date":"2022-05-03T12:45:08","date_gmt":"2022-05-03T12:45:08","guid":{"rendered":"https:\/\/infobloom.site\/how-to-protect-yourself-from-nft-scams\/"},"modified":"2022-05-03T12:45:08","modified_gmt":"2022-05-03T12:45:08","slug":"how-to-protect-yourself-from-nft-scams","status":"publish","type":"post","link":"https:\/\/infobloom.site\/how-to-protect-yourself-from-nft-scams\/","title":{"rendered":"How to protect yourself from NFT scams?"},"content":{"rendered":"\n<p>The world of cryptocurrencies and NFTs resembles the Far West, <strong>where anything goes<\/strong>.  Being the person responsible for all the assets, many factors and third parties come into play with the desire to steal them.  Any security measure is not enough, but it is not only about security measures, but you have to try to maintain some habits every day and never let your guard down.<\/p>\n<p>Don&#8217;t be scared, you will see dozens of robberies and some of them will even be yours to experience up close (friends, relatives or cyber-acquaintances).  Maintaining good habits, knowing the sector and <strong>taking all precautions<\/strong> nothing has to happen.  Of course, there will always be someone lurking waiting for you to get lost.<\/p>\n<h2><b>The biggest NFT scams and how to avoid them<\/b><\/h2>\n<p>As NFTs become more common, scammers are also getting smarter.  This has led to even the most veterans being scammed.  Take for example the famous rapper, Waka Flocka Flame, who <strong>lost $19,000<\/strong> in an NFT scam just a few months ago.  Apparently Thieves 2.0<strong> sent some malicious NFTs<\/strong> to one of your wallets.  When he clicked on the assets in an attempt to remove them, his funds were automatically transferred to the attackers.<\/p>\n<p>Clearly, you can never be too careful in the crypto universe.  You never know who is behind you, where and when they will try something.  The only way to keep your cryptocurrencies and NFTs safe is<strong> take all necessary precautions<\/strong>.  And it goes without saying: always keep your guard up and be very careful with who and what you interact with online.<\/p>\n<h3><b>NFT Phishing Scams<\/b><\/h3>\n<p>phishing <strong>is a common online scam<\/strong> in which scammers pose as real organizations to steal sensitive information through emails, text messages, and other means.  The same thing has been happening a lot in the NFT world, where impersonators try to steal your private keys or seed phrase.<\/p>\n<p>Now, a seed phrase is a list of 12 to 24 words generated by a crypto wallet to give you access to the wallet, i.e. the cryptocurrencies and NFTs stored there.  No one can reset this key, including your wallet provider.  Due to the underlying blockchain technology, once a wallet is compromised and funds are stolen, no one can reverse the transactions.  In a nutshell, if your cryptocurrencies are stolen, the process cannot be reversed and therefore,<strong> you lose them forever<\/strong>.<\/p>\n<p>A typical example of an NFT phishing scam is a <strong>NFT tempting prize<\/strong> which leads unsuspecting fans to share their opening sentence.<\/p>\n<p>Stazie, the co-founder of the game Hedgie, is one such phishing victim.  In August, she lost nearly a million in assets, including 16 <strong>CryptoPunks <\/strong>and a large amount of ETH.<\/p>\n<p>After clicking on a prize link from a CryptoPunks bot on Discord, Stazie was taken to a site very similar to CryptoPunks.  A popup for what looked like MetaMask also appeared.  This was followed by a message saying &#8220;security is compromised&#8221; and her asking her to enter the seed phrase to restore the wallet, which she, unfortunately, did.  Before she could do anything, the scammer (or scammers) got away with it.<\/p>\n<p>Similarly, scammers posing as security agents or support staff members may contact you to help you with some issues.  Some may even send fake wallet security alert emails or OpenSea offers for your NFTs.  All of these probably <strong>they will come with phishing links to steal your seed phrase<\/strong>.<\/p>\n<h4>Never share your opening sentence<\/h4>\n<p>Remember, <strong>you will never have to enter your initial phrase to complete any transaction<\/strong>.  Nor the<strong> NFT markets<\/strong> nor will wallet providers ask for your private key.  If someone asks you this, it&#8217;s a scam and quit immediately.  Also, make sure you keep your password safe and offline so hackers don&#8217;t get access to it.<\/p>\n<h3><b>Fake NFT Collections and Websites<\/b><\/h3>\n<p>As we mentioned in the case of phishing attacks, <strong>there are many fake websites<\/strong>.  Even if you are searching Google for an NFT portal yourself, a simple typo could lead you to a fake website.  Since most of these sites look very similar to the original, you probably won&#8217;t realize what happened until it&#8217;s too late.<\/p>\n<p>Imagine NFT Trader, a website commonly used by NFT traders.  While the official domain is &#8216;nfttrader.io&#8217;, there are several fake websites that use domains like &#8216;ntftrader.io&#8217; or &#8216;nfttrader.link&#8217;.  In one such scam, @shanterpster lost a Bored Ape valued at $281,000.  Therefore, every time you use a dApp, <strong>double check to make sure you&#8217;re using the correct one<\/strong>.<\/p>\n<p>The same goes for NFT projects within the markets, scammers <strong>create dozens of project replicas<\/strong> NFT online.  Here are some ways to avoid getting scammed with a fake collection.<\/p>\n<ul>\n<li aria-level=\"1\">The markets like <strong>Open Sea <\/strong>they verify collections and creators as authentic and add a verified badge to accounts.  Buying verified collections is a good way to avoid falling for NFT scams.  In this guide you can see <strong>how to get the blue verified in OpenSea<\/strong>.<\/li>\n<li aria-level=\"1\">Look for the telltale signs of fake NFTs.  This includes a<strong> price too low<\/strong>a small collection size, or low sales volume.<\/li>\n<li aria-level=\"1\">Another way to spot a fake NFT is to check its description and individual properties.  Most of the time, fraudulent NFTs <strong>they will not have any description or property<\/strong>.<\/li>\n<\/ul>\n<h3><strong>Do not interact with NFT or tokens sent to your wallet<\/strong><\/h3>\n<p>Connecting your wallets on websites, in itself, is safe.<\/p>\n<p>The only drawback is that since the website has your wallet address, it could <strong>used for any attack<\/strong>.  For example, some websites use insecure methods like &#8216;eth_sign&#8217;, which will allow even transaction messages to be signed.<\/p>\n<p>There is a common misconception that disconnecting your wallet once connected will help, but it won&#8217;t.  To protect your wallet,<strong> you should never interact with an unknown contract<\/strong>.  If the contract has any malicious function, it can steal the contents of your wallet when activated.<\/p>\n<p>Follow the golden rule: <strong>if it&#8217;s free, it&#8217;s probably a scam<\/strong>.  If someone sends you free NFTs, do not interact with them in any way.  Do you remember what happened with Waka Flocka Flame?  Therefore, do not try to delete them, send them elsewhere or sell them;  just ignore them.<\/p>\n<h3><b>Beware of rug pulls<\/b><\/h3>\n<p>For investors with less knowledge, there is a problem <strong>when the creators do not comply with a project<\/strong> <strong>and they run away<\/strong> with all the money.  Typically, scammers will create a normal-looking project with sneak peeks of artwork, a website, social media accounts, and more.  However, after launch, when collectors have minted the NFTs, developers run away with all the money, leaving investors empty-handed.<\/p>\n<p>Unlike the normal NFT scams mentioned above, rug pulls <strong>are more difficult to identify<\/strong>.  Therefore, be very careful with new projects and do enough research, especially from developers, before investing.<\/p>\n<h2><b>Stolen works of art or identity theft<\/b><\/h2>\n<p>Another increasingly common scam in the NFT market <strong>are the art forgeries<\/strong>.<\/p>\n<p>A host of artists like Derek Laufman, RJ Palmer, Trevor Henderson, Liam Sharp and more have had their work stolen and sold as NFTs.  Since scammers often impersonate the artist, with their profile picture and bio, naive fans end up buying the NFTs.  In one case, acclaimed graffiti artist Banksy&#8217;s website was hacked and the hacker added a link to a fake NFT auction site.  None other than Pranksy fell for the scam and shelled out $336,000 for the piece.<\/p>\n<p>While it&#8217;s easy to fall for such scams, here are a few steps to make sure you don&#8217;t end up buying a stolen NFT:<\/p>\n<ul>\n<li aria-level=\"1\">buy from <strong>verified artists<\/strong> in markets is an easy step to confirm the authenticity of NFT.  Alternatively, you can choose reliable websites like <strong>Foundation<\/strong>, <strong>super rare <\/strong>and KnownOrigin.<\/li>\n<li aria-level=\"1\">If it&#8217;s a famous artist, it&#8217;s likely that they&#8217;ll also post about the drops on their social media accounts.  So make sure to look for any official announcement from them.  Just to be safe, you can always ask the artist directly.<\/li>\n<li aria-level=\"1\">If it&#8217;s a relatively unknown artist, take a close look at their social media sites to see how legitimate they are.<\/li>\n<li aria-level=\"1\">Use Google&#8217;s reverse image search to learn the origins of the artwork and the versions that exist on the internet.<\/li>\n<\/ul>\n<h3><b>Discord hacks are on the rise<\/b><\/h3>\n<p>Discord has become the Telegram of cryptocurrencies.  Which means that most of the NFT fans are there supporting their collections or in the <strong>drop search<\/strong>.  In this guide you will learn in more detail how to <strong>protect your Discord community<\/strong>.<\/p>\n<p>We have already discussed phishing and now you should know that you should never click on unknown links that you receive, be it in emails or direct messages from Discord.  But, the links posted by authentic NFT projects on their Discord servers must surely be safe, right? <strong>well not always<\/strong>.  Unfortunately, there have been a number of attacks on NFT Discord servers where scammers hack their bots.<\/p>\n<p>Basically, after hacking the bot, the crooks will post a message to the channel.  Pirates often advertise a &#8220;release or drop&#8221; with a link to a fake website.  Once people lie through the website, the scammers will walk away with all the money.  This is what happened recently with the Boss Beauties NFT project.  The project is one of many that have been aware of these types of scams on Discord.<\/p>\n<p>Discord hacks <strong>are difficult to detect<\/strong>, especially if the dubious links are posted on the official Discord channel.  All you can do is check the links before spending any amount.  Alternatively, it can also help to confirm with the founders of the project before lying about anything.<\/p>\n<h2>Conclusions<\/h2>\n<p>As the industry evolves, <strong>NFT scams will only increase<\/strong>.  Although we have listed some of the most common scams, it is not an exhaustive list and new methods will appear before long.<\/p>\n<p>As a general rule, always have <strong>very careful whenever you plan to lie any NFT<\/strong>.  Also, be sure to take extra precautions like using two-factor authentication for your accounts and a password manager.  You can also use a cold wallet to store your assets offline.  Lastly, check out our <strong>guide to best wallets for NFT<\/strong>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The world of cryptocurrencies and NFTs resembles the Far West, where anything goes. Being the person responsible for all the assets, many factors and third parties come into play with the desire to steal them. Any security measure is not enough, but it is not only about security measures, but you have to try to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":123,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/122"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=122"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/122\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/123"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=122"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=122"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=122"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}