{"id":1221,"date":"2022-05-26T17:20:35","date_gmt":"2022-05-26T17:20:35","guid":{"rendered":"https:\/\/infobloom.site\/i-have-been-the-victim-of-a-scam-or-fraudulent-broker\/"},"modified":"2022-05-30T13:31:43","modified_gmt":"2022-05-30T13:31:43","slug":"i-have-been-the-victim-of-a-scam-or-fraudulent-broker","status":"publish","type":"post","link":"https:\/\/infobloom.site\/i-have-been-the-victim-of-a-scam-or-fraudulent-broker\/","title":{"rendered":"I have been the victim of a scam or fraudulent broker"},"content":{"rendered":"<p><\/p>\n<p>Discover <strong>what to do and who to turn to<\/strong> step by step if you have been or think you are being scammed by a scammer broker…<\/p>\n<p><strong>Have you invested your savings and the broker has disappeared without a trace? Or do you want to withdraw your money but your broker avoids it by making excuses of all kinds?<\/strong><\/p>\n<p>The Internet and social networks have led to the excessive expansion of online scams, especially in the financial field. Although it is true that the investment markets are increasingly regulated, there are still <strong>many scammers who take advantage of new technologies to falsify data and create non-existent brokers<\/strong> with the aim of stealing from traders.<\/p>\n<p>If when reading the following criteria you feel identified, analyze your situation and file a complaint.<\/p>\n<h2 id=\"como-averiguar-si-soy-victima-broker-scam\" style=\"margin-top: 45px;\">How to find out if I am being a victim of a broker scam<\/h2>\n<p>If you are experiencing any of the criteria (even just one) that you are about to read below, be suspicious and check registrations, licenses, etc. from your broker.<\/p>\n<ul style=\"margin-top: 25px;\">\n<li>you receive <strong>invite incentives<\/strong> to other people or gifts to deposit, etc.<\/li>\n<li>The broker promises you <strong>big benefits<\/strong>sometimes even when all markets are losing.<\/li>\n<li>The broker asks you <strong>personal documents<\/strong> that you should never provide, such as a photo or a scan of your credit card on both sides.<\/li>\n<li><strong>Your advisor or account manager has a Latin accent<\/strong>: This does not mean that if your advisor is Latino, the broker is automatically a scam. What is certain is that most of the call centers of these scam brokers are located in Latin American countries.<\/li>\n<li>Your broker helps you create an investment strategy with which <strong>you earn capital at the beginning<\/strong> (this is the hook).<\/li>\n<li><strong>you suffer harassment<\/strong> constant through calls and emails.<\/li>\n<li><strong>Your advisor opens and closes trades for you<\/strong>: in retail account trading you are the one who has to invest, no reliable broker can touch the accounts of their clients, much less operate on their behalf.<\/li>\n<li><strong>You start losing and your broker insists that you deposit more money<\/strong> to avoid losing the investment.<\/li>\n<li><strong>You can&#8217;t withdraw the money<\/strong>. The broker makes excuses of any kind (technical, legal, administrative&#8230;) to avoid paying the account balance.<\/li>\n<li><strong>To withdraw your deposit you have to pay more money<\/strong>, whether in the form of commissions, invented taxes (usually a UK tax), because you have a loan with the broker (as if it were a bank), etc. This is the most common strategy used by scammers to steal more money from you before they disappear.<\/li>\n<li><strong>You want to close your account and insist on offering you bonus<\/strong>or a bonus of money (they put a part as a gift if you invest more).<\/li>\n<li><strong>Communication with your broker is poor as soon as you decide to withdraw the money<\/strong>: does not respond to your messages and\/or calls, emails, etc. Normally, they take between 2 and 3 days to respond.<\/li>\n<li>It may happen that, if you are already aware of having suffered a scam, &#8220;lawyers&#8221; and\/or &#8220;agencies&#8221; contact you with the promise of getting your money back. Be wary of them as they may be part of the same scam.<\/li>\n<li><strong>The broker „disappears“<\/strong>.<\/li>\n<\/ul>\n<p><img class=\"img-responsive center-block images-startseite-xs lazyload\" title=\"This is how a scammer scams you\" src=\"https:\/\/www.brokeronline.es\/wp-content\/uploads\/2019\/01\/cabecera-tecnicas-brokers-scam.png\" alt=\"scammers brokers\" \/><\/p>\n<h2 id=\"que-hacer-si-me-estafan\" style=\"margin-top: 35px;\">What to do if I am being scammed?<\/h2>\n<p>Now, before moving on to legal matters, it is important to be prepared to deal with the issue in the best possible way.<\/p>\n<ol>\n<li>Remember that the most important thing is <strong>keep calm and take your case to experts<\/strong>do not try to solve it alone because it could be worse, the scammers have your personal information and it could be counterproductive to &#8216;play&#8217; with them.<\/li>\n<li><strong>Report the fraud to your bank so they can block suspicious payments on your account<\/strong>. If you used a bank card (Visa or Mastercard), you have <strong>540 days<\/strong> to report and request that the insurance cover you in case of fraud. In addition, it requests a new one and blocks the current one.<\/li>\n<li><strong>Collect all the evidence and information you can<\/strong> to demonstrate the scam: emails, phone call records, WhatsApps, &#8216;screenshots&#8217;, etc.<\/li>\n<li><strong>Cut off all contact with the broker<\/strong>.<\/li>\n<li><strong>Report your situation to the police.<\/strong> Even if you have not invested a lot of money, these people have your personal data and can use it for illicit purposes, which is why you should report your case. If any problem occurs, you will know that you have been the victim of a scam and that someone can implant your identity.<\/li>\n<li><strong>Try to get the money back.<\/strong> You may be able to withdraw the money if the scammers aren&#8217;t suspicious of your intentions and if they think you&#8217;re going to invest a lot more in the near future.<\/li>\n<li><strong>Share all the details about the scam<\/strong>, his technique, communicate your story in all possible means and to other people to prevent other investors from this broker. It also sends a complaint to the CNMV to spread the alarm.<\/li>\n<li>If you find more victims of the same broker, do not hesitate to expose your situation and perhaps they can make a <strong>class action lawsuit<\/strong> (they have more legal weight).<\/li>\n<li>You should not feel embarrassed or humiliated, scammers are experts in making their victims fall for their games and they know how to handle any type of person.<\/li>\n<li><strong>If the page belongs to GoDaddy, feel free to send an email to [email protected]<\/strong> reporting that they have registered a web page that is dedicated to fraud.<\/li>\n<li><strong>Report the URL<\/strong> Browsers like Chrome and Edge have a service where you can report fraudulent sites, so the URL is blocked:<br \/>\nGoogle Safe Browsing for Firefox<br \/>\nReport unsafe site in Microsoft Edge<br \/>\nReport a fraudulent page in Chrome<\/li>\n<\/ol>\n<p><img class=\"img-responsive center-block images-startseite-xs lazyload\" title=\"Complete list of scammers\" src=\"https:\/\/www.brokeronline.es\/wp-content\/uploads\/2019\/01\/brokers-lista-negra.png\" alt=\"scammers brokers\" \/><\/p>\n<h2 id=\"a-donde-acudir\" style=\"margin-top: px;\">To whom to turn?<\/h2>\n<p>This depends largely on the country where you are, since each one has its own legislation. The first thing you should do is <strong>address the institutions of your country<\/strong> to seek shelter in them.<\/p>\n<p>If this does not work, you will have to contact the authorities that register and regulate the broker<br \/>\nin question.<\/p>\n<p><img class=\"img-responsive center-block images-startseite-xs lazyload\" title=\"Broker regulatory bodies\" src=\"https:\/\/www.brokeronline.es\/wp-content\/uploads\/2018\/10\/cabecera-organismos-de-regulacion-brokers.png\" alt=\"Broker regulatory bodies\" \/><\/p>\n<p><img class=\"img-responsive center-block images-startseite-xs lazyload\" title=\"Trading Fraud Lawyers\" src=\"https:\/\/www.brokeronline.es\/wp-content\/uploads\/2019\/04\/cabecera-abogados.jpg\" alt=\"Lawyers specialized in scams\" \/><\/p>\n<p><strong>In Spain<\/strong>for example, <strong>There are several government complaint mechanisms that can advise you and help you with the entire process:<\/strong><\/p>\n<h3 style=\"margin-top: 35px;\">National Stock Market Commission<\/h3>\n<p>The CNMV is the first body we recommend you go to, as they are experts in the field. If you are not in Spain, look for a similar institution in your region.<\/p>\n<p>● Email: [email protected] Y [email protected]<br \/>\n● Investor service telephone number: 900 535 015.<br \/>\n● Inquiry form: http:\/\/www.cnmv.es\/DocPortalInv\/OtrosPDF\/ES-FormularioconsultasCNMV.pdf<br \/>\n● Directly at their offices: C\/ Edison, 4, 28006 Madrid – Passeig de Gràcia, 19, 08007 Barcelona.<\/p>\n<p>You will probably have to file a lawsuit. For more information on the subject, visit the website of the police in your country.<\/p>\n<h3 style=\"margin-top: 45px;\">The English FCA (if your broker is regulated in the UK)<\/h3>\n<p>If your broker is regulated by the FCA, you can also go to them since, as the regulatory body in charge of supervising the activity of the broker, they are responsible for granting or not granting the licenses.<\/p>\n<p>Website with all the necessary information to report a fraud or a scam: https:\/\/www.fca.org.uk\/consumers\/report-scam-us (in English).<\/p>\n<h3 style=\"margin-top: 45px;\">Financial Ombudsman (if your broker is regulated in Cyprus)<\/h3>\n<p>If your broker is regulated by Cysec, you can go to the Financial Ombudsman to file an official complaint. We leave you the info here:<\/p>\n<p>• Complaints: [email protected]<br \/>\n• Financial Ombudsman: [email protected]<br \/>\n• Website: www.financialombudsman.gov.cy. Website with forms to submit to report fraud or scam: http:\/\/www.financialombudsman.gov.cy\/forc\/forc.nsf\/page16_en\/page16_en?OpenDocument.<\/p>\n<h3 style=\"margin-top: 45px;\">Technological Investigation Unit of the National Police<\/h3>\n<p>Police unit whose objective is to stop new forms of online crime. They are in charge of the investigation and persecution of both Spanish and international brokers.<\/p>\n<p>Start your complaint by completing this official online form for internet fraud: https:\/\/www.policia.es\/formulario_generico.php?ordenes=52<\/p>\n<h3 style=\"margin-top: 45px;\">Internet Security Office \/ National Institute of Cybersecurity<\/h3>\n<p>They appreciate the citizen collaboration to intercept fraud cases in time.<\/p>\n<p>They also offer support from their specialized technical team, so don&#8217;t hesitate to contact them by mail: [email protected]<\/p>\n<h3 style=\"margin-top: 45px;\">What if I don&#8217;t live in Spain?<\/h3>\n<p><strong>Federal Trade Commission<\/strong><br \/>\n<strong>Based in the United States<\/strong>the FTC investigates hundreds of agencies inside and outside the country, its objective is to prevent bad practices and help the consumer.<\/p>\n<p>Go to their website to make your complaint: www.ftc.gov\/complaint where you will have to answer several questions about your case; In addition, if you have evidence, we recommend uploading it to the platform since all information is necessary.<\/p>\n<p>Sadly <strong>there is a possibility that, even if a legal process is initiated, you will not be able to recover your money<\/strong>.<\/p>\n<p>However, I am aware that <strong>with your complaint and spreading the word<\/strong>, <strong>can you<\/strong> share your story and <strong>help other future victims<\/strong> not to fall into the trap.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Discover what to do and who to turn to step by step if you have been or think you are being scammed by a scammer broker… Have you invested your savings and the broker has disappeared without a trace? Or do you want to withdraw your money but your broker avoids it by making excuses [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1222,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1221"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1221"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1221\/revisions"}],"predecessor-version":[{"id":1623,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1221\/revisions\/1623"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1222"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1221"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1221"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1221"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}