{"id":1223,"date":"2022-05-26T17:52:51","date_gmt":"2022-05-26T17:52:51","guid":{"rendered":"https:\/\/infobloom.site\/how-to-create-collect-the-next-wave-of-digital-assets\/"},"modified":"2022-05-26T17:52:51","modified_gmt":"2022-05-26T17:52:51","slug":"how-to-create-collect-the-next-wave-of-digital-assets","status":"publish","type":"post","link":"https:\/\/infobloom.site\/how-to-create-collect-the-next-wave-of-digital-assets\/","title":{"rendered":"How to Create &#038; Collect the Next Wave of Digital Assets"},"content":{"rendered":"<p>Ethereum has been the star of the cryptoeconomy in 2020 thanks to the breakout success of the smart contract platform&#8217;s rising sectors, eg decentralized finance.<\/p>\n<p>Beyond DeFi, non-fungible tokens (NFTs) have given life to another one of Ethereum&#8217;s most promising, though comparatively lesser known, arenas.  Notably, the supermajority of NFT activity to date has taken place on Ethereum.<\/p>\n<p>If DeFi is made of “money legos,” then NFTs can be somewhat similarly understood as programmable “media legos.”  Simply put, these special tokens are provably scarce digital assets, of which the provenance and ownership are perpetually guaranteed by the Ethereum blockchain.<\/p>\n<p>This new crypto-native token standard can empower creators — whether they be artists, developers, or beyond — in a range of ways that weren&#8217;t possible before, eg caking automated royalties right into digital assets.<\/p>\n<p>In today&#8217;s post, then, let&#8217;s break down NFTs: what they are, how to make and sell them, how to collect them, and more.<\/p>\n<h2>What Are NFTs?<\/h2>\n<p>Fiat cash is fungible, eg a $5 USD bill is completely interchangeable with any other $5 USD bill.  Similarly, cryptocurrencies like bitcoin and ether are fungible, ie 1 BTC is interchangeable for 1 BTC and 1 ETH is interchangeable for 1 ETH, etc.<\/p>\n<p>On the flip side, NFTs, which rely on special token standards like ERC-721 to ensure uniqueness, are non-interchangeable and verifiably unique and scarce courtesy of blockchain tech.<\/p>\n<p> What Are Non-Fungible Tokens?  Unique &#038; Authentic Digital Assets<\/p>\n<p>In this way, NFTs are like digital collectibles or proofs-of-ownership that are valuable precisely because they are 1\/1 or limited-edition assets that are liquid and useful atop a platform like Ethereum.<\/p>\n<p>The NFT ecosystem first took off in 2017 with the launch of pioneering collectibles projects like CryptoPunks and CryptoKitties, and since then the space has bloomed toward a variety of new use cases and industries.  Per analytics site NonFungible.com, the NFT economy seen over $109 million in all-time token sales to date, with $1 million of that revenue coming just last week alone!<\/p>\n<h2>The Different Types of NFTs<\/h2>\n<p>NFTs can be used to tokenize just about anything, with various media types being particularly low-hanging fruits.  So far, some of the most popular NFT use cases have been:<\/p>\n<ul>\n<li><strong>digital-art <\/strong>(SuperRare, KnownOrigin, Async Art, Rare, etc.)<\/li>\n<li><strong>digital-music <\/strong>(Mintbase, InfiNFT, etc.)<\/li>\n<li><strong>virtual real estate <\/strong>(Cryptovoxels, Decentraland, etc.)<\/li>\n<li><strong>VR wearables<\/strong><\/li>\n<li><strong>gaming assets <\/strong>(Axie Infinity, Sorare, Gods Unchained, etc.)<\/li>\n<li><strong>Event tickets \/ Attendance receipts <\/strong><\/li>\n<li><strong>Subscription badges<\/strong><\/li>\n<li><strong>Blockchain domain names <\/strong>(Ethereum Name Service, Unstoppable Domains, etc.)<\/li>\n<li><strong>Tokenized luxury goods, eg wine<\/strong><\/li>\n<li><strong>Tokenized insurance policies <\/strong>(yEarn&#8217;s yInsure tokens, etc.)<\/li>\n<li><strong>And more!<\/strong><\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"size-large wp-image-43307\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653587571_493_How-to-Create-Collect-the-Next-Wave-of-Digital.jpg\" alt=\"rare\" width=\"770\" height=\"513\"  data-lazy-\/>Inside Rarible: The Red-Hot Ethereum NFT Marketplace<\/p>\n<h2>Creating NFTs: Start with the Files<\/h2>\n<p>If you&#8217;re interested in creating NFTs, you&#8217;ll start by getting your media in order.  NFTs can support an array of files, like visual files (JPG, PNG, GIF, etc.), music files (MP3, etc.), 3D files (GLB, etc.), and beyond. <\/p>\n<p>That said, you&#8217;ll start out creating an NFT as you would any other media file, whether it be a JPG photograph uploaded to your computer or a MP3 disk track you created using music maker software.  Once your traditional file is ready, you&#8217;ll simply take the extra step of uploading it to a mining platform in order to tokenize it as an NFT.<\/p>\n<h2>How to Mint NFTs<\/h2>\n<p>There are already an array of NFT mining platforms around the Ethereum ecosystem, and they all have their own trade-offs.<\/p>\n<p>To start, there are the do-it-yourself (DIY) mining platforms like OpenSea, Rarible, InfiNFT, Mintbase, and Cargo.  These projects let creators easily and permissionlessly mint their own NFTs, whether these assets be fine digital art, membership passes, or so forth.<\/p>\n<p>Additionally, and particularly in the digital arts arena, there are some exclusive membership-only NFT minting platforms to which creators have to apply and be accepted before they can mint through these projects.  For instance, two such projects are SuperRare and Async Art.<\/p>\n<p>Once you have your file ready and your minting platform of choice lined up, you&#8217;ll connect your Ethereum wallet of choice, upload your file (similarly to how you would on mainstream platforms like Imgur or Flickr) to your platform, and fill out the asset&#8217;s ensuing description.<\/p>\n<p>At this point in the process, you&#8217;ll be able to set whether you want to create a standalone or edition-based piece, your asset&#8217;s royalty percentage, unlockable content, and more.  Once all this is prepared, you can begin the mining process, which will require some ETH to pay for approval and mining transactions.<\/p>\n<p>Note: with Ethereum gas prices having been high in recent weeks, many NFT creators have been faced with extremely high mining costs.  To deal with this, creators can 1) wait for gas prices to acutely lower, 2) wait for layer-two scaling solutions to be more widely embraced, 3) or raise their NFT prices to compensate for gas expenses. <\/p>\n<h2>On Selling NFTs<\/h2>\n<p>Open marketplace platforms like OpenSea and Rarible make it easy to put NFTs from across the ecosystem up for sale, with the former being particularly useful for auction formats.<\/p>\n<p>To sell an NFT, you&#8217;ll connect your Ethereum wallet to your platform of choice.  If you&#8217;ve already created the NFT, you should be able to click on it and see a “Sell” prompt, which you can click and sign a transaction to complete.  If you&#8217;ve collected someone else&#8217;s NFT and want to put it up for sale, the process is similar: click on the asset and follow the “Sell” instructions, and you&#8217;ll be golden.<\/p>\n<p> <img loading=\"lazy\" class=\"size-full wp-image-43364\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653587571_710_How-to-Create-Collect-the-Next-Wave-of-Digital.jpg\" alt=\"The Opensea Marketplace\" width=\"785\" height=\"716\"  data-lazy-\/>The Opensea Marketplace<\/p>\n<h2>On Evaluating and Collecting NFTs<\/h2>\n<p>How much should you pay for an NFT, or how much should you sell one for?  There&#8217;s no right or wrong answer here, but there are key general concepts to keep in mind.<\/p>\n<p>If you&#8217;re just creative and looking to experiment, then pricings obviously don&#8217;t matter so much.  If you&#8217;re keen to secure ROI on your NFT activities, then you&#8217;ll want to be much more meticulous on what you buy or sell things for.  If this is the case, you&#8217;ll want to keep in mind:<\/p>\n<ul>\n<li>Reputation, scarcity, and provenance are key, eg 1\/1 NFTs from an acclaimed artist are more valuable than edition-based NFTs from a lesser-known creator.<\/li>\n<li>NFT projects have price floors — you can gauge these price floors using platforms like OpenSea, and you&#8217;ll want to place bids at or above this mark.<\/li>\n<li>Keep tabs on volume and transaction activity — projects that have more activity offer more profit opportunities.<\/li>\n<li>The motto “not your keys, not your crypto” is equally as true for NFTs.  That&#8217;s why it&#8217;s really important to approach collecting them with a serious focus on security.  The best practice is to store your NFTs in a hardware wallet (or across multiple wallets) that can&#8217;t be easily attacked.<\/li>\n<\/ul>\n<h2>Conclusion<\/h2>\n<p>It&#8217;s an interesting time to be around the NFT economy, as interest and opportunities in the space have never been higher.  Combine this reality with the fact that more than a few projects have recently started to experiment with NFT + DeFi melds, and it&#8217;s hard to see how NFTs don&#8217;t continue to ramp up in utility and popularity from here.<\/p>\n<p>Of course, the NFT sector is still relatively small compared to DeFi, but their promise is already empowering creators today in ways that were never possible before.<\/p>\n<p>Over time, more and more artists and innovators will surely leverage these tokens for their unique properties and in turn extend them in new ways.  Moreover, platforms beyond Ethereum will also turn further focus to NFTs as they grow in popularity.  It&#8217;s already happening today!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ethereum has been the star of the cryptoeconomy in 2020 thanks to the breakout success of the smart contract platform&#8217;s rising sectors, eg decentralized finance. Beyond DeFi, non-fungible tokens (NFTs) have given life to another one of Ethereum&#8217;s most promising, though comparatively lesser known, arenas. Notably, the supermajority of NFT activity to date has taken [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1227,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1223"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1223"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1223\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1227"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1223"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1223"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1223"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}