{"id":1247,"date":"2022-05-27T16:28:52","date_gmt":"2022-05-27T16:28:52","guid":{"rendered":"https:\/\/infobloom.site\/taking-money-from-someone-elses-account-without-their-consent-is-fraud\/"},"modified":"2022-05-27T16:28:52","modified_gmt":"2022-05-27T16:28:52","slug":"taking-money-from-someone-elses-account-without-their-consent-is-fraud","status":"publish","type":"post","link":"https:\/\/infobloom.site\/taking-money-from-someone-elses-account-without-their-consent-is-fraud\/","title":{"rendered":"Taking money from someone else&#8217;s account without their consent is fraud"},"content":{"rendered":"<p>In our personal relationships, we often share practically everything, even the secret numbers of bank accounts, but can that have consequences?<\/p>\n<p>                    26 FEB 2018 · Reading: min.<\/p>\n<p class=\"art_show_abstract\">People tend to be trusting by nature, and we tend to relax our attitude when we meet people we consider trustworthy, making them share certain private information, such as the secret number of the bank card.  This is even more common in couple relationships, in which even bank accounts are shared and, therefore, many times also cards and passbooks.  But what happens when the relationship breaks down?  There are many occasions in which the lack of precaution makes us not change the passwords and secret numbers that we had shared with our partner, this being able to put us in a vulnerable situation.<\/p>\n<p>This is the case of a man from Santander who, after divorcing his wife, did not change the PIN number of the bank card.  In some unknown way, the ex-wife got hold of the card, and taking advantage of the fact that she knew the number, she withdrew money from the account twice, 400 euros and 250, respectively.  When the ex-husband went to the bank to update the card, he discovered both extractions and was surprised that he did not know them.  In the security cameras of the bank, the lady can be seen extracting the money from the ATM.  <\/p>\n<p>Given this discovery, the injured party decided to file a complaint.  In the sentence of the case, the judge considers the facts that we have told above proven, condemning the accused for a continued crime of fraud typified in article 248 of our Penal Code, in relation to article 74, and with the penalty of a year in prison and disqualification for the right to passive suffrage during the time of the sentence.  In addition, as civil liability, it imposes the payment to the complainant of the amount of 650 euros for the damages caused, which was the total extracted by her from the bank account. <\/p>\n<p>In other words, according to our criminal laws, anyone who, with the intention of obtaining a benefit, uses enough deception to produce an error in another, getting him to perform an act of disposition that he would not otherwise perform, is committing a fraud.  In this case, the woman, with the aim of obtaining money that did not belong to her, used the passbook whose PIN she knew to deceive the ATM that gave her the money.  In addition, by doing it on two different occasions, it is considered that there is a continuation of the crime, which can aggravate the crime committed and, therefore, the penalty that would be applied to it. <\/p>\n<p>Thus, and although the defendant assured that it was her own ex-husband who asked her to withdraw that money to take it to him, neither the court of instance, nor after the appeal, the Provincial Court of Santander in its sentence 350\/2017, of October 17, they considered that this version should be upheld, given that she also invoked the right not to testify in the criminal trial held. <\/p>\n<p>Finally, we can conclude that in this case it was possible to prove that the woman took the money from the ATM using her husband&#8217;s card, thanks to the closed surveillance circuit that exists in this type of facility.  However, if instead it had been a purchase with a credit card in a commercial establishment, it would have been much more complicated to establish who made the payment, and we must not forget that on many occasions the sellers do not even request the card. we are simply the ones who insert it into the POS and enter the code for payment.  Therefore, we have no choice but to remember that we must be careful with the custody of our secret numbers and, whenever possible, not communicate them to anyone, and in the case of shared passwords with our partner, request new passwords at the moment where the relationship breaks down.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In our personal relationships, we often share practically everything, even the secret numbers of bank accounts, but can that have consequences? 26 FEB 2018 · Reading: min. People tend to be trusting by nature, and we tend to relax our attitude when we meet people we consider trustworthy, making them share certain private information, such [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1248,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1247"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1247"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1247\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1248"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1247"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1247"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1247"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}