{"id":1254,"date":"2022-05-27T19:30:08","date_gmt":"2022-05-27T19:30:08","guid":{"rendered":"https:\/\/infobloom.site\/iridium-spark-plug-a-promise-or-a-scam-%f0%9f%a4%94%f0%9f%a4%94%f0%9f%a4%94-flames-blog\/"},"modified":"2022-05-30T13:34:49","modified_gmt":"2022-05-30T13:34:49","slug":"iridium-spark-plug-a-promise-or-a-scam-%f0%9f%a4%94%f0%9f%a4%94%f0%9f%a4%94-flames-blog","status":"publish","type":"post","link":"https:\/\/infobloom.site\/iridium-spark-plug-a-promise-or-a-scam-%f0%9f%a4%94%f0%9f%a4%94%f0%9f%a4%94-flames-blog\/","title":{"rendered":"Iridium spark plug, a promise or a scam?  🤔🤔🤔"},"content":{"rendered":"<p>You enter the repair shop, with the idea of ​​putting your motorcycle &#8220;worse than new&#8221;.  You ask the seller for the best parts for your bike, and he presents you with a shiny new spark plug with a fine, elegant tip.  And even if it costs more than three times the normal price, it is a <strong>iridium Spark Plug,<\/strong> WOW!!!  You have no fucking idea what that is, but you leave the store very happy, with the firm belief that you bought the best for your bike.<\/p>\n<p>There is a general belief that an iridium spark plug is, in all cases, the best option.  Although there are also those who think that manufacturers are only devising new ways to get more money from us.  So what are the best spark plugs?  could it be the copper plug?  platinum plug?  Or will iridium plugs be the answer?<\/p>\n<p><\/p>\n<h2>Which one is the best?  copper platinum iridium<\/h2>\n<p>The answer is somewhat more complicated than just falling in love with one guy or another.  Perhaps the most correct is it depends.  From the motorcycle (or car) model, its use, the &#8220;pocket&#8221; and finally what we are looking for from that spark plug.  Thinking about that, I want to introduce you to three very important aspects for any type of motorcycle spark plug.  And based on its effectiveness at each point, choose the best.<\/p>\n<p><img loading=\"lazy\" alt=\"flames tv telegram group\" class=\"wp-image-2148 jetpack-lazy-image\" width=\"751\" height=\"422\" data-recalc-dims=\"1\" data-lazy-=\"\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/Iridium-spark-plug-a-promise-or-a-scam-Flames.png\"><\/p>\n<h3>the least resistance<\/h3>\n<p>Let&#8217;s take into account a detail, the spark plug <strong>No<\/strong> It is who is responsible for generating the spark.  It is the coil that produces the electrical charge, and the spark plug only discharges this energy, creating a voltaic arc (the spark).  Knowing this we can understand that, the less electrical resistance, the better the electrode material has.  Here I present the electrical conductivity of the three types of spark plug materials, copper, platinum and iridium.<\/p>\n<ul>\n<li>Copper Electrical conductivity 58,108<\/li>\n<li>Iridium Electrical conductivity 19.7<\/li>\n<li>Platinum Electrical conductivity 9.5<\/li>\n<\/ul>\n<p>It is necessary to clarify that in a copper spark plug, it is necessary to make an alloy with Nickel.  This to be able to withstand the harsh working conditions in the combustion chamber.  In addition, the iridium or platinum spark plug has a much finer central electrode than a conventional spark plug.  So the spark can be finer and more concentrated.  Even so, the difference with the iridium spark plug is great, and more so with the Platinum spark plug.<\/p>\n<ul class=\"blocks-gallery-grid\">\n<li class=\"blocks-gallery-item\"><img loading=\"lazy\" width=\"400\" height=\"225\" alt=\"\" data-id=\"1403\" data-full-url=\"https:\/\/i0.wp.com\/flamasblog.com\/wp-content\/uploads\/2020\/06\/bujia-para-moto.jpg?resize=400%2C225&amp;ssl=1\" data-link=\"https:\/\/flamasblog.com\/?attachment_id=1403\" class=\"wp-image-1403 jetpack-lazy-image\" data-recalc-dims=\"1\" data-lazy-=\"\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653679806_477_Iridium-spark-plug-a-promise-or-a-scam-Flames.jpg\">conventional electrode<\/li>\n<li class=\"blocks-gallery-item\"><img loading=\"lazy\" width=\"400\" height=\"225\" alt=\"bosh iridium spark plug\" data-id=\"1404\" data-full-url=\"https:\/\/i0.wp.com\/flamasblog.com\/wp-content\/uploads\/2020\/06\/bujia-bosh-iridium.jpg?resize=400%2C225&amp;ssl=1\" data-link=\"https:\/\/flamasblog.com\/?attachment_id=1404\" class=\"wp-image-1404 jetpack-lazy-image\" data-recalc-dims=\"1\" data-lazy-=\"\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653679807_633_Iridium-spark-plug-a-promise-or-a-scam-Flames.jpg\">iridium electrode<\/li>\n<\/ul>\n<h3>The longest duration<\/h3>\n<p>Copper itself is not a very strong material, which is why the alloy with nickel is used.  But when materials like platinum appeared first, and iridium later.  It reached levels of hardness and resistance, never seen before.  This is the duration table, depending on the materials used.<\/p>\n<ul>\n<li>  Iridium 45-50 thousand Km<\/li>\n<li>Platinum 15-20 thousand km<\/li>\n<li>Copper 5-8 thousand Km<\/li>\n<\/ul>\n<p>These data are valid, only in the different classes of spark plugs for motorcycles.  Since its demand is always greater than in cars.  In the case of cars, the duration can be doubled.<\/p>\n<p><img loading=\"lazy\" width=\"400\" height=\"273\" alt=\"ngk iridium spark plugs\" class=\"wp-image-1410 jetpack-lazy-image\" data-recalc-dims=\"1\" data-lazy-=\"\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653679807_373_Iridium-spark-plug-a-promise-or-a-scam-Flames.jpg\"><\/p>\n<h3>The price<\/h3>\n<p>The money yes, always the dirty money.  It does not give happiness, but as a help!  and it is always important to be careful with unnecessary expenses.  This is why spending too much on spark plugs is never a good idea.  And it is that a conventional spark plug is around $80-$200 Mexican pesos.  The platinum one between $200-$700.  But an iridium one can go up to $1000.  imagine a 4-cylinder sports car!  😮<\/p>\n<h2>But what is the best spark plug for a 4-stroke motorcycle?<\/h2>\n<p>Oh again, it depends.  And the correct question would be what spark plug to use in X moto?  Because the key is there, in the motorcycle in which it will be placed, this or that spark plug.  A work bike is not the same as a super sports bike with all its RRs.  So let&#8217;s look at each case.<\/p>\n<h3>Work motorcycle, best copper spark plug.<\/h3>\n<p><img loading=\"lazy\" width=\"500\" height=\"333\" alt=\"honda cargo 150\" class=\"wp-image-1401 jetpack-lazy-image\" data-recalc-dims=\"1\" data-lazy-=\"\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653679808_624_Iridium-spark-plug-a-promise-or-a-scam-Flames.jpg\"><\/p>\n<p>This type of motorcycle is designed to be economical and profitable.  This is why it is not normal to find high-performance parts.  Generally the coil will not be &#8220;so&#8221; capable of working with an iridium spark plug.  It could even present failures or poor performance, not in all cases, but it does happen.  But the most important detail is that, generally, this type of motorcycle has a fairly exposed spark plug.  You can stand to one side, reach out and already be able to touch the spark plug cap.  As a result, the ceramic insulator will receive all inclement weather.  Rain, dust, stones, oil, even dog bites&#8230; will be the daily bread.  What will cause the central electrode to last for many kilometers.  The insulation will not exceed about 10 thousand km.<\/p>\n<p>If an iridium spark plug, in a work motorcycle, will not last more than 10 thousand km due to the effort of the insulator (that is, if it works correctly).  In addition to how easy it is to change, every time they swell, the spark plug in a two by three.  But the considerable difference in price.  I think the most appropriate would be to continue with a simple copper spark plug.  That if, a good brand, the right grade and well calibrated.<\/p>\n<h3>Sport motorcycle best iridium spark plug.<\/h3>\n<p><img loading=\"lazy\" alt=\"sport motorcycle\" class=\"wp-image-1402 jetpack-lazy-image\" width=\"536\" height=\"379\" data-recalc-dims=\"1\" data-lazy-=\"\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653679808_991_Iridium-spark-plug-a-promise-or-a-scam-Flames.jpg\"><\/p>\n<p>And I&#8217;m not necessarily talking about large displacement or premium brands.  More &#8220;modest&#8221; models of only 250cc, even smaller, may already require an iridium spark plug from the factory.  These bikes do have a coil, capable of creating larger electrical voltages.  Therefore, a somewhat higher resistance between electrodes will not be a problem.  But the &#8220;heart&#8221; of the matter is not fuel efficiency, much less power to the wheel.  The big reason, to use spark plugs with such a long life, is as mundane as it is logical. <strong>It&#8217;s a fart, having to disassemble half a motorcycle, to change the spark plugs.<\/strong> Side fairings, fuel tank, disconnect the fuel pump, remove the air filter box&#8230; and see what else gets in the way. UFFF!<\/p>\n<p>Seeing it like this, they no longer seem so expensive to us, right?  If we are going to lose half a day (already with some callus) every time we have to change the spark plug.  Well, it better be every couple of years, and not every couple of months.  As simple as that.<\/p>\n<p><iframe title=\"🤔Porque las &quot;Bujías de Iridio&quot; NO son (mejores) que las 🅲🅾🅼🆄🅽🅴🆂¿es la mejor bujía para tu Moto???\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/FJrNxfWkKK0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n<h2>And to all this, where were the platinum spark plugs?<\/h2>\n<p>Platinum plugs are halfway between the previous two.  They are cheaper than iridium, but more expensive than copper.  They last longer than copper, but less than iridium.  Its weak point is its electrical resistance, superior to the other two.  This is why they are used less and less.<\/p>\n<p>The end result is so bland that I&#8217;m embarrassed to say it, but that was to be expected.  The answer to the question, what kind of spark plug do I put on my motorcycle?  it is <strong>what the manufacturer says&#8230;<\/strong> I know, it&#8217;s nothing exciting, but it&#8217;s just the net.  😜<\/p>\n<p>the flames<\/p>\n<p>..<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You enter the repair shop, with the idea of ​​putting your motorcycle &#8220;worse than new&#8221;. You ask the seller for the best parts for your bike, and he presents you with a shiny new spark plug with a fine, elegant tip. And even if it costs more than three times the normal price, it is [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1262,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1254"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1254"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1254\/revisions"}],"predecessor-version":[{"id":1642,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1254\/revisions\/1642"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1262"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1254"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1254"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1254"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}