{"id":1263,"date":"2022-05-27T21:38:44","date_gmt":"2022-05-27T21:38:44","guid":{"rendered":"https:\/\/infobloom.site\/5-signs-to-know-if-cheap-travel-is-a-fraud\/"},"modified":"2022-05-27T21:38:44","modified_gmt":"2022-05-27T21:38:44","slug":"5-signs-to-know-if-cheap-travel-is-a-fraud","status":"publish","type":"post","link":"https:\/\/infobloom.site\/5-signs-to-know-if-cheap-travel-is-a-fraud\/","title":{"rendered":"5 signs to know if cheap travel is a fraud"},"content":{"rendered":"<p>Two round tickets to Europe, two to Canada, two to the United States and two to any national destination for 38,000 pesos.  This was one of the promotions that captivated hundreds of WhatsApp users, who today claim to be victims of fraud and demand reimbursement of their investment.<\/p>\n<p>For Rubén Mora, Corporate Commercial and New Business Director of the Mundo Joven travel agency, the dynamics of viralizing promotions through Whatsapp is highly questionable, since nothing guarantees the validity of the offers.  In addition, he indicates that it is easy to get cheaper rates than those offered in these messages, so he does not understand the interest in these promotions.<\/p>\n<p>“The problem is that there is no regulation on the subject of rates and each agency puts its promotion.  For this reason, the consumer should check the prices before making the purchase and avoid falling into a fraud, ”he says.<\/p>\n<p><i>  Read more: This is how the Aeroméxico ticket sales fraud was committed by WhatsApp  <\/i><\/p>\n<p>Given this situation, the Mundo Joven agency, the Federal Consumer Protection Office (Profeco) and Aeroméxico, the airline that supposedly offered the trips, offer a series of recommendations to avoid falling into false promotions:<\/p>\n<p><b>1. Look for the support of a company.<\/b> Travel agencies spread promotions through their official channels.  Make sure you are on the correct website before purchasing a tour package. <\/p>\n<p><i>  Read more: Aeroméxico alerts WhatsApp ticket sales fraud  <\/i><\/p>\n<p><b>2. Trust certified sellers. <\/b>That friends, family or close acquaintances have had a great travel experience, does not mean that you will go through the same.  Approach merchants who work for an agency, they will provide you with true information. <\/p>\n<p><b>3. Contact suppliers. <\/b>If the offer includes transportation with a specific airline or lodging with certain hotels, experts recommend calling those companies to make sure the promotions are valid.<\/p>\n<p><b>4. Use online payment methods. <\/b>Be wary of those travel agencies that ask you to make payments in cash or to personal accounts.  Experts recommend paying for a service through electronic transfers, bank deposits or Paypal accounts, since these means offer a record of the operation. <\/p>\n<p><b>5. Demand invoices and contracts. <\/b>When requesting a service, the seller has the obligation -according to the Official Mexican Standard NOM-010-TUR-2001- to give you a copy of the contract that establishes the terms and conditions of the commercial exchange and an invoice that guarantees the payment that you did<\/p>\n<p>&#8220;The documents must contain the stamp or letterhead of the agency, name or business name, description of the services that are acquired, total amount to be paid and the causes of cancellation,&#8221; cites a document from Profeco.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Two round tickets to Europe, two to Canada, two to the United States and two to any national destination for 38,000 pesos. This was one of the promotions that captivated hundreds of WhatsApp users, who today claim to be victims of fraud and demand reimbursement of their investment. For Rubén Mora, Corporate Commercial and New [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1264,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1263"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1263"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1263\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1264"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1263"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1263"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1263"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}