{"id":1271,"date":"2022-05-28T08:24:31","date_gmt":"2022-05-28T08:24:31","guid":{"rendered":"https:\/\/infobloom.site\/shirtum-partners-with-entourage-to-take-sports-nfts-and-the-metaverse-to-the-next-level\/"},"modified":"2022-05-28T08:24:31","modified_gmt":"2022-05-28T08:24:31","slug":"shirtum-partners-with-entourage-to-take-sports-nfts-and-the-metaverse-to-the-next-level","status":"publish","type":"post","link":"https:\/\/infobloom.site\/shirtum-partners-with-entourage-to-take-sports-nfts-and-the-metaverse-to-the-next-level\/","title":{"rendered":"Shirtum partners with Entourage to take sports NFTs and the Metaverse to the next level"},"content":{"rendered":"<p data-gtm-element-container=\"modulo-texto-link\" class=\"paragraph\"><strong>Shirtum<\/strong>a leading sports NFT and Metaverse ecosystem, is joining forces with Entourage Global, an award-winning marketing and business agency, to bring top sports talent and clubs to the NFT and Metaverse space.<\/p>\n<p data-gtm-element-container=\"modulo-texto-link\" class=\"paragraph\">This partnership is a strong statement of intent for both companies, as the Metaverse and NFTs continue to revolutionize the sports industry.  In addition to securing top talent for the Shirtum ecosystem, Entourage will invest directly in Shirtum and its token ($SHI), as proof of the huge potential the company envisions in the platform that plays a key role in connecting top sports talent. and his fans.<\/p>\n<p data-gtm-element-container=\"modulo-texto-link\" class=\"paragraph\"><strong>Shirtum is building a C2E ecosystem<\/strong> (Collect to Experience) for the sports industry, where fans connect with athletes and clubs by owning and exchanging exclusive NFTs to participate in both offline experiences and immersive metaverse events.  These NFTs also provide access to exclusive video content and digital art around key moments from these athletes and clubs.<\/p>\n<p data-gtm-element-container=\"modulo-texto-link\" class=\"paragraph\"><strong>The company has signed agreements<\/strong> with great talents like the world superstar <strong>Ronaldinho Javier Saviola<\/strong>the recent winner of the Copa América <strong>papu gomez<\/strong> or the Champions League winner and World Cup finalist <strong>Ivan Rakitic<\/strong>, as well as with clubs like the Turkish Galatasaray and the Argentine San Lorenzo.  Having launched its NFT marketplace in 2021, Shirtum is now planning an aggressive move into the Metaverse in 2022.<\/p>\n<p data-gtm-element-container=\"modulo-texto-link\" class=\"paragraph\"><strong>Global Entourage<\/strong> is widely recognized as <strong>one of the leading sports agencies at the forefront of the Metaverse and Crypto industry<\/strong>.  This year alone, the agency has worked with FTX on its journey to Formula 1, Socios.com on a multitude of partnerships, including the front of the jersey partnership with Inter Milan, the Usain Bolt partnership and Avatrade , along with numerous NFT drops for legendary athletes like Roberto Carlos, David Trezeguet, Giorgio Chiellini, and Gianluigi Buffon, to name just a few.<\/p>\n<p data-gtm-element-container=\"modulo-texto-link\" class=\"paragraph\">This partnership is intended to drive exponential growth and accelerate Shirtum&#8217;s expansion into the sports industry.  The Entourage team will advise on public relations and marketing strategy, along with the development of a strategic plan and an effective business model to achieve growth and positive return on investment through partnerships with clubs, leagues, federations and athletes. .<\/p>\n<p data-gtm-element-container=\"modulo-texto-link\" class=\"paragraph\"><strong>David Rosencwaig<\/strong>CEO of Shirtum, commented: “We are very pleased to welcome a market-leading global agency like Entourage to our family. It is a great honor to have them on board our project, not only as partners but also as investors. This seal of approval is incredibly important to us and represents a defining moment for the future development of the Shirtum project. Knowing what Entourage has to offer, this statement will be the first of many incredible announcements we have lined up and over the next few weeks we are planning a schedule. of events that will make Shirtum one of the world&#8217;s biggest players in the Metaverse and NFT for the sports and entertainment industry.&#8221;<\/p>\n<p data-gtm-element-container=\"modulo-texto-link\" class=\"paragraph\">Mark Cowan, CEO of Entourage Global, commented: &#8220;We have chosen to partner with Shirtum because we believe their project represents a true revolution as the world of sports plunges into the Metaverse. We are confident that their innovative NFT video content and The Metaverse environment they are developing has the potential to be one of the leading projects in the sports industry. Shirtum will change the perspective and relationships of fans around the world with their favorite clubs and athletes. We are delighted to join people like Alejandro &#8220;Papu&#8221; Gómez, Ivan Rakitic and Nico Pareja as investors in Shirtum and we are excited to share this journey.&#8221;<\/p>\n<p data-gtm-element-container=\"modulo-texto-link\" class=\"paragraph\">Shirtum, a sports marketplace that connects fans with world-class athletes and clubs through unique first-person stories in the form of NFTs.  These digital assets offer the possibility of living exclusive experiences both offline and in the metaverse.  The Shirtum ecosystem revolves around its SHI token, which enables numerous benefits, discounts, and rewards.<\/p>\n<p data-gtm-element-container=\"modulo-texto-link\" class=\"paragraph\">Entourage Global is one of the UK&#8217;s leading association agencies, specializing in commercial sponsorship, talent representation and association management.  Entourage represents a wide range of world-renowned personalities from the worlds of sports, media and entertainment, and has played a crucial role in some of the most prominent sports sponsorships to date.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Shirtuma leading sports NFT and Metaverse ecosystem, is joining forces with Entourage Global, an award-winning marketing and business agency, to bring top sports talent and clubs to the NFT and Metaverse space. This partnership is a strong statement of intent for both companies, as the Metaverse and NFTs continue to revolutionize the sports industry. In [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1272,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1271"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1271"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1271\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1272"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1271"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1271"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1271"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}