{"id":1308,"date":"2022-05-28T17:39:54","date_gmt":"2022-05-28T17:39:54","guid":{"rendered":"https:\/\/infobloom.site\/they-buy-their-own-nfts-to-inflate-the-price\/"},"modified":"2022-05-28T17:39:54","modified_gmt":"2022-05-28T17:39:54","slug":"they-buy-their-own-nfts-to-inflate-the-price","status":"publish","type":"post","link":"https:\/\/infobloom.site\/they-buy-their-own-nfts-to-inflate-the-price\/","title":{"rendered":"They buy their own NFTs to inflate the price"},"content":{"rendered":"<p>If you like investments in cryptocurrencies then be very careful, since some <strong>sellers buy their own NFTs to inflate the price<\/strong>.  You could be the victim of an intentional inflationary bubble in which sellers of these digital assets use these means for money laundering and then there could be some unwary in the middle of a crooked operation.<\/p>\n<p>These operations seem to be increasing, <strong>the seller is on both sides of the transaction, thus altering what would be the value and liquidity of a digital asset,<\/strong> in this case an NFT.  The main problem is that these operations are much more difficult to determine and locate, since being carried out in cryptocurrency, the operation does not admit additional looks and there is no way to confirm what happens.<\/p>\n<p>Best Free VPNs<\/p>\n<p>However, the suspicions are there and the numbers are talking about it.  A security consultant was able to track<strong> $200 million worth of cryptocurrency trades sent to ERC-721 and ERC-1155 contracts, linked directly to Ethereum<\/strong>all during 2021. In the same period of 2020, the value of these operations barely exceeded 100 million dollars, that is, almost half.<\/p>\n<p>  How to know the price of Ethereum  <\/p>\n<h2>Washing through NFT<\/h2>\n<p> <\/p>\n<p> <strong>Wash trading has been becoming a concern with the cryptocurrency exchange<\/strong> who try to make their trading volumes appear larger than they really are.  Particularly, in the world of cryptocurrencies, the objective of these operations is to considerably inflate the price, generating an unreal market on the value of the asset.<\/p>\n<p>As a final step,<strong> after generating the inflation process, those assets are taken to wallets<\/strong> that handle the same values ​​and thus incorporate an asset that is the product of an illicit operation with this higher price in the market.<\/p>\n<p> <strong>In the case of the NFT, it is very close to how things happen with the world of buying and selling art.<\/strong>.  Many works have a subjective value based on the importance they may have in their own market and this is what makes their value rise, mostly in auction processes;  something similar is beginning to be seen with NFTs, which are then sold and are an easy way to launder money.<\/p>\n<p>An analysis published by the National Law Review in 2019 points out that works of art such as paintings are easy to move, have relatively subjective prices and can offer certain tax advantages, it is the same as what happens with NFTs and even better, since they do not having controls on operations and not physically existing, so there is no need to move a physical part.<\/p>\n<p>However there are some clear indications of what is happening in this market.<strong> Research has shown that there are some addresses for operations that were self-financed<\/strong>, that is to say, that the money of the transaction also comes from the same address that executes the sale.  This allows washing on a large scale and also increases the value of any NFT to the desired point.<\/p>\n<p> <strong>Little can be done, since legally the NFT trade is in a kind of limbo.<\/strong> Money laundering is a financial offense and it is prohibited on conventional securities and futures, but there is no regulation of its own for this market within the international arena, as it is a decentralized system.<\/p>\n<p> <strong>Value sent to NFT markets by illicit addresses increased significantly in Q3 2021<\/strong>, surpassing the value of a million dollars in cryptocurrencies.  This figure grew again in the fourth quarter, topping just under $1.4 million.  In both quarters, the vast majority of this activity came from addresses associated with scams sending funds to NFT markets to make purchases.<\/p>\n<p>Both quarters also saw considerable amounts of stolen funds sent to the markets.  Perhaps most alarming is that, <strong>in Q4 2021, $284k in cryptocurrency was determined to have been sent to NFT markets from addresses at risk of sanctions<\/strong>according to the OFAC SDN list in 2021.<\/p>\n<p>The truth is that the trade of <strong>laundering in NFTs can create an unfair market for those who buy artificially inflated tokens<\/strong>and its existence can eliminate trust within the ecosystem of the different blockchains, which would end up causing this market to explode.<\/p>\n<p>Although the blockchains do not give information about the holders or owners and about the transactions, it is possible to determine the volume and <strong>it is what can generate suspicions about a process of inflating cryptocurrencies and money laundering through NFTs.<\/strong> <\/p>\n<p>  Brave: get free cryptocurrencies for using this browser  <\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you like investments in cryptocurrencies then be very careful, since some sellers buy their own NFTs to inflate the price. You could be the victim of an intentional inflationary bubble in which sellers of these digital assets use these means for money laundering and then there could be some unwary in the middle of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1310,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1308"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1308"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1308\/revisions"}],"predecessor-version":[{"id":1633,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1308\/revisions\/1633"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1310"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1308"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1308"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1308"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}