{"id":1313,"date":"2022-05-28T18:42:30","date_gmt":"2022-05-28T18:42:30","guid":{"rendered":"https:\/\/infobloom.site\/recognize-and-avoid-phishing-messages-bogus-tech-support-calls-and-other-scams\/"},"modified":"2022-05-30T13:33:26","modified_gmt":"2022-05-30T13:33:26","slug":"recognize-and-avoid-phishing-messages-bogus-tech-support-calls-and-other-scams","status":"publish","type":"post","link":"https:\/\/infobloom.site\/recognize-and-avoid-phishing-messages-bogus-tech-support-calls-and-other-scams\/","title":{"rendered":"Recognize and avoid phishing messages, bogus tech support calls, and other scams"},"content":{"rendered":"<p>Use these tips to avoid scams and learn what to do if you receive suspicious emails, phone calls, or other messages.<\/p>\n<p>If you receive a suspicious email or SMS text message that appears to be from Apple, send it to reportphishing@apple.com.1<\/p>\n<p>Phishing is a fraudulent way of obtaining personal information, usually via email. However, scammers use any means they can to trick you into sharing information or giving them money, including:<\/p>\n<ul>\n<li>Fraudulent emails and other messages that appear to be from legitimate companies, such as Apple<\/li>\n<li>Deceptive pop-ups and ads claiming your device has a security issue<\/li>\n<li>Fraudulent phone calls or voice messages from people posing as Apple Support employees<\/li>\n<li>Fake promotions offering free prizes and products<\/li>\n<li>Unwanted events and calendars<\/li>\n<\/ul>\n<p>If you suspect an unexpected message, call, or request for personal information or money, it&#8217;s most likely a scam. If necessary, contact that company directly. If you think your Apple device has a security issue, you can get help from Apple.<\/p>\n<p><br \/>\nIf you think your Apple ID has been compromised, or if you may have entered your password or other personal information on a fraudulent website, change your Apple ID password immediately.<\/p>\n<h2>How to protect your account and Apple devices<\/h2>\n<p>Here are some tips to avoid scams targeting your Apple account and devices.<\/p>\n<ul>\n<li>Never share personal information, such as credit card numbers, unless you can verify that the recipient is who they claim to be.<\/li>\n<li>Protect your Apple ID. Use two-factor authentication, always keep your contact information secure and up-to-date, and never share your Apple ID password or verification codes with anyone. Apple never asks for this information to provide technical support.<\/li>\n<li>Never use Apple Gift Cards to make other types of payments.<\/li>\n<li>Learn how to identify legitimate emails from Apple about App Store or iTunes Store purchases. If you send or receive money with Apple Pay (US only), treat it like any other private transaction.<\/li>\n<li>Learn how to protect Apple devices and data.<\/li>\n<li>Download software only from trusted sources.<\/li>\n<li>Don&#8217;t click on links or open or save attachments from suspicious or unsolicited messages.<\/li>\n<\/ul>\n<h2>How to report suspicious emails, calls and messages<\/h2>\n<ul>\n<li>If you receive a suspicious email that appears to be from Apple, forward it to reportphishing@apple.com.1<\/li>\n<li>To report a suspicious SMS text message that appears to be from Apple, take a screenshot of the message and send it to reportphishing@apple.com.<\/li>\n<li>To report spam or other suspicious emails you receive in your iCloud.com, me.com, or mac.com inbox, send them to abuse@icloud.com.<\/li>\n<li>To report spam or other suspicious messages you receive through Messages, tap Report Spam below the message. You can also block unwanted calls and messages.<\/li>\n<li>Report fraudulent phone calls to the Federal Trade Commission (US only) at reportfraud.ftc.gov or to your local police department.<\/li>\n<\/ul>\n<h2>Learn more about phishing and other scams<\/h2>\n<p>Learn how to identify phishing messages, respond to scam phone calls, and avoid other online scams.<\/p>\n<h3 id=\"mail\">How to identify fraudulent emails and messages<\/h3>\n<p>Scammers try to copy emails and text messages from legitimate companies to trick you into giving up personal information and passwords. These signs can help you identify phishing emails:<\/p>\n<ul>\n<li>The sender&#8217;s email address or phone number does not match the name of the company they are claimed to come from.<\/li>\n<li>The email or phone they used to contact you is different from the one you provided to that company.<\/li>\n<li>A link in a message appears to be correct, but the URL does not match the company&#8217;s website.2<\/li>\n<li>The message looks very different from other messages you received from the company.<\/li>\n<li>The message requests personal information, such as a credit card number or account password.<\/li>\n<li>It is an unsolicited message and contains an attachment.<\/li>\n<\/ul>\n<h3 id=\"call\">If you receive a suspicious phone call or voicemail message<\/h3>\n<p>Scammers use fake phone numbers from companies like Apple and often claim there is suspicious activity on your account or device to get your attention. Or they may use flattery or threats to pressure you into giving them information, money, and even Apple gift cards.<\/p>\n<p>If you get an unsolicited or suspicious phone call from someone claiming to be an Apple employee or Apple Support, just hang up.<\/p>\n<p>You can report fraudulent phone calls to the Federal Trade Commission (US only) at reportfraud.ftc.gov or to your local police department.<\/p>\n<h3 id=\"cal\">If you see suspicious Calendar events<\/h3>\n<h3 id=\"pop\">If annoying pop-ups appear in the web browser<\/h3>\n<p>If, while browsing the Internet, you see a pop-up or alert offering you a free prize or warning you of security issues or viruses on your device, don&#8217;t believe it. These types of pop-ups are often scam advertisements, designed to trick you into downloading harmful software or giving the scammer personal information or money.<\/p>\n<p>Do not call the number or click on the links to claim the prize or fix the problem. Ignore the message and simply exit the page, or close the window or tab.<\/p>\n<h3 id=\"download\">If you are prompted to download software<\/h3>\n<p>You should be extremely careful if you download content from the Internet. Some downloads found on the Internet may not have the software they claim to have, or the software they contain may not be what you expected or wanted. This includes apps that ask to install configuration profiles that can then control your device. If installed, unknown or unwanted software can become intrusive and annoying, and could even harm your Mac and steal your data.<\/p>\n<p>To avoid getting unwanted, fake, or malicious software, install the software from the App Store or get it directly from the developer&#8217;s website. Learn how to safely open software on your Mac or remove unwanted configuration profiles on your iPhone, iPad, or iPod touch.<\/p>\n<p>1. To report an SMS text message, take a screenshot of the message and send it via email. If you&#8217;re forwarding a message from Mail on Mac, include the header information by selecting the message and choosing Forward as Attachment from the Message menu.<\/p>\n<p>2. To confirm the destination of a link on Mac, hover over the link to see the URL. If you can&#8217;t see the URL in the status bar in Safari, choose View &gt; Show Status Bar. If you have an iOS device, long press the link.<\/p>\n<p>Information about products not manufactured by Apple or on independent websites not controlled or tested by Apple is provided without recommendation or endorsement. Apple assumes no responsibility with respect to the selection, performance, or use of third-party websites or products. Apple makes no representations about the accuracy or reliability of third-party websites. Contact the provider for more information.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Use these tips to avoid scams and learn what to do if you receive suspicious emails, phone calls, or other messages. If you receive a suspicious email or SMS text message that appears to be from Apple, send it to reportphishing@apple.com.1 Phishing is a fraudulent way of obtaining personal information, usually via email. However, scammers [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1314,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1313"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1313"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1313\/revisions"}],"predecessor-version":[{"id":1629,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1313\/revisions\/1629"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1314"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1313"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1313"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1313"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}