{"id":1315,"date":"2022-05-28T19:14:41","date_gmt":"2022-05-28T19:14:41","guid":{"rendered":"https:\/\/infobloom.site\/scamming-foreign-investors-avoid-hot-u-s-stocks-from-ruining-you-microcap-stock-a-guide-for-investors\/"},"modified":"2022-05-30T13:33:18","modified_gmt":"2022-05-30T13:33:18","slug":"scamming-foreign-investors-avoid-hot-u-s-stocks-from-ruining-you-microcap-stock-a-guide-for-investors","status":"publish","type":"post","link":"https:\/\/infobloom.site\/scamming-foreign-investors-avoid-hot-u-s-stocks-from-ruining-you-microcap-stock-a-guide-for-investors\/","title":{"rendered":"Scamming Foreign Investors: Avoid &#8220;Hot&#8221; U.S. Stocks from Ruining You (Microcap Stock: A Guide for Investors)"},"content":{"rendered":"<p> <img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653765281_617_Scamming-Foreign-Investors-Avoid-Hot-US-Stocks-from-Ruining-You.gif\" alt=\"\" width=\"132\" height=\"34\" border=\"0\" \/><\/p>\n<p>We advise all investors to thoroughly investigate any investment opportunity and the person promoting it. <i>before <\/i>to part with your money, especially if you are not a US investor and looking to invest in US stocks. This is particularly important if you learned about the investment online or were told about it over the phone by an unknown broker.<\/p>\n<p>The recent globalization of the world&#8217;s financial markets and the strength of the US stock markets have created a strong demand for US stocks by foreign investors. In turn, however, this appetite for action has spawned new types of fraud. Here&#8217;s how some scams work, tips on how to avoid them, and where to find help.<\/p>\n<h2>How are the frauds<\/h2>\n<p>Investors from around the world who buy &#8220;micro-cap&#8221; stocks (thinly traded, inexpensive stocks issued by America&#8217;s smallest companies) are the target of many of the recent frauds. stocks drop, scammers swoop in falsely claiming they can help investors recoup their losses — in exchange for a hefty fee disguised as some kind of tax, deposit, or refundable insurance bond Here&#8217;s how some of the schemes work more common:<\/p>\n<ul>\n<li><b>aggressive sales <\/b>-Dishonest brokers buy large blocks of stock from US issuers at deep discounts. They then use persuasive sales tactics by pressuring non-US investors to buy shares at extremely high prices. Once brokers finish selling shares, prices typically collapse leaving investors vulnerable to significant losses.<\/li>\n<li><b>absent stockbrokers<\/b> — For many investors this is the end of fraud. When they try to contact the individuals who sold them the worthless stock, they discover that the agents have disappeared.<\/li>\n<li><b>Advance fee schedules<\/b> — For other investors, the fraud does not end there, but rather takes a new direction. Fraudsters posing as legitimate U.S. brokers or companies offer to help investors recoup their losses by trading their undervalued stock for a more capitalized and liquid stock (called a &#8220;blue chip&#8221;) or by buying the stock. completely. But investors must pay a &#8220;security deposit&#8221; up front or post &#8220;insurance&#8221; or &#8220;payment guarantee.&#8221;<\/li>\n<li><b>More money requests<\/b> — As long as an investor is willing to pay, scammers will keep asking for more money—falsely claiming that such payments will cover additional fees and taxes, guarantees for courier service, and other similar expenses.<\/li>\n<\/ul>\n<h2>How to avoid being scammed<\/h2>\n<p>The best way to protect yourself against investment fraud is to ask tough questions about the opportunity and the people promoting it.<i>before <\/i>to invest. For example, you will want to know:<\/p>\n<ul>\n<li><b>Are the broker and company licensed? <\/b>Contact your securities regulator to find out. The International Organization of Securities Commissioners (IOSCO) provides contact information for most regulatory bodies on its website. Be sure to ask if the broker or company has a history of complaints. If the individual claims to work with a US brokerage firm, call FINRA&#8217;s toll-free public disclosure line at (800) 289-9999, or visit the website.<\/li>\n<li><b>Is the investment registered with the SEC?<\/b> Search the EDGAR database. However, always remember that the fact that a company has registered its securities or has filed reports with the SEC does not guarantee that the company will be a good investment. In the same way, the fact that a company has not registered its securities with us or has not filed reports does not mean that it is a fraud.<\/li>\n<li><b> Where are shares listed?<\/b> Many frauds involve micro-cap companies whose shares are traded on the &#8220;pink supplement&#8221; or on the OTC Bulletin Board. These companies generally do not meet the minimum listing requirements to trade on a national exchange, such as the New York Stock Exchange or the Nasdaq Stock Market. And companies listed on the pink supplement generally do not file audited financial statements or reports with the SEC. It can be very difficult for investors to find reliable and unbiased information about micro-cap companies. For that reason, micro-cap stocks can be among the riskiest investments.<\/li>\n<li><b>What is the price of a stock in the United States? <\/b>Before buying any US stock, be sure to independently confirm its current US trading price. Rogue agents can charge you a much higher price, assuming you&#8217;ll never check it out. The Nasdaq website displays current quotes for stocks listed on the New York Stock Exchange, the American Stock Exchange, and the Nasdaq Stock Market, and stocks traded on the OTC Bulletin Board. .<\/li>\n<li><b>How can I research the opportunity independently?<\/b> Always ask to see—and carefully read—written information about the company, including the prospectus and recent financial statements. But also research the company on your own. For tips on how to do this, please read the online publication How to Get Business Information.<\/li>\n<\/ul>\n<p>These additional tips can help you avoid unscrupulous agents:<\/p>\n<ul>\n<li><b>Look beyond the name<\/b> — Some scammers illegally use names of legitimate brokerage firms and brokers. Be sure to compare any address a broker gives you to one given to you by your securities regulator or FINRA. If it&#8217;s not the same, you may be dealing with a scammer.<br \/>\n<b>Check references on your own<\/b> — Never rely solely on referrals from a broker you&#8217;ve never dealt with before. The &#8220;satisfied customers&#8221; or &#8220;international organizations&#8221; it suggests you contact may also be part of the fraud.<\/li>\n<li><b>Be wary of unusual banking instructions<\/b> — The most reputable brokerage firms in the United States use US banks, and for example, they would not ask you to transfer your money to a non-US bank so that you have better credit.<\/li>\n<\/ul>\n<p>For more advice, please read our online brochure Ask Questions and Micro Cap Stocks: A Guide for Investors.<\/p>\n<h2>Where to go for help<\/h2>\n<p>If a US broker-dealer appears to be involved in the case, please submit your complaint in writing to the SEC using our online complaint form. Don&#8217;t forget to mention as many details as you can including the names, addresses and phone or fax numbers, and email addresses or web pages of any person or company and the dates of each contact.<\/p>\n<p>Since many investment frauds occur entirely outside of the United States, the SEC may not have jurisdiction to investigate and prosecute wrongdoers — even if the fraud involved stock issued by a US company. If you encounter problems, contact the securities regulator in your country and in the country where the broker or collection room operator does business. You can also visit the University of Toledo School of Law website to find links to many foreign regulatory agencies including those that regulate its securities, banking, and insurance industries.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We advise all investors to thoroughly investigate any investment opportunity and the person promoting it. before to part with your money, especially if you are not a US investor and looking to invest in US stocks. This is particularly important if you learned about the investment online or were told about it over the phone [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1316,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1315"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1315"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1315\/revisions"}],"predecessor-version":[{"id":1628,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1315\/revisions\/1628"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1316"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1315"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1315"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1315"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}