{"id":1389,"date":"2022-05-29T01:41:51","date_gmt":"2022-05-29T01:41:51","guid":{"rendered":"https:\/\/infobloom.site\/art-and-market-advances-how-fauve-paris-held-the-first-nft-auction-in-france-and-alcala-auctions-first-time-including-nfts\/"},"modified":"2022-05-30T13:37:44","modified_gmt":"2022-05-30T13:37:44","slug":"art-and-market-advances-how-fauve-paris-held-the-first-nft-auction-in-france-and-alcala-auctions-first-time-including-nfts","status":"publish","type":"post","link":"https:\/\/infobloom.site\/art-and-market-advances-how-fauve-paris-held-the-first-nft-auction-in-france-and-alcala-auctions-first-time-including-nfts\/","title":{"rendered":"Art and Market Advances: How Fauve Paris held the first NFT auction in France and Alcalá Auctions&#8217; first time including NFTs"},"content":{"rendered":"<h2 class=\"entry_title\">15 Mar Art and Market Advances: How Fauve Paris held the first NFT auction in France and Alcalá Auctions&#8217; first time including NFTs<\/h2>\n<p>In Spain, few or none of the media have echoed the <strong>first sale of NFTS made at a public auction in France<\/strong>. While Alcalá Subastas offers NFT works in its catalog for the first time, and Durán Arte y Subastas continues to bet on this art month after month, in France no one had yet taken the step. Until now.<\/p>\n<p><strong>fauve paris<\/strong> wanted to auction NFTs but French law forbids the sale of intangibles at French public auctions, and therefore his first attempt was banned. But Fauve Paris did not sit idly by, and finally, The Burnt Auction with 44 NFTS offered in public auction could take place. How? With a little trick.<\/p>\n<p>After getting around some legal problems, auctioning “digital” works is not legal in the strict French auction code, the auction house Fauve Paris, carried out the first face-to-face auction of NFTs in France, thanks to the motivation of its director and founder, Lucie-Eleonore Riveron. The auction was held on March 10, 2022, and its name Burnt Auction (literally &#8220;burnt auction&#8221;) came from the undesirable situation that they found with the authorities: the obligation to auction something physical in French auctions. Lucie decided to get around the law by offering for each NFT &#8220;a paper printout of the NFT information.&#8221; In a symbolic act of rebellion against the ban, which delayed the sale for a few days, Lucie performed a performance burning the paper impressions, watch the video&#8230;<\/p>\n<p>Going into the details of the sale and, according to a note provided by the management of Fauve Paris, 44 NFT works were offered, of which two thirds were sold. In addition, &#8220;the night became a political act, and the participating artists entered the history of art by being the first crypto-artists to participate in a public art auction in France.&#8221; &#8220;Here and Elsewhere&#8221; (2022) by the British artist, Brendan Dawes, was the top lot of the night, awarded for 26,796 euros.<\/p>\n<p>Below you have two videos of the 2 most expensive NFTs sold in such a historic night. We will keep reporting.<\/p>\n<h2 class=\"single-lot__title\" style=\"text-align: center;\">Alcalá Subastas, first NFT experience<\/h2>\n<p>One of our most recognized and prestigious auction rooms, Alcalá Subastas, bets for the first time on digital art and NFTs, it does so hand in hand with several artists already recognized in the crypto art scene such as Gala Mirissa or Bit Error, with a internationally consolidated market, and other emerging markets such as Adrián Balastegui, Pol Escarrer or Maria Emegé.<br \/>\n<br style=\"clear: both;\" \/><\/p>\n<p><strong>Gala Mirissa<\/strong>, is a highly sought-after artist internationally, in 2021 she was chosen as one of the three most influential Hispanic women in the cryptocurrency industry using NFT (non-fungible token) technology by BeInCrypto and her works are among the most sought-after on the list CryptoArt.io NFT Rating Chart. Gala has created the first NFT for ELLE magazine that was sold for over 10,000 euros.<\/p>\n<p>This month in Alcalá Auction offers two works that recreate female myths of the 20th century, Frida Khalo and Marilyn Monroe. \/Frida Kahlo written in JavaScript \/, 2022 goes on sale for only 1,000 euros (see)<\/p>\n<p><strong>Adrian Balastegui<\/strong> is a digital artist born in Barcelona. In his works he represents dreamlike and tribal worlds, creating characters distorted from reality. He uses a bright color palette to give them strength.<br \/>\nHe started creating NFTs in March 2021, he is currently fully focused on this world. His works can be seen on platforms such as FND, Cryptocom, Hen, Rarible or MP.<br \/>\nYou can also see some of his collaborations in well-known collections in crypto art such as SuperGeishas or The Michis.<\/p>\n<blockquote><p>“Clean the shit” is part of a series of 3 pieces in which different tribes of indigenous people come across an urban environment and integrate into it. In this piece we can see how a member of these tribes is doing something as unglamorous as picking up the poop of his pet. Something as tribal and mystical as these characters can be are found doing daily tasks in our society.<\/p><\/blockquote>\n<p>Of<strong> BitError,<\/strong> We find up to 5 works available in the catalogue, a unique fact today in Spanish auctions.<\/p>\n<h3 style=\"text-align: center;\">Bet on the Spanish artist Bit Errror<\/h3>\n<p>With more than 230 NFTs sold for about $100,000 on different international platforms specialized in crypto art, it is a safe value in the sector, and little by little, its value is being recognized in Spain. With five works offered in the March catalog of Alcalá Auctions, it is having a great letter of introduction in the traditional art market in our country.<\/p>\n<p>As explained in the catalog, his works speak of our relationship with today&#8217;s world, nature, loneliness, everyday life&#8230;<\/p>\n<blockquote><p>Try to talk about our relationship with the world, nature, loneliness, friendship, the passage of time, sometimes just everyday life. He also experiments with other types of work that help him explore new tools and push the limits of his work, seeking other forms of expression.<\/p>\n<p>BIT ERROR Green Mind, 2020<br \/>\n<br style=\"clear: both;\" \/><\/p><\/blockquote>\n<p>As an example we have his work “The woman who became a rock” (see), an animated gif that shows a woman who little by little, in a fantastic play of textures, transforms into a rock. A metaphor for loneliness?<\/p>\n<p>The work “Faces Skull” (see), together with “Money Skull” and “Blood Money”, are part of a collection based on the work Horny by Felipao (see collection currently on sale) that has the consent of the Spanish artist known for his polyhedral Meninas.<\/p>\n<p>In &#8220;Faces Skull&#8221;, the artist takes Felipao&#8217;s work &#8220;Horny Forrado&#8221; as a reference, putting a face (and eyes) to the skulls: disturbing images creating a surreal atmosphere.<\/p>\n<blockquote>\n<h3 style=\"text-align: center;\">NFTMania X Felipao Collection<\/h3>\n<\/blockquote>\n<p>Within the catalog 4 works belong to a recent collection made by <strong>nftmania<\/strong>our NFT art gallery (so you are warned that there is a commercial interest on our part), which is a collaboration with the sculptor Felipao: based on his Horny skull, seven artists have made digital reinterpretations in non-fungible token (NFT) format that can be seen in the expo of the online gallery,<\/p>\n<p>We leave you some of the pieces offered at auction of the aforementioned collection<\/p>\n<blockquote><p>In the near future, robots and cybernetic humans coexist in a world marked by remoteness and social distance. Personal relationships are complex and bizarre. Horny Skulls, Sexy Robots, takes as a reference the Horny Skulls series by Felipao, opening a window to an interior space of the future, with touches of Hajima Sorajama.<\/p><\/blockquote>\n<p>While Money Skull also comes out for a very interesting price (see)<\/p>\n<h2 class=\"single-lot__title\" style=\"text-align: center;\">Solidarity digital art<\/h2>\n<blockquote><p>The initiative <b>SOLIDARITY DIGITAL ART<\/b> aims to raise funds to finance the evacuation and reception of Ukrainian children and cover all their needs through the transfer of works by several of the best digital artists of the moment, <b>Javier Arrés, Ignacio Pereira, Felipao, Cuco de Frutos, Gala Mirissa, Sergi Reboredo, Ángel López Soto, Bit Errror, María Emege, Daniel Duart, Paisojos, Ernst Blaad, Jorge Arévalo<\/b> and the writer <b>Xavier Moro<\/b>.All donations will receive a commemorative NFT of the donation and the highest donation for each of the artists will receive the NFT of the work.<\/p><\/blockquote>\n<h2 style=\"text-align: center;\">NFM: what we do and current services<\/h2>\n<p>We do not hide that TheArtMarket currently has interests in NFT Art, we explain our current services in relation to the NFT world. From 2021 we set ourselves three objectives in relation to the NFT world<\/p>\n<ol>\n<li>Validating NFT art and artists in the traditional market<\/li>\n<li>Commission NFT Exhibitions<\/li>\n<li>Create our NFT Art Gallery<\/li>\n<\/ol>\n<p>Services:<\/p>\n<ul>\n<li><strong>NFT Art Curated Gallery<\/strong>: <strong>nftmania<\/strong><\/li>\n<li><strong>International NFT Artists Club, NFTManía Club,<\/strong><\/li>\n<li><strong>Advice to auction houses on NFT<\/strong><\/li>\n<li><strong>Representation of NFT artists to offer their NFTs in traditional auctions<\/strong><\/li>\n<\/ul>\n<h3 style=\"text-align: center;\">Featured NFTS sales in Spain (February 2022)<\/h3>\n<p>The first NFT cover of Elle magazine sold for over €10,000<\/p>\n<p><strong>Project Director and Visual Manager, The Art Market Agency<\/strong><br \/>\nI am a professional photographer and I have learned that if you do not enter the online market you do not exist. With more than 20 years of experience in visual content management, I travel and provide content to the main tourist offices in the world.<\/p>\n<p><script async=\"\" defer=\"\" src=\"https:\/\/platform.instagram.com\/en_US\/embeds.js\"><\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<p>15 Mar Art and Market Advances: How Fauve Paris held the first NFT auction in France and Alcalá Auctions&#8217; first time including NFTs In Spain, few or none of the media have echoed the first sale of NFTS made at a public auction in France. While Alcalá Subastas offers NFT works in its catalog for [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1391,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1389"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1389"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1389\/revisions"}],"predecessor-version":[{"id":1651,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1389\/revisions\/1651"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1391"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1389"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1389"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1389"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}