{"id":1411,"date":"2022-05-29T04:55:20","date_gmt":"2022-05-29T04:55:20","guid":{"rendered":"https:\/\/infobloom.site\/what-is-the-relationship-between-nfts-and-the-metaverse\/"},"modified":"2022-05-29T04:55:20","modified_gmt":"2022-05-29T04:55:20","slug":"what-is-the-relationship-between-nfts-and-the-metaverse","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-is-the-relationship-between-nfts-and-the-metaverse\/","title":{"rendered":"What is the relationship between NFTs and the metaverse?"},"content":{"rendered":"<h2>Metaverse and NFTs in video games<\/h2>\n<p>There are several ways to exploit NFTs within the metaverse.<\/p>\n<h3>Play-to-earn arrives<\/h3>\n<p style=\"display:inline-block; width:100%;\"><\/p>\n<p>NFT games have been around for a long time and yes, you get paid to play.  Axie Infinity is one of the benchmarks in this sector, which comes to be a kind of Pokémon game, with somewhat strange creatures.  To play, you need a team of three monsters that you will have to buy with your own token —and it is not cheap.  The player can then earn tokens as they win games, earning money in the process.<\/p>\n<p><strong>The idea is for the metaverse to further exploit this system.<\/strong>, although it already has many detractors today.  NFT games aren&#8217;t really fun — it had to be said and said — and on the other hand, the money you make on platforms like Axie Infinity comes from new players.  Come on, today, these games are a manual Ponzi scheme.  Time the public will decide if this changes in the metaverse or if it will disappear like other such promising technologies that fell into oblivion.<\/p>\n<h3>Revolutionizing pay-to-win<\/h3>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"alignnone size-full wp-image-380457\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653800119_821_What-is-the-relationship-between-NFTs-and-the-metaverse.jpg\" alt=\"loot boxes\" width=\"1200\" height=\"664\"\/><\/p>\n<p>Another function that NFTs can bring to the metaverse is the ability to <strong>pay or rent some of our virtual assets<\/strong> to make our games easier or monetize the achievements we have achieved.  On paper it may not sound bad, but if this idea ends up being developed by business sharks like EA or Ubisoft… beware.  Loot-boxes will seem like the Happy Meal treat compared to the ticking time bomb it can be.<\/p>\n<h2>Applications for Art, copyright and royalty collection<\/h2>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"alignnone size-full wp-image-378567\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653800119_288_What-is-the-relationship-between-NFTs-and-the-metaverse.jpg\" alt=\"epidemic sound\" width=\"1200\" height=\"664\"\/><\/p>\n<p>We are in the prehistory of the metaverse.  A couple of decades ago, surely you saw as impossible <strong>live off the internet<\/strong>.  Today, many of us live from it.  The revolution that began with the &#8216;dot com&#8217; could have a new episode in the metaverse.  We are seeing it little by little with NFT art, but it would not be strange if business models that we know very well, such as music, the payment of royalties to use an image from a stock bank or any other asset that we use to create, experience a new revolution.  Or at least, it should not be ruled out that everything that is going to be used in the metaverse requires making a previous payment in the metaverse and everything is controlled via token.  It may seem apocalyptic, but it would be the <strong>end of piracy<\/strong>for example.<\/p>\n<h2>DeFi and new forms of investment in the metaverse<\/h2>\n<p style=\"display:inline-block; width:100%;\"><img viewbox=\"0 0 3 2\" loading=\"lazy\" class=\"alignnone size-full wp-image-385890\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653800120_748_What-is-the-relationship-between-NFTs-and-the-metaverse.jpg\" alt=\"DeFi\" width=\"1200\" height=\"664\"\/><\/p>\n<p>The <strong>decentralized finance<\/strong> They came a few years ago to stay.  Everything from brilliant platforms to seedy scams has been done in the name of DeFi.  All that aside, DeFi has shown that you don&#8217;t need a regulator to set up an exchange.  Operations on these platforms are made <strong>wallet to wallet<\/strong>.  Come on, the Treasury of your country can&#8217;t do anything to get their hands on it, no matter how hard they try.  In a world in which we are increasingly taxed, the underground economy can evolve into a parallel, decentralized and virtual economy within the metaverse.  NFTs would only come to do their bit in the world of staking and passive earnings.  Whether it works, whether it&#8217;s legal or ethical, is something else.<\/p>\n<p>But DeFi goes far beyond speculation or dodging states.  What we know today about DeFi might just be the tip of a huge iceberg.  A <strong>economy<\/strong> totally parallel, <strong>independent and fully decentralized<\/strong> that could have a greater weight in society than it has right now.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Metaverse and NFTs in video games There are several ways to exploit NFTs within the metaverse. Play-to-earn arrives NFT games have been around for a long time and yes, you get paid to play. Axie Infinity is one of the benchmarks in this sector, which comes to be a kind of Pokémon game, with somewhat [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1416,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1411"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1411"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1411\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1416"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1411"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1411"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1411"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}