{"id":1417,"date":"2022-05-29T05:27:37","date_gmt":"2022-05-29T05:27:37","guid":{"rendered":"https:\/\/infobloom.site\/nfts-a-unique-cryptographic-token\/"},"modified":"2022-05-29T05:27:37","modified_gmt":"2022-05-29T05:27:37","slug":"nfts-a-unique-cryptographic-token","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nfts-a-unique-cryptographic-token\/","title":{"rendered":"NFTs, a unique cryptographic token"},"content":{"rendered":"<p>Surely for a few months you have not stopped reading conversations about NFTS on social networks, although you still do not know what they are.  Don&#8217;t worry, we talked about it.  For a year now, NFTs have been causing a great digital revolution through technology <strong>blockchain<\/strong>the same one used by cryptocurrencies.<\/p>\n<h2 id=\"en-terminos-sencillos-que-es-esto\">In simple terms, what is this?<\/h2>\n<p>To understand NFTs, we must first understand what the NFT is. <strong>blockchain<\/strong>.  Surely you know what cryptocurrencies are, but do you know how they work?  In our routine environment, when we carry out any monetary transaction we need an intermediary, the bank.  This is responsible for recording the transaction that we make to someone.  Their role is to notify the other person&#8217;s bank that they have received the money from us, that is, they make a simple change in the balances of the two bank accounts.<\/p>\n<p>However, there is a problem.  Neither the person making the transaction nor the person receiving it have <strong>no control in this process<\/strong>.  In order for the other person to receive the money, the sender and the receiver depend completely on the two banking entities.<\/p>\n<p>The goal of the blockchain is <strong>eliminate these intermediaries<\/strong> through decentralization of management.  In this way, <strong>users have the power<\/strong> during the whole process of this management.  The sender and receiver become a bank with millions of nodes, that&#8217;s why it&#8217;s called <strong>blockchain<\/strong> (block chain).  It is a kind of account book where the records (called blocks) are intertwined with others, in such a way that <strong>information is encrypted and protects the privacy of transactions<\/strong>.  In this way, the only ones who know that a transaction has been made are the issuer and the receiver of the money.<\/p>\n<h2 id=\"que-son-los-nfts\">What are NFTs?<\/h2>\n<p>Now that you know the blockchain technology, it will be easier to understand the phenomenon of NFTs.  An NFT is a “<strong>non-fusible token<\/strong>”, that is, it is not consumed when used and cannot be replaced, just like a work of art.  NFTs have a kind of unique and irreplaceable certificate associated with a digital file, which allows you to prove that it is a real NFT.  A large part of them are part of the Ethereum blockchain (the blockchain of a cryptocurrency).<\/p>\n<p>The <strong>NFT&#8217;s<\/strong> they can be any digital file, from music, images or even a brain turned into Artificial Intelligence (AI).  The moment you become the owner of one, it becomes your property, just like a work of art, although the authorship is maintained, which remains with the creator.  However, authorship should not be understood as traditional.  In the case of NFTs, the buyer can modify the work and do what he wants.  In this area, we see that there is a lack of regulation.<\/p>\n<p>The most common is the <strong>digital art turned into NFTs<\/strong> and surely you have heard about this topic, which has been controversial lately.  To give you an idea, NFTs are being sold for millions of dollars paid in cryptocurrencies, as we have said before, most of them with Ethereums.<\/p>\n<p>Buyers spend hundreds of thousands of dollars on pieces such as the illustration of a rock (EtherRock), the cats from the Cryptokitties collection, the lions from Lazy Lions or the monkeys from Bored Ape Yacht Club, one of the most popular, among others. .<\/p>\n<p>NFT valued at $300,000 sold by accident for $3,000.  Bored Ape Yacht Club<img loading=\"lazy\" width=\"1024\" height=\"797\" data-id=\"175312\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653802057_618_NFTs-a-unique-cryptographic-token.png\" alt=\"\" class=\"wp-image-175312\"  \/>NFT sold for $170,000.  cryptokitties<img loading=\"lazy\" width=\"750\" height=\"500\" data-id=\"175311\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/NFTs-a-unique-cryptographic-token.jpg\" alt=\"\" class=\"wp-image-175311\"  \/>NFT valued at $1 million.  EtherRock<\/p>\n<h2 id=\"en-que-se-diferencia-un-nft-real-de-una-copia\">How is a real NFT different from a copy?<\/h2>\n<p>It is true that a painting, such as Las Meninas by Velázquez, cannot be compared with a digital copy of the same painting.  It goes without saying that the experience is not the same, since the change is from a physical object to a digital one, which can lose details, among other factors.<\/p>\n<p>In the case of making a copy of an NFT, no change could be appreciated.  To prove that it is an original piece and not a copy, it should be done through the trading platform, such as Opensea, or in the digital wallet (cryptowallet), since they are also stored there.<\/p>\n<h2 id=\"cual-es-el-objetivo-y-el-uso-de-los-nfts\">What is the purpose and use of NFTs?<\/h2>\n<p>It all depends on whether you are an artist or a buyer.  In case you are a <strong>artist<\/strong>, you can create your own collection of NFTs and sell your works through the different platforms.  In fact, there is an option that you can turn on or off, which <strong>allows you to obtain a percentage each time the NFT you have created is bought or sold<\/strong>.  In this way, in the event that your work is revalued, you could get a part of the profit.<\/p>\n<p>In the case of <strong>buyer<\/strong> either <strong>buyer<\/strong>, you help artists so that they can live from their works, although it is not the real objective.  The main purpose of the buyer or purchaser is<strong> sell the NFT once it appreciates<\/strong> to get benefits.  Although there are some users who do not and who prefer to publish it in <strong>social networks<\/strong>do <strong>merchandise<\/strong> or even <strong>derivatives<\/strong>.<\/p>\n<p>There are other cases, such as that of the buyer of the NFT “Everydays: The First 5,000 Days”, who after paying <strong>$69 million<\/strong> by the NFT created by Beeple, invited all users to <strong>get a free copy of the NFT<\/strong>.<\/p>\n<p><strong>Sundaresan<\/strong>the buyer, talks about NFTs:<\/p>\n<blockquote class=\"wp-block-quote\">\n<p><strong>“Information wants to be free.  Everyone should be able to enjoy an NFT without having to pay for it.  We should value the idea that a person helps the artist to live from his works”.<\/strong><\/p>\n<p>Sundaresan, buyer of Everydays: The First 5,000 Days.<\/p><\/blockquote>\n<h2 id=\"por-que-se-pagan-millones-de-euros-por-un-nft\">Why are millions of euros paid for an NFT?<\/h2>\n<p>There are different types of buyers.  There is a class of people who firmly believe that <strong>NFTs are the future of art collecting<\/strong>.  Others treat them like a letter.  These are accessible to the vast majority until they are revalued, like what happened with Pokémon cards last year.<\/p>\n<p>Speaking of cards, Logan Paul, an American youtuber, created an NFT of a personalized card, called “You&#8217;ve activated my trap card”, which <strong>sold for $17,000<\/strong>.<\/p>\n<p><img loading=\"lazy\" width=\"812\" height=\"752\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653802057_731_NFTs-a-unique-cryptographic-token.png\" alt=\"\" class=\"wp-image-175314\"  \/>NFT created by Logan Paul at the Logan Paul Digital Collectibles Store<\/p>\n<p>In a <strong>speculative market in the digital realm<\/strong>.  As the NFTs are, as we have said before, unique and irreplaceable, they obtain a higher value, since there can be no real copies, beyond a downloadable image.  The goal is to sell it once its value increases, as happened with Bitcoin, which is now worth millions.<\/p>\n<h2 id=\"se-pude-convertir-un-nft-en-un-tangible\">Can an NFT be converted into a tangible?<\/h2>\n<p>There have been many attempts to bring NFTs into the “real world”.  For example, Nike developed a method for <strong>verify the authenticity of your sneakers through a system of NFTs<\/strong> called CryptoKicks.  Each pair of sneakers has a digital asset with a shoe identifier, with a series of metadata that stores all the relevant information for the buyer, just like NFTs.  In this way, when someone buys a pair of Nike sneakers, a visual representation will be generated and assigned a <strong>crypto token<\/strong>.<\/p>\n<h2 id=\"hay-nfts-relacionados-con-la-ingenieria\">Are there NFTs related to engineering?<\/h2>\n<p>There are collections of all kinds, although those related to engineering are not the most famous.  For example, the “Art Engineering” collection.  However, the scientific and engineering community have found the tokens as a <strong>way to finance your projects<\/strong>.  It is the case of <strong>Tim Berners-Lee<\/strong>creator of the <strong>world Wide Web<\/strong>which has identified the possibility of creating a unique identifier for its professional projects and selling it as a collectible.<\/p>\n<p>At Inspirit Mutua we do not have NFTs, but we love everything that is related to innovation or entrepreneurship.  In <strong>The Mutual of the Engineers<\/strong> We advise entrepreneurs in a personalized way to find the coverage that suits your needs.<\/p>\n<p>You can request information or send the form, we will assist you <strong>without any commitment<\/strong>.<\/p>\n<p><img loading=\"lazy\" width=\"1024\" height=\"689\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653802057_103_NFTs-a-unique-cryptographic-token.png\" alt=\"\" class=\"wp-image-175316\"  \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Surely for a few months you have not stopped reading conversations about NFTS on social networks, although you still do not know what they are. Don&#8217;t worry, we talked about it. For a year now, NFTs have been causing a great digital revolution through technology blockchainthe same one used by cryptocurrencies. In simple terms, what [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1423,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1417"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1417"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1417\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1423"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1417"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1417"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1417"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}