{"id":1430,"date":"2022-05-29T07:36:40","date_gmt":"2022-05-29T07:36:40","guid":{"rendered":"https:\/\/infobloom.site\/is-axie-infinity-a-bubble\/"},"modified":"2022-05-29T07:36:40","modified_gmt":"2022-05-29T07:36:40","slug":"is-axie-infinity-a-bubble","status":"publish","type":"post","link":"https:\/\/infobloom.site\/is-axie-infinity-a-bubble\/","title":{"rendered":"Is Axie Infinity a bubble?"},"content":{"rendered":"<p style=\"text-align: justify;\">The latest buzzword when it comes to gaming\/NFTs is concerned: Axie Infinity.  If I have to describe it in a few words I would say that it is basically when Pokémon meets cryptocurrency mining.  Personally, I am not a game player.  But this article is not exactly a review of the game as such.  It is actually a risk analysis of your business model.  That is, Axie as an investment. <strong>Is a gotcha?  Is it a bubble?  Is it a valid and legitimate business?  What are the risks? <\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>What is a bubble?<\/strong> &#8220;Bubble&#8221; is a word widely used by people who want to discredit a market.  The term is often abused.  In general, a bubble is said to be what is considered to be irrationally overpriced.  The problem here is the price of something that is generally associated with our preferences.  What is preferred we tend to see as valuable.<strong> What is not preferred we tend to see as not valuable.  But that is often a rather myopic view, because it does not take into account the preference of others. <\/strong>The fact that I personally do not like video games does not imply that there is no demand elsewhere.  You have to be sensible enough to understand that. <\/p>\n<p style=\"text-align: center;\"><strong>Keep reading: Art vs Bitcoin: The NFT Revolution?<\/strong><\/p>\n<p style=\"text-align: justify;\"><strong>Many analysts have called Bitcoin a meaningless speculative bubble destined to die since its inception.<\/strong> More than a prediction, it is a preference.  That is, they do not like the asset and think that the people investing in it are idiots.  Now, the truth is that markets are formed for various reasons.<strong> It doesn&#8217;t have to make sense to everyone.  If there is demand, there is value.  Whether we like it or not. <\/strong>The bursting of a bubble (or the excessive overvaluation of a market), generally, occurs for two reasons: People run out or money runs out.  Normally, there is a stage of euphoria before the collapse.  This stage of euphoria is usually characterized by recklessness.  In other words,<strong> you use money you don&#8217;t have to buy. <\/strong>I mean credit.  It is demand and raises prices.  But it is an unsustainable demand. <\/p>\n<p style=\"text-align: justify;\"><strong>Well, the bubbles, over time, burst. <\/strong>There is a capitulation.  There are withdrawals of people and money.  The price is corrected.  And then comes a gradual reconstruction.  Much is made of the tulip bubble.  But if you head to Holland right now, surprisingly, you will see a vibrant tulip industry.  Which implies that the bursting of a bubble does not necessarily mean the death of a market.  What it means is that markets fluctuate.  And sometimes they fluctuate too much.  We must be very careful when we hear the word “bubble”. <strong>In most cases, it is a pejorative attack without much support. <\/strong><\/p>\n<p style=\"text-align: justify;\">Of course, a fair valuation is very important when investing in something.  After all, to make money in the world of investments it is important to buy low and sell high.  That implies optimism.  That is, the belief that there will be greater demand in the future for the asset in question.  Which is never easy to predict.  Normally, trends are used.  Patterns, statistics, and fashions are analyzed.  But I&#8217;m afraid there are no certainties.  Nobody knows the future. <strong>However, decisions are made on probabilities. <\/strong><\/p>\n<p style=\"text-align: center;\"><strong>Keep reading: What is Carl Icahn up to with Bitcoin?<\/strong><\/p>\n<p style=\"text-align: justify;\">Is Axie Infinity a scam?  There is no reason to think so.  The project has the endorsement of serious actors.  And it all seems pretty seamless. <strong>It&#8217;s a game.  There are some rules.<\/strong> Everything has been clear from the beginning.  Additionally, the product was very liked.  That is clear from its growth in recent months.  In other words, a community has been formed.  In fact, I would dare to say that there is still a lot to grow.  The game is relatively new and very little known.  Indeed, this seems to be just beginning.  Everything indicates that we are at a fairly early stage. <\/p>\n<p style=\"text-align: justify;\">Well, let&#8217;s talk a little about the business.<strong> Axies are the characters in the game.  Those “axies” can be bought or sold. <\/strong>With three Axies, a team is formed.  And with a team you can go into battle.  The winner of a battle gets tokens called SLPs.  In other words, the investment is the purchase of the Axies. <strong>And the profit is the SLPs obtained by our victories.<\/strong> According to some testimonials on social networks, <strong>We are talking about the fact that right now if you invest about $900, you can recover the investment in approximately a month and a half.<\/strong><\/p>\n<p style=\"text-align: justify;\">Now, now we are going to explain it with mining analogies.  Suppose the axies are the mining equipment, the war ability of the acquired axes is the mining difficulty, and the LSPs are the mined cryptos. <strong>Where is the risk?  The risk is paying more for less.<\/strong> It is to buy some expensive axies, which earn little, and generate little.  So, it&#8217;s not about a month and a half, but a year and a half or more.  Which could happen if demand drops overwhelmingly or the effectiveness of other equipment increases exponentially. <strong>In short, we are in a reality very similar to mining. <\/strong><\/p>\n<p style=\"text-align: center;\"><strong>Read on: Can George Soros Break Bitcoin the Same Way He Broke the Bank of England?<\/strong><\/p>\n<p style=\"text-align: justify;\">Is it a bubble?  Frankly, I don&#8217;t think so.  At least not yet.  Why?  Well, because the project is still very small. <strong>Word has not yet spread.  In other words, there are still many people to enter.  In fact, the public has not yet discovered the application.  Today is a game of a few insiders.  But I think things will get hot over time. <\/strong><\/p>\n<p style=\"text-align: justify;\">As is often the case in crypto, time is of the essence.  Today you can get some good Axies for under $300.  But I&#8217;d bet a dollar those days are numbered.  L<strong>The great beneficiaries will be those who entered early.  Here the secret is not to go crazy.  I mean don&#8217;t invest money you don&#8217;t have to swallow more than you can chew. <\/strong>It is vitally important to understand that all of this involves risk.  Today it is fashionable.  Tomorrow it may not be.  No one knows for sure who will be the last.  Making an objective valuation of assets of this type is very difficult, because it is not known exactly how much new demand is on the way. <\/p>\n<p style=\"text-align: justify;\">From what I&#8217;ve seen, this game has all the ingredients to go viral.  It&#8217;s not my cup of tea.  But the players are very excited about it. <strong>Of the three pillars of Ethereum: stablecoins, DeFi and NFTs, all have a future.  The game is certainly a popular niche.  There is always demand for a good game.  Now, we have to see how the Axie Infinity project evolves. <\/strong><\/p>\n<p style=\"text-align: justify;\">This article does not contain investment advice or recommendations.  Every investment and trading move involves risks, you should do your own research when making a decision.<\/p>\n<p style=\"text-align: justify;\">The views, thoughts and opinions expressed here are solely those of the author and do not necessarily reflect or represent the views and opinions of Cointelegraph.<\/p>\n<p style=\"font-size:90%;\">Investments in crypto assets are not regulated.  They may not be suitable for retail investors and the full amount invested may be lost.  The services or products offered are not aimed at or accessible to investors in Spain.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The latest buzzword when it comes to gaming\/NFTs is concerned: Axie Infinity. If I have to describe it in a few words I would say that it is basically when Pokémon meets cryptocurrency mining. Personally, I am not a game player. But this article is not exactly a review of the game as such. It [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1431,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1430"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1430"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1430\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1431"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1430"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1430"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1430"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}