{"id":1432,"date":"2022-05-29T08:08:54","date_gmt":"2022-05-29T08:08:54","guid":{"rendered":"https:\/\/infobloom.site\/an-opportunity-for-which\/"},"modified":"2022-05-30T13:41:16","modified_gmt":"2022-05-30T13:41:16","slug":"an-opportunity-for-which","status":"publish","type":"post","link":"https:\/\/infobloom.site\/an-opportunity-for-which\/","title":{"rendered":"An opportunity for which&#8230;"},"content":{"rendered":"<p>One of the great doubts of the sports industry is<strong> how to monetize the cryptocurrency business<\/strong>, the metaverse and other types of immersive experiences.  Managers from Meta, D2F Partners, the Euroleague and the NBA have been discussing this at the fifth round table of Pro Sportstech Congress 2022.<\/p>\n<p>During the debate moderated by Jordi Roquer, co-founder of SevenMila and CEO of ATM Media, the experts agreed that for these phenomena to be profitable for the different players in the sports industry, it is necessary to leave behind the usual short-term mentality of the sector.<\/p>\n<p>Specifically, it has been Kike Levy, responsible for sports in southern Europe for Meta, who has taken for granted that we are already immersed in the metaverse and has pointed out that <b>“The sports industry stops looking at the short term and looks at the long term<\/b>”.  It is an aspect in which the four rapporteurs have agreed.<\/p>\n<p><\/p>\n<p>The director of the social network has pointed out several of the phenomena in which the sports and technology business has been working: such as artificial intelligence or virtual reality.<\/p>\n<p>Guillem Graell, co-founder of D2F Partners, has highlighted the uncertainty related to these experiences.  &#8220;We don&#8217;t know where he&#8217;s going to go, we can theorize about it.&#8221;  What the former director of FC Barcelona is clear about is that you have to look at the audience, which is the one that always generates the business.  “Audiences?  Yes, and when?” Graell wondered.<\/p>\n<p>The leader has shown his fears that the metaverse will generate excessive concentration that limits opportunities.  “<strong>Will there be several players or will it be a player with enough strength to set the rules of the game?  This is the most important transformation<\/strong>”, Graell pointed out.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653811734_661_an-opportunity-for-which.jpeg\" alt=\"PRO Sportstech 2022. Photography by Rodolfo Molina AS\" title=\"PRO Sportstech 2022. Photography by Rodolfo Molina AS\" class=\"c-image__img\"><\/p>\n<p>Rayde Baez, senior strategic adviser for the Euroleague, has also pointed to the audiences, but stressing that it is necessary to try to diversify as much as possible.  &#8220;The Euroleague owes its shareholders (the clubs) and fans and we want to find partners that allow us to get to know them better.&#8221;  The leader of the top European basketball competition has assured that &#8220;we should stop wanting to segment customers by age.&#8221;<\/p>\n<p>Chus Bueno, vice president of the NBA in Europe, Africa and the Middle East (Emea), has given the example of 2K as a metaverse and has highlighted that as a competition &#8220;we do not make the technology, but we are very close to those who develop it&#8221; .  Regarding the metaverse, Bueno has explained that the <i>players<\/i> They will be in charge of taking the initiative, but he has pointed out the need to approach them to monetize it and create the best experience.”<\/p>\n<p><b>What is the Pro Sportstech Congress?<\/b><\/p>\n<p>The PRO Sportstech Congress, which celebrates its first edition in Barcelona, ​​is a day that combines <b>a meeting point for professionals in the sports industry to address the impact of technology in this industry with the challenges<\/b> and opportunities that it brings.<\/p>\n<p>It is an appointment in which the managers of the sector discuss the future of the industry with a holistic vision, which ranges from immersive experiences and the metaverse to the promotion of sports practice thanks to technology, including high performance and the creation of content for the fan.<\/p>\n<p>Organized by 2Playbook and Indescat, it has AS as <i>media partner<\/i> Y <b>the support of Barcelona City Council, Estrella Damm, Technogym and Fluidra as sponsors<\/b>.  The event can be followed in person at the Old Estrella Damm Factory in Barcelona and online.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the great doubts of the sports industry is how to monetize the cryptocurrency business, the metaverse and other types of immersive experiences. Managers from Meta, D2F Partners, the Euroleague and the NBA have been discussing this at the fifth round table of Pro Sportstech Congress 2022. During the debate moderated by Jordi Roquer, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1435,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1432"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1432"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1432\/revisions"}],"predecessor-version":[{"id":1683,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1432\/revisions\/1683"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1435"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1432"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1432"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1432"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}