{"id":1438,"date":"2022-05-29T09:13:25","date_gmt":"2022-05-29T09:13:25","guid":{"rendered":"https:\/\/infobloom.site\/the-best-nft-artwork-created-so-far\/"},"modified":"2022-05-30T13:40:59","modified_gmt":"2022-05-30T13:40:59","slug":"the-best-nft-artwork-created-so-far","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-best-nft-artwork-created-so-far\/","title":{"rendered":"The best NFT artwork created so far"},"content":{"rendered":"<p>The top NFT artwork is a hot topic right now, as NFT sales hit the headlines and everyone is wondering what all the fuss is about. Non-fungible tokens (NFTs) are the newest way to trade collectibles, and encompass art forms ranging from digital art to GIFs to music and beyond. Essentially, anything that can be thought of to hold value and can be stored digitally can be sold as an NFT. Crucially, NFTs are part of the Ethereum blockchain (Ethereum is a type of cryptocurrency), and the data stored inside the file holds value – sometimes a lot of value.<\/p>\n<p>confused? Find out more in our guide that explains all you need to know about NFTs. But for now, read on to find out the NFT artwork that has caught our attention, for outrageous sale prices to the quality of the art itself. And if you&#8217;re feeling inspired, get yourself some of the best digital art software and create your own piece to sell.<\/p>\n<h2 id=\"01-kevin-mccoy-x2013-quantum\" class=\"paywall\">01. Kevin McCoy – Quantum<\/h2>\n<p><iframe src=\"https:\/\/gfycat.com\/ifr\/evenrequiredalbacoretuna\" width=\"500\" height=\"600\"><br \/>\n<\/iframe><\/p>\n<p class=\"paywall\">First up in our list of stunning NFT artwork is Quantum – the first NFT ever created, back in 2014. Quantum is the oldest entry by quite some way and was put together when Anil Dash and Kevin McCoy built the first blockchain-backed system for selling NFTs. Dash recently wrote in The Atlantic (opens in new tab) that the two built the system as a way to give digital artists more control over their work, giving the project the ironic name of &#8216;monetized graphics&#8217; (watch the first presentation of the project here (opens in new tab)).<\/p>\n<p class=\"paywall\">We think Quantum&#8217;s literal depiction of the NFT concept is splendid – simply a set of spinning dollar symbols set inside a traditional picture frame. Artist McCoy has recently put the work up for sale (opens in new tab), and it has expected price tag of over $7million.<\/p>\n<h2 id=\"02-beeple-x2013-everydays-x2013-the-first-5000-days\" class=\"paywall\">02. Beeple – Everydays – The First 5000 Days<\/h2>\n<p>Beeple&#8217;s work is the most expensive NFT ever sold (Image credit: Christie&#8217;s)<\/p>\n<p class=\"paywall\">Beeple, aka Mike Winkelmann (opens in new tab), sold his work Everydays – The First 5000 Days (opens in new tab) in March 2021. It went an impressive $69.3million, which is the highest price paid for an NFT so far. The piece is a true labor of love – a collage Winklelmann created by collating one artwork a day for 5,000 days, since 2007. Winkelmann continues the project to this day, using software including Cinema 4D and Octane.<\/p>\n<p class=\"paywall\">High-end auction house Christies sold the collage in the first-ever purely digital NFT auction held by an auction house. It was a rollercoaster of an event, which ended in the third-highest price ever paid for work by a living artist. And in case you were wondering, the sale price works out to $13,860 per piece – a pretty tasty day rate. Find out more about it here.<\/p>\n<h2 id=\"03-trevor-jones-xa0-and-xa0-jose-delbo-x2013-genesis\" class=\"paywall\">03. Trevor Jones and Jose Delbo – Genesis<\/h2>\n<p>A stunning duo created with pen and ink and oil on canvas (Image credit: Jose Delbo)<\/p>\n<p class=\"paywall\">This sultry depiction of Batman is one of a five-part collection titled Genesis, which was sold in 2020. A stunning pencil and ink sketch, which was interpreted in oil on canvas to create a duo, this entry into our NFT artwork list is a collaboration between comic book artist José Delbo (known for his work on Wonder Woman, the Beatles&#8217; Yellow Submarine comic and others) and Trevor Jones (a contemporary artist).<\/p>\n<p class=\"paywall\">Genesis was nominated for the Best NFT Art award at the NFT Awards (opens in new tab) (yup, that&#8217;s a thing now), and it sold for $111,377 – the most expensive piece of NFT art at the time. But, more than the price tag, we enjoy the merging of superheroes with digital art. After all, one of the most successful crossovers in pop culture is comic books being made digital in film, so this transition makes total sense.<\/p>\n<h2 id=\"04-gucci-ghost\" class=\"paywall\">04. Gucci Ghost<\/h2>\n<p><iframe src=\"https:\/\/gfycat.com\/ifr\/joyousvacantlhasaapso\" width=\"500\" height=\"600\"><br \/>\n<\/iframe><\/p>\n<p class=\"paywall\">We love the outrageousness of the Gucci Ghost. As the name suggests, it&#8217;s a hand-drawn Gucci ghost, which wasn&#8217;t even created by Gucci but by multi-disciplinary artist Trevor Andrew (opens in new tab). Andrew has carved out quite the niche for himself through his different renditions of the Gucci Ghost across different art forms – including neon lights, pop art-style prints and sculpture installations. And this shivering GIF-ghost made a name for itself by selling for $3,600 on the NFT market (opens in new tab) in February 2021.<\/p>\n<h2 id=\"05-fyre-festival-logo\" class=\"paywall\">05.Fyre Festival Logo<\/h2>\n<p>One of the most controversial NFT sales yet (Image credit: Flipkick)<\/p>\n<p class=\"paywall\">Ah, the Fyre Festival. Remember it? It was the ostentatious money grab that left swathes of the super-rich flailing after falling victim to the fake festival scam, immortalized by Netflix in a 2019 documentary. And the festival&#8217;s logo sold in March 2021 as an NFT (catch up on the sale here). One of the most controversial NFT art sales ever, the $122,000 price tag indicates the symbol has turned into an important piece of cultural history. We love this NFT artwork for the story behind it. It seems fitting, too, as NFTs themselves are not without controversy.<\/p>\n<h2 id=\"06-krista-kim-x2013-mars-house\" class=\"paywall\">06. Krista Kim – Mars House<\/h2>\n<p class=\"paywall\">Mars House is a piece of digital real estate sold as an NFT for $500,000, described on the SuperRare listing (opens in new tab) as the &#8216;world&#8217;s first digital house&#8217;. Designed to be a &#8216;light sculpture&#8217;, Kim Krista&#8217;s house is made of 3D-rendered floor-to-ceiling glass overlooking the moody mountains of Mars. You can sunbathe on the terrace using virtual reality to soak up the Mars atmosphere and it even comes with its own soundtrack created with Jeff Schroeder from The Smashing Pumpkins.<\/p>\n<p class=\"paywall\">Krista designed the house in line with her meditative design principles, with the site listing explaining that &#8220;her hope was to use the influx of digital life as an opportunity to promote well-being&#8221;, and we think it&#8217;s one of the best pieces of NFT artwork out there in terms of innovation.<\/p>\n<h2 id=\"07-pak-x2013-finite\" class=\"paywall\">07. Pak-Finite<\/h2>\n<p class=\"paywall\">Pak (opens in new tab) is a superstar in the world of digital art and responsible for some of the best NFTs around, but he is also quite the mystery. As an anonymous artist, no one knows who Pak really is but he&#8217;s one of the top-selling artists in the NFT arena and counts Elon Musk among his admirers of him. Finite is an undulating, mesmerizing 3D render in the style of many of his catalog of works – dark and moody. It&#8217;s hard to tear your eyes away from this piece, and we assume the buyer must have felt the same way as they shelled out a whopping $809,789.40 (opens in new tab) for the work in March 2021.<\/p>\n<h2 id=\"08-blake-kathryn\" class=\"paywall\">08. Blake Kathryn<\/h2>\n<p class=\"paywall\">Blake Kathryn (opens in new tab) creates vibrant, ethereal digital art, which is both fantastical and futuristic. Kathryn counts Adobe, Fendi and Jimmy Choo among her list of her clients, but she&#8217;s also an active player in the NFT space.<\/p>\n<p class=\"paywall\">Seasons (above) is a stunning depiction of the seasons inside a series of vertically-rising rooms, described as (opens in new tab) &#8216;a reflection of time passed within familiar walls&#8217;. With marvelous texture and rich color palettes, this NFT artwork sold for $22,938.19 in December 2020.<\/p>\n<p class=\"paywall\">Feeling inspired? Get your creative kit sorted with one of the best drawing tablets out there, or one of the most powerful laptops. Or, see the deals below.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The top NFT artwork is a hot topic right now, as NFT sales hit the headlines and everyone is wondering what all the fuss is about. Non-fungible tokens (NFTs) are the newest way to trade collectibles, and encompass art forms ranging from digital art to GIFs to music and beyond. Essentially, anything that can be [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1440,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1438"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1438"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1438\/revisions"}],"predecessor-version":[{"id":1681,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1438\/revisions\/1681"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1440"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1438"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1438"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1438"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}