{"id":144,"date":"2022-05-03T15:46:07","date_gmt":"2022-05-03T15:46:07","guid":{"rendered":"https:\/\/infobloom.site\/the-great-scam-they-detect-money-laundering-and-manipulation-of-the-nfts-market\/"},"modified":"2022-05-03T15:46:07","modified_gmt":"2022-05-03T15:46:07","slug":"the-great-scam-they-detect-money-laundering-and-manipulation-of-the-nfts-market","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-great-scam-they-detect-money-laundering-and-manipulation-of-the-nfts-market\/","title":{"rendered":"The great scam: they detect money laundering and manipulation of the NFTs market"},"content":{"rendered":"<p>During the last time, NFTs (Non-Fungible Tokens) have become hype and silver around the world.  These are unique cryptographic digital files, whose main condition lies in their scarce condition, which obviously drives auction transfers that raise their value.<\/p>\n<p>In this sense, a new report from the Chainalysis portal indicates that multiple users are taking advantage of the lack of regulation to carry out practices that would be considered illegal in other markets.<\/p>\n<p>This is the case, for example, of &#8220;wash trading&#8221;, which is a technique that involves the purchase and sale made by the same owner of an NFT.  As this market is not regulated, this is carried out through platforms that do not require identification, with the aim of artificially increasing the value.  And the above attracts other buyers looking to invest in something that has suddenly increased in price.<\/p>\n<p>The portal&#8217;s research indicated that 260 users have performed this technique more than 25 times, with a group of 100 people managing to obtain almost 9 million dollars through the ghost technique.  &#8220;That nearly $9 million is most likely derived from sales to unsuspecting buyers who believe that each NFT they are acquiring has been growing in value from one different collector&#8217;s sale to another,&#8221; the report explains.<\/p>\n<p>Another of the problems detected, and which also happens with cryptocurrencies, involves money laundering.  Various individuals with illegally obtained funds, such as hackers who acquire resources with malware, invest in the purchase of NFTs and then generate a resale that allows them to launder the resources.  In the last quarter of 2021 alone, transactions of this type were detected for an amount of almost 1.5 million dollars.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>During the last time, NFTs (Non-Fungible Tokens) have become hype and silver around the world. These are unique cryptographic digital files, whose main condition lies in their scarce condition, which obviously drives auction transfers that raise their value. In this sense, a new report from the Chainalysis portal indicates that multiple users are taking advantage [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":145,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/144"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=144"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/144\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/145"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=144"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=144"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=144"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}