{"id":1441,"date":"2022-05-29T09:45:45","date_gmt":"2022-05-29T09:45:45","guid":{"rendered":"https:\/\/infobloom.site\/how-technology-empowers-nonprofits-during-a-crisis-to-help-more-people-in-need\/"},"modified":"2022-05-30T13:40:35","modified_gmt":"2022-05-30T13:40:35","slug":"how-technology-empowers-nonprofits-during-a-crisis-to-help-more-people-in-need","status":"publish","type":"post","link":"https:\/\/infobloom.site\/how-technology-empowers-nonprofits-during-a-crisis-to-help-more-people-in-need\/","title":{"rendered":"How technology empowers nonprofits during a crisis to help more people in need"},"content":{"rendered":"<p>Microsoft designed the Common Data Model for Nonprofits (CDM) in 2018 to help organizations connect data across all applications and platforms. The CDM addresses specific data needs unique to nonprofit workflows, such as fundraising, constituent management, program delivery, overhead rate calculation, and the ability to report to donors about its impact. It also sets a standard for any technology partner working with charity groups.<\/p>\n<p>Building on that foundation, the company began developing apps to lower the cost for nonprofits to implement new technology and increase the impact of their programs, Spelhaug said. The next step, he comments, is fundraising and involvement, &#8220;because funds are the essence of a nonprofit organization.&#8221;<\/p>\n<p>Right To Play realized several years ago that it needed a new software system to manage a boost in monthly donors who wanted to help support the growing number of children benefiting from its game-based programs. The organization was one of the first to implement the Fundraising and Engagement offering, built on Microsoft Dynamics 365 Sales customer relationship management cloud software.<\/p>\n<p>Fundraising and Engagement is based on the nonprofit CDM and helps organizations gather analytics to better engage with constituents and donors, and fine-tune campaigns and marketing to drive donations. It is the first product, backed by Microsoft, that is designed specifically for non-profit organizations, which have a very different modus operandi from commercial organizations.<\/p>\n<p>Nonprofit organizations have to manage many forms of donations, programs, volunteers and donors, some of which give monthly and others sporadically or only at events. Custom solutions for all of that can cost millions of dollars for each group, Arnold said, but Microsoft&#8217;s investment &#8220;takes customization out of that equation.&#8221;<\/p>\n<p>Because the landscape of nonprofits is vast, from child sponsorship to climate change, Microsoft relies on its partners—firms that provide support for the company&#8217;s products or services—to manage &#8220;the last mile&#8221; of the adaptation and delivery of the Fundraising and Engagement system, commented Spelhaug.<\/p>\n<p>And through the Tech for Social Impact program, most charitable organizations — more than 4 million of them worldwide — qualify for free licenses for up to five Dynamics users and 10 PowerApps users, at a 75% discount. % additional. It&#8217;s a sustainable business model that ensures Microsoft partners can afford to provide the necessary software and ongoing support, but at an ethical price for nonprofits, Arnold said.<\/p>\n<p>In less than two years with the Fundraising and Engagement platform, Right To Play boosted the number of monthly donors from 100 to more than 3,000. And that was just the beginning of the group&#8217;s &#8220;total digital transformation,&#8221; said director Kevin Frey. It went from a “rudimentary system” of spreadsheets for financial and program information across 22 countries that often took staff weeks to compile “to a single system of truth,” Frey said. &#8220;It&#8217;s a different world for us.&#8221;<\/p>\n<p>Kevin Frey, director of Right To Play, meets with a group of children in Lebanon in 2019. (Photo by Right To Play)<\/p>\n<p>The platform freed up staff time and provided insights and analysis to better understand and retain donors, Frey said. And the group&#8217;s new ability to predict revenue has helped it operate with clear lines of sight for years to come, so it can reach many more children.<\/p>\n<p>Right To Play also started adopting Teams, OneDrive and SharePoint in 2019, so when COVID-19 hit the world, &#8220;we were able to turn around in a very short space of time thanks to the cloud,&#8221; Frey said. “For our work in rural Africa we are more connected now than before COVID, because Teams has allowed us to become a community.”<\/p>\n<p>Janine Ayoub, director of Right To Play in Lebanon, says that she and her 21 team members use all those tools on their smartphones, which are more stable than computers amid daily power outages, to serve more than 15 thousand Palestinian and Syrian refugee children, scattered in camps throughout the country. Through the pandemic and the tragic explosion in Beirut in August 2020, staff and volunteers were able to quickly communicate and access information to make decisions about how to best help children and their parents, teachers and coaches.<\/p>\n<p>As HIAS helps people escape prosecution, it developed a new case management solution built on Dynamics 365 to help keep its vulnerable clients safer as they seek help.<\/p>\n<p>Waiting rooms at HIAS&#8217;s Nairobi offices are often filled with refugees applying for assistance, but previously the lengthy intake process meant staff were often unable to process everyone at the end of the day. That was not only a risk for the refugees by having to travel around the city several times (gender-based violence, in particular, has been on the rise), but it also meant that some would try other HIAS offices, generating inflows. duplicates and confusion.<\/p>\n<p><img class=\"size-full wp-image-115034\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653817544_659_How-technology-empowers-nonprofits-during-a-crisis-to-help-more.jpg\" alt=\"A woman in front of a computer surrounded by people\" width=\"1024\" height=\"683\" \/>Lucy Juwa assists refugees seeking help from HIAS in Nairobi. (Photo by Brian Otien\/HIAS)<\/p>\n<p>The organization began using the new Dynamics platform in May for its operations in Kenya and quickly reduced the time for caseworkers to process new entries by 80%, and the time to retrieve information from existing cases in a 40%, thanks to the standardization of the system.<\/p>\n<p>“We want to provide services quickly so that people don&#8217;t have to move around a lot and put themselves in danger,” said Rui Lopes, director of information at HIAS. “We see huge gains that this system has started to deliver in Nairobi. That time translates into helping more beneficiaries.”<\/p>\n<p>Now HIAS has begun to implement it in the other 15 countries it serves and hopes that &#8220;it spreads in a positive way,&#8221; Lopes said. The case management system initiative is “our crown jewel right now. It is the cornerstone in our digital transformation strategy and plans.”<\/p>\n<p>In Oregon, The Contingent was an early adopter of Dynamics and CDM, said Ben Sand, director of the organization. This put the group in the unique position of being able to adapt and respond to major challenges across the state in just a few short months this year.<\/p>\n<p><img class=\" wp-image-115035\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653817545_866_How-technology-empowers-nonprofits-during-a-crisis-to-help-more.jpg\" alt=\"Two women and two men in a row, they smile and give their thumbs up\" width=\"340\" height=\"319\" \/>Closest to Farthest: The Contingent&#8217;s Ben Sand, Brooke Gray, Renita Williams and Peter Kim (Photo courtesy of The Contingent)<\/p>\n<p>“The week before the pandemic really hit Oregon, everything felt bleak. There was desperation, a frenzy around what was starting to take hold, and the state Department of Human Services really expected us to help families, as other nonprofits didn&#8217;t have a robust response to the need,” recalls Brooke Gray , who leads the nonprofit&#8217;s Every Child program.<\/p>\n<p>“We had a team meeting on a Friday and decided that we were going to go into that space and offer ways for neighbors to respond to the needs that existed in their community. And 36 hours later, we were able to build an emergency response platform.”<\/p>\n<p>The new MyNeighbOR platform, with the last two letters capitalized for the Oregon postal abbreviation, allows foster families or children to enter their needs, and for people in the community to see those requests and respond. Peter Kim, chief technology and data officer at The Contingent, and also their sole IT employee, built My Neighbor OR on Dynamics, to connect people by zip code, across the state, all from his living room.<\/p>\n<p>A few months after the pandemic shut down the state, overnight anti-racism protests began in Portland, soon followed by devastating wildfires that forced mass evacuations and burned down homes.<\/p>\n<p>“We got better and better and it became a way to meet the tangible needs of families and walk alongside children who have struggled with trauma in this difficult season,” Gray said.<\/p>\n<p>Sand credits The Contingent&#8217;s stability and responsiveness to &#8220;trust in Dynamics, that the tool has the flexibility and agility to do it all.&#8221; He and his team envision eventually sharing their systems with other nonprofits and agencies amid efforts to improve foster care across the country.<\/p>\n<p>Meanwhile, Nelson&#8217;s gratitude to his neighbors, and to My NeighbOR, continues to grow. A few days ago, someone offered through the program to pay the delivery fee for furniture donated by a community store, and she received a sofa and a bed, which means she no longer has to sleep on a single chair in the living room. she.<\/p>\n<p>&#8220;We&#8217;ve been through a lot, and a lot has changed this year, I&#8217;m still trying to process all of this,&#8221; Nelson said. “But we have received a lot of help and we have not felt alone.”<\/p>\n<p>Main image: Samantha Nelson with her children, JayLynn, 9, and Landon, 8. (Photo by Brady Holden)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Microsoft designed the Common Data Model for Nonprofits (CDM) in 2018 to help organizations connect data across all applications and platforms. The CDM addresses specific data needs unique to nonprofit workflows, such as fundraising, constituent management, program delivery, overhead rate calculation, and the ability to report to donors about its impact. It also sets a [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1445,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1441"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1441"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1441\/revisions"}],"predecessor-version":[{"id":1680,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1441\/revisions\/1680"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1445"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1441"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1441"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1441"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}