{"id":1446,"date":"2022-05-29T10:17:57","date_gmt":"2022-05-29T10:17:57","guid":{"rendered":"https:\/\/infobloom.site\/the-director-of-the-most-important-hospital-in-germany-dies-when-he-jumps-from-a-building-after-admitting-that-vaccines-are-a-scam\/"},"modified":"2022-05-29T10:17:57","modified_gmt":"2022-05-29T10:17:57","slug":"the-director-of-the-most-important-hospital-in-germany-dies-when-he-jumps-from-a-building-after-admitting-that-vaccines-are-a-scam","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-director-of-the-most-important-hospital-in-germany-dies-when-he-jumps-from-a-building-after-admitting-that-vaccines-are-a-scam\/","title":{"rendered":"The director of the most important hospital in Germany dies when he jumps from a building after admitting that vaccines are a scam"},"content":{"rendered":"<p>A few days ago, the tragic death of Dr. Thomas Jendge, director of one of the most important clinics in Germany, was reported in some media. <strong>The expert took his life by throwing himself into the void from the roof of the hospital.<\/strong><\/p>\n<p>However, his death raises several questions and many say it was not a suicide.  The cause of all this commotion is a video that Dr. Jendge had published a video that as our readers have been able to imagine has been censored.<\/p>\n<p><\/p>\n<p>In the video<strong>talks about the global scam that COVID vaccines represent, and invites people to protest against the dictatorship that is taking shape around the world.<\/strong> Below is the transcript of this video.<\/p>\n<p>Transcription begins:<\/p>\n<blockquote class=\"wp-block-quote\">\n<p>&#8220;About what&#8217;s going on right now.  Germany… I can sum it up honestly, as a doctor, as a vaccinator, as someone who has treated people with ear, nose and throat infections all his life, I can only repeat that what is happening here has nothing, absolutely nothing to do with with a virus.<\/p>\n<p>It is about, throughout the world, the implantation of a world dictatorship, unfortunately it must be said.<\/p>\n<p>In the last month, I have spent 1,500 hours observing the situation because I knew it had nothing to do with anything medical.  I couldn&#8217;t understand what was going on, there are so many interconnected goals….  and last week in Spever, they asked me.  I spoke in front of 1,000 people -although I had never spoken in front of people before-, I never dared, I never had the courage to do it….but it has reached a point where…<\/p>\n<p>It is so incomprehensible what is happening….  and everyone is dancing to the same rhythm with each other.<\/p>\n<p>And yes….and whoever it is still can&#8217;t believe it… that we have a dictatorship… there is no other way to say it.<\/p>\n<p>…of course it is being disguised….of course it is happening gradually,….but that people have to….by completely disproportionate measures….literally- take to the streets to protest for the restoration of their basic rights…our ancestors they wrote these exact rights into our basic laws and what they are now doing there.<\/p>\n<p>Many people won&#8217;t notice and wonder, &#8220;What&#8217;s all the fuss about?&#8221;<\/p>\n<p>Well, I can only say that courage, anger and a big heart… that&#8217;s what unites us, and all of this has nothing, absolutely nothing to do with a virus.<\/p>\n<\/blockquote>\n<p>Despite being an important person with great influence in the country, few media have reported his death.  As always, the elites seek to silence the truth, however, it is becoming increasingly difficult for them.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A few days ago, the tragic death of Dr. Thomas Jendge, director of one of the most important clinics in Germany, was reported in some media. The expert took his life by throwing himself into the void from the roof of the hospital. However, his death raises several questions and many say it was not [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1448,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1446"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1446"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1446\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1448"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1446"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1446"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1446"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}