{"id":146,"date":"2022-05-03T16:01:52","date_gmt":"2022-05-03T16:01:52","guid":{"rendered":"https:\/\/infobloom.site\/nfts-daos-and-the-importance-of-roadmaps-cryptotech-university\/"},"modified":"2022-05-03T16:01:52","modified_gmt":"2022-05-03T16:01:52","slug":"nfts-daos-and-the-importance-of-roadmaps-cryptotech-university","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nfts-daos-and-the-importance-of-roadmaps-cryptotech-university\/","title":{"rendered":"NFTs, DAOs and the importance of roadmaps » CryptoTech University"},"content":{"rendered":"<p style=\"float:right;margin:0 0 10px 15px;width:240px\"><\/p>\n<p>A deep dive into the worlds of non-fungal tokens and decentralized autonomous organizations, and how they can benefit each other.<\/p>\n<p>can this jpeg have sex with this jpeg and create a new baby jpeg?  What do they say?  “When CryptoPunks started in 2017, they looked pretty stupid.  They were only 128 X 128 pixels.  Who cares?  They weren&#8217;t really great until Gary Vee had a mastermind.&#8221;  called with influencers and said, &#8220;Crypto Punks are going to be huge, so go get a bunch of them.&#8221;  They came in and hit the market and pushed prices up.<\/p>\n<p>Bored Apes was around the same time that Gary launched his project.  They got big influencers together and said, &#8220;Let&#8217;s do it.&#8221;  And so they bought them all, prices rose over time.  At one point these cost 2 Ether (ETH).  That was a lot then!  Now the floor is like 80 ETH.  All of these NFTs (CryptoKitties, CryptoPunks, and Bored Apes) made a lot of money.<\/p>\n<p><strong>Related: <\/strong><strong>Which NFT collection has been the most profitable?<\/strong><\/p>\n<p>When I spoke with Gary in early 2021 when he was thinking about NFT, we discussed launching on Wax, which is a specific blockchain for NFT.  It&#8217;s like WalMart, but for NFTs.  NFTs are much cheaper on Wax than on Ethereum.  Gary would go on to do a great job of raising $90 million on his account and putting it into ETH.  I just don&#8217;t really like that gas cost in ETH, it&#8217;s a huge loss.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/NFTs-DAOs-and-the-importance-of-roadmaps-CryptoTech-University.png\"\/><\/p>\n<p>I began to see the consequences of what could happen with NFTs.  Many people see NFTs as ordinary images;  they are just jpegs, nothing more than a screenshot.  There&#8217;s a lot more to NFTs than that, because they can really unlock experiences for you.  NFTs represent the next level of digital rights management.  Essentially, you can have NFT video, images, text, audio, links, AR, VR, 360 video, and it can be a combination of all of those.  They can unlock certain locations based on geographic proximity, etc.<\/p>\n<p>An NFT can also evolve over time.  You could have a small baby NFT, maybe a small baby egg, which then turns into a baby dinosaur.  Then he becomes a small dinosaur, an adult dinosaur, and can fit in with other dinosaurs and have a baby dinosaur.  The cycle starts everywhere.  The stronger and more powerful the dinosaur, or a particular line of dinosaurs, the more valuable.  Believe it or not, there are plenty of real-world applications for this.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1651593711_972_NFTs-DAOs-and-the-importance-of-roadmaps-CryptoTech-University.png\"\/><\/p>\n<p>There are also more utilities for NFT.  If you have this NFT in your wallet and can prove it&#8217;s yours, maybe you can go backstage at a concert.  There are many loyalty rewards that can be made with these NFTs.  When a gang comes to your town, they might leave something in your bag, giving you an extra experience.<\/p>\n<p><strong>Related: <\/strong><strong>We haven&#8217;t even started to exploit the potential of NFTs<\/strong><\/p>\n<p>An NFT is basically a programmable smart contract that can do anything you can imagine.  It&#8217;s not just a JPEG file, it&#8217;s proof of ownership that it&#8217;s an item of yours.  The surface is not scratched yet when it comes to NFTs.<\/p>\n<p>If you have an NFT, you are now part of the community of people who have these particular NFTs.  You can enter the blockchain and see everyone who is with you in this community – your other NFT holders.  You can then drop them some more.  These communities are best organized as DAOs.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1651593712_376_NFTs-DAOs-and-the-importance-of-roadmaps-CryptoTech-University.png\"\/><\/p>\n<h2>DAO<\/h2>\n<p>A DAO is a decentralized autonomous organization, which has no employees, no boss, no headquarters (physical location), no place where you can call and speak to someone to complain.  Sorry Karen, it&#8217;s a DAO.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1651593712_254_NFTs-DAOs-and-the-importance-of-roadmaps-CryptoTech-University.png\"\/><\/p>\n<p>The code is managed in DAO.  Let&#8217;s say there are three DAO members.  Each of us has the right to vote and participate in the DAO because we have that NFT.  We can participate in the board of that particular organization.  Not all DAOs need an NFT.  Similarly, not all DAOs need a crypto token.  However, if you have X number of tokens, you can have a certain level of voting.  Alternatively, if you have a certain NFT or a certain amount of NFT, you can also have a voice power level.  It&#8217;s a secure voting method of running an organization unlike anything the world has ever seen before.<\/p>\n<p><strong>Related: <\/strong><strong>The DAO is an important concept by 2022 and will affect many industries<\/strong><\/p>\n<p>These types of organizations will not only have three people in them.  They will have thousands.  If you have a particular NFT within said organization, you will have more voting power, which will correlate to your NFT holdings (either a specific NFT level or the number of NFTs you hold).  DAOs will operate completely differently than traditional organizational hierarchies, which from the bottom have an employee, a manager, a director, a vice president, a president, a CEO, and perhaps a president.  In a DAO, none of that exists.<\/p>\n<p>A DAO is an organization governed by code rather than leaders.  That&#8217;s a paradigm shift when you consider the fact that these are algorithms and smart contracts replacing those traditional business structures.  They are autonomous in many ways;  if it happens, then.<\/p>\n<p>Smart contracts need to be automated and enforce certain rules.  For example, smart contracts can be useful if you are a freelancer trying to complete work for a client.  What if, when the work is done, the smart contract itself is generated, executed, and you get paid immediately?  How good is that compared to 30 days of having to wait until January in accounting to finally get to you thirty days later?<\/p>\n<p>Currently, the largest platform for NFTs and DAOs is Ethereum.  After all, it was the first smart contract platform ever built.  You can execute code based on what you write in the contract;  if this, then that.  It eliminates many problems experienced in the digital realm, in particular.  It eliminates the need for trust and intermediaries.  Most companies will want some kind of smart contract to run within their company.<\/p>\n<p>There will be no fraud in a DAO because it is on the blockchain and programmed in the code.  We know who has what NFTs or tokens, and the mood to which it corresponds.  It is indisputable, it is without trust.  It is the way of the future to vote in organizations.<\/p>\n<p>A driverless car is like a DAO.  It is autonomous, it drives itself in the city.  You can tell him to go to a particular place.  It will follow the instructions and check the path to keep you safe, all managed by code.  As long as you are clear on your code, it will execute what you have suggested.  The DAO brings a community component to NFT projects.  You can collaborate and contribute to the project.<\/p>\n<p>If you are going to create a DAO, make sure you have the right framework for legal management.  Andreessen Horowitz has a DAO legal framework that you can learn from.  Make sure to check it out.<\/p>\n<p><strong>Related: <\/strong><strong>Decentralization, DAO, and Current Web3 Concerns<\/strong><\/p>\n<h2>roadmaps<\/h2>\n<p>Roadmaps are important.  The utilities for your NFTs are important.  If you&#8217;re just doing an NFT series and the art looks great, some people will care.  A roadmap shows people that you have the necessary long-term plan for your project.  Roadmaps show that you care about a project, that you have long-term goals for the project, and ultimately that it&#8217;s not money.  Many of these NFT projects are quick money packages.  People see others making millions of dollars in NFT and they want that piece and then they walk away.  That&#8217;s not good for the community.<\/p>\n<p>A roadmap describes quarter by quarter where the project will lead.  In Q1 we do this.  In Q2 we do that.  And guess what?  You won&#8217;t believe what we&#8217;re doing in 2023. Having ideas of where you&#8217;re going will show your community that you&#8217;re serious and it&#8217;s not a scam.  Sometimes projects that seemed very legit got huge audiences, sold out, and delivered nothing.  They just took the money and ran away.  That&#8217;s a rug, and they&#8217;re horrible.  Major NFT projects in 2022 have roadmaps.<\/p>\n<p>In the future, projects will not only have a roadmap, but will also have a utility outside of the artwork.  We are already starting to see NFTs with better capabilities than the first generations.  For example, the concept of how NFTs fit into the metaverse has been incorporated.  They will be more than just a profile picture, which has been a lot of NFT projects.<\/p>\n<p><strong>Related: <\/strong><strong>Increased Metaverse NFT Adoption Will Drive Next NFT Growth Cycle<\/strong><\/p>\n<h2>Note to investors<\/h2>\n<p>If you are an investor, only invest in NFT projects where the team is well known and has misled itself.  You can go to the social media profiles of individual team members and see if they are public and active, including directors and lead developers, in particular.  But also the marketing team, etc.  Many current NFT projects hide behind fake avatars and names, and I think that will change. <\/p>\n<p>Whether you launch or invest in an NFT, you don&#8217;t need to know all the NFTs out there – take a deep breath.  Many may not be relevant to you and your business model.  However, there is this element of loyalty and ownership that can engage many in the audience, and you don&#8217;t want to miss out on what could be a valuable opportunity. <\/p>\n<p class=\"post-content__disclaimer\">This article does not contain any investment advice or recommendation.  Every investment and trading move involves risk, and readers should do their own research when making a decision.<\/p>\n<p class=\"post-content__disclaimer\">The views, opinions and opinions expressed in this document are solely those of the author and do not necessarily reflect or represent the views and opinions of CryptoTech.<\/p>\n<p><strong>travis wright<\/strong> is a prominent marketing technologist, writer, keynote speaker, blockchain consultant, tech journalist, and growth hacker.  He is the former Symantec Global Digital and Social Strategist for the Norton brand.  Wright is the author of Digital Sense: The Common Sense Approach to Effectively Combining Social Business Strategy, Marketing Technology, and Customer Experience.  With Joel Comm, Wright co-hosts two of Apple&#8217;s Top 100 Business and Technology Podcasts, The Evil Cryptopodcast is The Witty Show.  Wright sits on the Wax Advisory Board.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A deep dive into the worlds of non-fungal tokens and decentralized autonomous organizations, and how they can benefit each other. can this jpeg have sex with this jpeg and create a new baby jpeg? What do they say? “When CryptoPunks started in 2017, they looked pretty stupid. They were only 128 X 128 pixels. Who [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":152,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/146"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=146"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/146\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/152"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=146"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=146"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=146"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}