{"id":1483,"date":"2022-05-29T12:59:15","date_gmt":"2022-05-29T12:59:15","guid":{"rendered":"https:\/\/infobloom.site\/yonder-media-mobile-and-horizon-fintex-launch-mobile-platform-for-the-exchange-of-nfts-minted-in-user-generated-content\/"},"modified":"2022-05-30T13:40:01","modified_gmt":"2022-05-30T13:40:01","slug":"yonder-media-mobile-and-horizon-fintex-launch-mobile-platform-for-the-exchange-of-nfts-minted-in-user-generated-content","status":"publish","type":"post","link":"https:\/\/infobloom.site\/yonder-media-mobile-and-horizon-fintex-launch-mobile-platform-for-the-exchange-of-nfts-minted-in-user-generated-content\/","title":{"rendered":"Yonder Media Mobile and Horizon Fintex Launch Mobile Platform for the Exchange of NFTs Minted in User Generated Content."},"content":{"rendered":"<p><i>Now everyone can take advantage while their assets shine.<\/i><\/p>\n<p>MEXICO CITY, April 12, 2022 \/PRNewswire\/ &#8212; Yonder Media Mobile Inc. (&#8220;YMM&#8221;), a provider of integrated mobile telecommunications and entertainment services, and Horizon Fintex (Horizon), a blockchain technology company that builds and operates digital securities markets, announced the launch of its mobile market for NFTs on an Ethereum Layer-2 blockchain within YMM&#8217;s YO Mobile platform. YO Mobile is available on iOS, Android, and the Huawei AppGallery; https:\/\/yomobile.com\/nft<\/p>\n<p>YO Mobile is a growing mobile experience that &#8220;<i>enables new types of organization and human behavior<\/i>&#8220;combining for the first time <b>connectivity<\/b><b>, <\/b><b>Contents<\/b><b>, <\/b><b>Community<\/b><b>, <\/b><b>and Trade<\/b> on a single platform.<\/p>\n<p>YO Mobile was launched in Mexico in mid-2021 and has more than 1 million registered &#8220;fans&#8221;, more than 100 thousand subscribers using the &#8220;YO Mobile&#8221; telephone network and more than 330 thousand Tik Tok followers, hooked by a world-class, highly differentiated product that more than 80% of people pay for partially with YOYO$ &#8211; an ERC-20 crypto currency minted and collected on the YO blockchain. <b>&#8220;<\/b><b>hooked<\/b><b>&#8221; = <\/b><b>the average user interaction is more than <\/b><b>200 <\/b><b>minutes<\/b> <b>up to date<\/b><b>!<\/b><\/p>\n<p>Starting in April 2022, YMM will launch the interconnected, tokenized, and gamified YOverse, in his optimistic view of the Ethereum Layer-2 blockchain, Adam Kidron, CEO of YMM, comments: <i>&#8220;<\/i><i>The full extent of our ambition, vision and madness will be revealed, as the YOverse is a mobile space of infinite realities, native to the internet, in which NFTs become objects of desire, democracy and evidence that you have participated in great events. A magical place where the more you play, the less you pay, and the more you and your community benefit.&#8221;<\/i><\/p>\n<p>Brian Collins, CEO of Horizon Fintex says, &#8220;<i>YO&#8217;s vision of a truly decentralized mobile experience, combined with an internet service layer and being one of the telecom operators in Mexico, is a true catalyst<\/i><i>.<\/i><i> The communities of creators in Mexico add value to the YO NFT market. They earn, spend or claim their crypto earnings and rewards, and can even buy mobile top-ups with YOYO$. This gives creators and artists on YO a space to showcase and benefit from their digital works using mobile NFT technology to build and engage with followers of their content.&#8221;<\/i><\/p>\n<p>YOverse features include:<\/p>\n<ul>\n<li>Zero crypto-gas fees for YOverse users when minting an NFT, collecting YOYO$ rewards, and in-app NFT\/YOYO$ trading.<\/li>\n<li>NFTs (ERC-721) minted in games, songs, videos, stored in a wallet of your YO profile within the app, exportable to OpenSea and other NFT markets compatible with ERC-721\/-1155.<\/li>\n<li>A mobile Ethereum crypto-wallet within the app, for a seamless Web3 experience without Layer-2 and Ethereum Layer-1 custody.<\/li>\n<li>A single in-app sign-on (SSO) Web3 that enables frictionless travel, proof of attendance (PoAP), and decentralized autonomous organization (DAO).<\/li>\n<li>Content Generation by Users (GCU) for the creation of NFTs, and auction of YOYO$ in the YOverso.<\/li>\n<li>Issuance of rewards in Ethereum ERC-20 token (YOYO$), and NFT purchases within the app.<\/li>\n<li>A YOYO$ Web3 decentralized finance (DeFi) exchange with attractive staking and earning Annualized Percentage Yields (APY).<\/li>\n<li>Secure entry of YOYO$ (ERC-20) and YOverse NFT (ERC-721) Layer-1 &lt;&gt; Layer-2<\/li>\n<li>GameHub and BuildABubble SDKs that encourage everyone to build experiences in the YOverse (Bubbles, which are our experience spaces, mini-apps or planets).<\/li>\n<li>YO Mobile is the teleporter to a new, improved and hopefully more democratized world.<\/li>\n<\/ul>\n<p><b>About<\/b><b> Yonder Media Mobile <br class=\"dnr\" \/><\/b>Yonder Media Mobile, Inc., is a Delaware corporation, (USA) founded in 2018, with a team of more than 70 brilliant creatives, developers, producers, support staff and managers, located in the US, Mexico, and Europe.<\/p>\n<p>The YMM team developed YO Mobile, a super-duper app with Telco heart (&#8220;Mobile Virtual Experience Platform&#8221;) + entertainment soul combining Connectivity, Content, Community, and eCommerce-enabled blockchain in a single mobile platform for the first time.<\/p>\n<p>The next step is the YOverse…you must be there!<\/p>\n<p><b>About<\/b><b> Horizon Fintex <br class=\"dnr\" \/><\/b>Horizon Fintex is a fintech that builds and powers digital equity markets with an integrated Ethereum blockchain software suite for compatible issuance, management, and secondary trading of securities. Its in-house solutions combine Wall Street and Silicon Valley to power the next generation of security and exchange offerings in the United States and around the world. Learn more at https:\/\/horizonfintex.com\/ and https:\/\/raneum.com\/.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Now everyone can take advantage while their assets shine. MEXICO CITY, April 12, 2022 \/PRNewswire\/ &#8212; Yonder Media Mobile Inc. (&#8220;YMM&#8221;), a provider of integrated mobile telecommunications and entertainment services, and Horizon Fintex (Horizon), a blockchain technology company that builds and operates digital securities markets, announced the launch of its mobile market for NFTs on [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1484,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1483"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1483"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1483\/revisions"}],"predecessor-version":[{"id":1676,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1483\/revisions\/1676"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1484"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1483"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1483"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1483"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}