{"id":1489,"date":"2022-05-29T14:03:46","date_gmt":"2022-05-29T14:03:46","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-and-how-not-to-go-bankrupt-in-the-attempt\/"},"modified":"2022-05-29T14:03:46","modified_gmt":"2022-05-29T14:03:46","slug":"what-are-nfts-and-how-not-to-go-bankrupt-in-the-attempt","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-and-how-not-to-go-bankrupt-in-the-attempt\/","title":{"rendered":"What are NFTs and how not to go bankrupt in the attempt"},"content":{"rendered":"<p><\/p>\n<p>Non-Fungible Tokens (NFT) are essentially digital art.<\/p>\n<p><\/p>\n<p>A look at Internet search engines during 2021 shows that <b>the term NFT was one of the most consulted worldwide<\/b> and, although the cryptocurrency market in general is in the red so far in 2022, <b>interest in them continues to grow.<\/b><\/p>\n<p>As is often the case in the world of investments in general, as the demand for a certain asset grows, so do scams and projects that can end up being a waste of money and time for the investor.<\/p>\n<p>Before deciding to allocate capital to a collection of NFTs, it is essential to know what those characteristics are that can make them last and grow in value over time.<\/p>\n<p><b>1. Digital art<\/b><\/p>\n<p>The <b>Non-Fungible Tokens <\/b>(NFT) in essence are digital art.<\/p>\n<p>A good analogy is to look at NFTs the same as the works of great artists, such as <b>Pablo Picasso<\/b> either <b>Vincent van Gogh<\/b>.  Many of these pieces have a <b>subjective value<\/b> for the most critical of art and those who acquire them seek to collect them over time.<\/p>\n<p>Some works of this digital art work the same way and owners are just buying a collectible item.  Today many renowned artists have migrated their creations to this technology.<\/p>\n<p><b>2. Community<\/b><\/p>\n<p>This market has evolved and today is compared more with the <b>shares of a club<\/b>.  Its value increases as the facilities are maintained, the demand for <b>more people who want to enter<\/b> and they do great <b>events for your partners.<\/b><\/p>\n<p>On the other hand, the person who buys an NFT collection, but <b>you do not feel identified with your community, you may be losing money<\/b>.  Nobody buys a share in a golf club if they are not going to play.<\/p>\n<p>There are collections of NFTs that give you access to comedy groups, poker games or contact with a famous personality.  Beyond the monetary value of the collection, you have to look for it <b>utility related to self-interest.<\/b><\/p>\n<p><b>3. Team<\/b><\/p>\n<p>As in any investment and cryptocurrency project, it is important to know who is behind it.  Being able to answer questions <b>Why?  And for what?<\/b> by the development team is <b>key to know the direction of the project<\/b>.  Studying the roadmap and understanding the different phases is essential.<\/p>\n<p>lean on the <b>social networks<\/b> to find out what users say, both about the equipment and about the collection that is about to come out or that is already on sale, is a <b>very faithful thermometer of market sentiment.<\/b><\/p>\n<p>It&#8217;s always caring<b> study and research<\/b>there is a lot of talk about NFTs, new projects come out every day and <b>many of them do not pass the semester<\/b> of duration. <b>Avoid the FOMO<\/b> it is crucial for a smart investment.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Non-Fungible Tokens (NFT) are essentially digital art. A look at Internet search engines during 2021 shows that the term NFT was one of the most consulted worldwide and, although the cryptocurrency market in general is in the red so far in 2022, interest in them continues to grow. As is often the case in the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1490,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1489"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1489"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1489\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1490"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1489"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1489"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1489"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}