{"id":1498,"date":"2022-05-29T15:40:40","date_gmt":"2022-05-29T15:40:40","guid":{"rendered":"https:\/\/infobloom.site\/of-course-instagram-is-doing-nft\/"},"modified":"2022-05-30T13:39:23","modified_gmt":"2022-05-30T13:39:23","slug":"of-course-instagram-is-doing-nft","status":"publish","type":"post","link":"https:\/\/infobloom.site\/of-course-instagram-is-doing-nft\/","title":{"rendered":"Of course, Instagram is doing NFT&#8230;"},"content":{"rendered":"<p class=\"gt-block\"><strong>You&#8217;ll soon be able to buy, sell and mint NFTs on Instagram, according to Mark Zuckerberg<\/strong><\/p>\n<p class=\"gt-block\">the relatively <strong>modern NFT phenomenon<\/strong>Although it still garners a lot of press coverage, it seems to be fading ever so slightly. Just a few months ago, you couldn&#8217;t open a website without seeing at least one headline that referenced NFTs.<\/p>\n<p class=\"gt-block\">As the NFT market has evolved in recent years, interest in these unique digital assets has grown. Most people still have zero interest in NFTs as an investment, but we now live in a world where <strong>an NFT sold at Christie&#8217;s auction for $69 million<\/strong>.<\/p>\n<p class=\"gt-block\">Many technology companies <strong>including Fortnite<\/strong>, have categorically stated that they have no plans to support or &#8220;do&#8221; NFTs. According to the CEO of Fortnite, the possibility of its users being scammed is too great a risk today. Not so much for Mark Zuckerberg, though: he recently discussed plans to bring NFTs to Instagram.<\/p>\n<h2><strong>NFTs are coming to Instagram<\/strong><\/h2>\n<p>Wherever there is a breath of money, Zuckerberg will not be far behind. After buying up most of the internet for the last decade, Mr. Social Network is now in the process of monetizing them, for better or worse.<\/p>\n<p class=\"gt-block\">Instagram, arguably The Zuck&#8217;s most popular property, has gone through many changes under Facebook&#8217;s tenure, <strong>most of them bad<\/strong>, and the next phase in the genesis of the photo app appears to be NFT. Here&#8217;s a statement from Mark Zuckerberg about Meta&#8217;s plans to bring NFT to Instagram.<\/p>\n<blockquote class=\"wp-block-quote\">\n<p class=\"gt-block\"><strong>We are working to bring NFTs to Instagram in the short term. I&#8217;m not ready to announce exactly what it will be today. But in the coming months, the ability to incorporate some of your NFTs will hopefully eventually be able to mint things within that environment. I hope you know, the clothes your avatar wears in the metaverse, you know, can basically be coined as an NFT and you can wear it between your different places. There&#8217;s a lot of technical stuff that needs to be worked out before it actually happens smoothly.&#8221; mark zuckerberg<\/strong><\/p>\n<\/blockquote>\n<p>So, there you have it: NFTs are coming to Instagram. Zuckerberg was also careful to remind people that Facebook&#8217;s Metaverse already has NFTs, as if this were something that would magically draw millions of new users to Mark Zuckerberg&#8217;s Brave New Online World. I&#8217;m still not very interested in the metaverse.<\/p>\n<h2><strong>How will NFTs work on Instagram?<\/strong><\/h2>\n<p>As noted above, Meta &#8211; that&#8217;s what Facebook is now called FYI &#8211; has to work out a bunch of technical stuff before NFTs go live on Instagram. You will first need to create a method to mint NFTs and track and store tokens. Presumably this will be done via the Ethereum blockchain.<\/p>\n<p>Once this is in place, Instagram will presumably need some kind of marketplace where users can list, browse, and view current NFTs that are for sale. Once again, it remains to be seen how this will work. It could simply function as an Instagram extension, like Instagram Business accounts for example, only here you will have an Instagram NFT Creator account or something similar.<\/p>\n<p class=\"gt-block\">Once these pieces are in place, users will be able to create and upload NFTs directly to Instagram, and once they&#8217;re added to Gram&#8217;s native marketplace, they&#8217;ll presumably start making sales. Zuckerberg seems to want to create an NFT marketplace within Instagram, a one-stop shop for <strong>buying and selling of NFTs<\/strong> If you want.<\/p>\n<p class=\"gt-block\">And given the size of Instagram&#8217;s user base, now in the BILLIONS, this move could create big problems for already established users. <strong>NFT Markets<\/strong> such as OpenSea, Axie Marketplace and Rarible. I mean, how do you compete with a social network that has over a billion active users? The short answer is no: they destroy you, more or less, overnight.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You&#8217;ll soon be able to buy, sell and mint NFTs on Instagram, according to Mark Zuckerberg the relatively modern NFT phenomenonAlthough it still garners a lot of press coverage, it seems to be fading ever so slightly. Just a few months ago, you couldn&#8217;t open a website without seeing at least one headline that referenced [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1500,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1498"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1498"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1498\/revisions"}],"predecessor-version":[{"id":1672,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1498\/revisions\/1672"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1500"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1498"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1498"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1498"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}