{"id":1503,"date":"2022-05-29T16:45:08","date_gmt":"2022-05-29T16:45:08","guid":{"rendered":"https:\/\/infobloom.site\/what-are-the-latest-trends-of-the-crypto-revolution\/"},"modified":"2022-05-30T13:39:11","modified_gmt":"2022-05-30T13:39:11","slug":"what-are-the-latest-trends-of-the-crypto-revolution","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-the-latest-trends-of-the-crypto-revolution\/","title":{"rendered":"What are the latest trends of the crypto revolution"},"content":{"rendered":"<p>The main axis of the event revolves around the #BUIDLATHON, which consists mainly of <strong>a hackathon where teams of developers compete for prizes and rewards (+2M US$) <\/strong>offered by the sponsors for the projects they build throughout the entire event.  In total, there are 30 places for the finalists among more than 1,000 projects that work to be presented in person and virtually.<\/p>\n<p><strong>In this 2022 edition, there were marked trends in projects related to NFTs<\/strong> (to find new uses), <strong>DAO&#8217;s<\/strong> (how they will be the fundamental pillar for the decentralized world) and, finally, <strong>DeFi<\/strong> (a trend already developed in the ecosystem that seeks new ways to make it even more scalable).<\/p>\n<h2><strong>Three trends that lead the way<\/strong><\/h2>\n<p>The collections of NFTs had their space in a gallery format where, at the same time, they were complemented with uses that people who have one can give them, beyond their monetary value.<\/p>\n<p><strong>From certifying the presence at an event with NFT, to the creation of DAOs<\/strong> to help independent artists boost their collections.<\/p>\n<p>20220224_134252.jpg<\/p>\n<p><\/p>\n<p>ETHDenver 2022: projects related to NFTs, DAOs and DeFi stood out in this edition.<\/p>\n<p>In that sense, <strong>the DAOs confirmed that they are very installed<\/strong> among the participants.  Many caliber projects in the crypto ecosystem base their representation on decisions made by their DAO.  It is essential to highlight the community that is generated around this, giving it decision-making power and full influence of where they want the project to go. <strong>A disruptive model that is still unknown to many people<\/strong>.<\/p>\n<p>Finally, <strong>several projects worked on scalability improvements for DeFi<\/strong>.  It was taken from different angles: for experienced traders, institutional investors, to improve existing solutions, and also for easy accessibility to those who are not using DeFi products today.<\/p>\n<h2><strong>Cryptocurrencies to pay taxes in Colorado<\/strong><\/h2>\n<p>Finally, the great news of the meeting came from the hand of the <strong>State of Colorado<\/strong>where the city of Denver is located, since during the conference they announced that <strong>plans to start accepting cryptocurrencies for tax payments<\/strong>.<\/p>\n<p>In fact, the State had already shown its favorable inclination towards blockchain technology, implementing it in the government infrastructure years ago.<\/p>\n<p>In the words of Governor Jared Polis himself: <strong>“We are promoting Colorado as the center of the crypto economy.”<\/strong><\/p>\n<p>In short, everything that happened during ETHDenver 2022 shows that the crypto future is imminent, teaching us that <strong>more and more societies decide to bet on blockchain technology<\/strong> to apply it in different fields (entertainment, business, economy and much more).<\/p>\n<p><strong>   <\/strong><\/p>\n<p>The author is director of Business Development for Lemon and participated in the event in Denver.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The main axis of the event revolves around the #BUIDLATHON, which consists mainly of a hackathon where teams of developers compete for prizes and rewards (+2M US$) offered by the sponsors for the projects they build throughout the entire event. In total, there are 30 places for the finalists among more than 1,000 projects that [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1505,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1503"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1503"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1503\/revisions"}],"predecessor-version":[{"id":1670,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1503\/revisions\/1670"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1505"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1503"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1503"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1503"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}