{"id":1517,"date":"2022-05-29T19:59:19","date_gmt":"2022-05-29T19:59:19","guid":{"rendered":"https:\/\/infobloom.site\/the-european-central-bank-will-create-nfts-to-withdraw-liquidity-from-the-markets-inocentada\/"},"modified":"2022-05-30T13:44:23","modified_gmt":"2022-05-30T13:44:23","slug":"the-european-central-bank-will-create-nfts-to-withdraw-liquidity-from-the-markets-inocentada","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-european-central-bank-will-create-nfts-to-withdraw-liquidity-from-the-markets-inocentada\/","title":{"rendered":"The European Central Bank will create NFTs to withdraw liquidity from the markets [INOCENTADA]"},"content":{"rendered":"<p><strong>Update<\/strong>: This entry is a joke on the occasion of April Fools&#8217; Day (December 28). Therefore its content is not true<\/p>\n<p>The Central Banks are in a very delicate moment. On the one hand they have injected <strong>strong amounts of liquidity in the markets<\/strong>, which is surely one of the causes (perhaps the main one) of the incipient inflation that we are seeing. However, withdrawing the stimulus could cause the collapse of economies that are still growing weakly.<\/p>\n<p>Given all this, the ECB has had an imaginative, innovative idea that will surely mark a before and after in the monetary policies that Central Banks have at their disposal: <strong>the issuance of NFTs<\/strong>.<\/p>\n<h2>NFTs as liquidity drainers<\/h2>\n<p>The classic way of draining the markets of liquidity has been through the sale of bonds. But if the ECB starts selling part of its incredible balance of bonds, the States would have problems financing themselves and interest rates would rise.<\/p>\n<p>That is when the ECB came up with a genius: take advantage of the NFTs (non-fungible tokens) fever to drain the economy of liquidity. They know that fans of NFTs buy everything that is traded and at incredible prices, so the idea of ​​the ECB is to create NFTs en masse and put them up for sale, in order to raise money without the need to sell classic financial instruments.<\/p>\n<p>At the moment there will be a small series: photos of euro banknotes, the video of <strong>Mario Draghi saying his classic &#8220;whatever it takes&#8221;<\/strong> or the document in which Trichett raised interest rates at the height of the crisis. But the President of the ECB, Christine Lagarde, has already said that this is only the beginning: &#8220;as if we have to take pictures of all the corners of our facilities, we are going to market NFTs like crazy; no matter what we put, everyone wants NFT&#8217;s.&#8221;<\/p>\n<h2>a new blockchain<\/h2>\n<p>When Lagarde was asked if these NFTs would be on Ethereum, he replied &#8220;Are we crazy? No way. <strong>Ethereum is the jurisdiction of the ECB<\/strong>. We will set up our own Blockchain, much better than those parodies of money. A centralized blockchain, as it should be.&#8221;<\/p>\n<p>The challenges of setting up a new Blockchain are great, but being centralized will surely be minor. The real challenge is that all this liquidity that the ECB is going to drain does not go to hiring engineers to program smart contracts.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Update: This entry is a joke on the occasion of April Fools&#8217; Day (December 28). Therefore its content is not true The Central Banks are in a very delicate moment. On the one hand they have injected strong amounts of liquidity in the markets, which is surely one of the causes (perhaps the main one) [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1518,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1517"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1517"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1517\/revisions"}],"predecessor-version":[{"id":1704,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1517\/revisions\/1704"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1518"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1517"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1517"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1517"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}