{"id":1573,"date":"2022-05-30T07:46:32","date_gmt":"2022-05-30T07:46:32","guid":{"rendered":"https:\/\/infobloom.site\/missed-calls-from-international-numbers-a-scam-warned-by-police\/"},"modified":"2022-05-30T13:42:48","modified_gmt":"2022-05-30T13:42:48","slug":"missed-calls-from-international-numbers-a-scam-warned-by-police","status":"publish","type":"post","link":"https:\/\/infobloom.site\/missed-calls-from-international-numbers-a-scam-warned-by-police\/","title":{"rendered":"Missed calls from international numbers, a scam warned by Police"},"content":{"rendered":"<p>There is always someone, somewhere in the world, hatching plans to get tricks and scams carried out in order to make money from the less cautious. That is why we warn of possible scams whenever they reach our ears and that is why we do it again now with <strong>the return of a system that the Police itself is denouncing<\/strong>.<\/p>\n<p>The authorities warn us to be careful if we find on our phone any <strong>missed call with an international prefix<\/strong> and that, under no circumstances, we return the call to these telephone numbers. In addition, being automated calls, the numbers can be very varied but the Police have been in charge of pointing out some of the conflicting prefixes.<\/p>\n<h2>Numbers with premium rate<\/h2>\n<p><\/p>\n<p>Receiving missed calls from these numbers may cause us to unknowingly return the call in order to find out the reason for the contact. We should never do it because it is about <strong>premium rate phones that will inflate our bill<\/strong> keeping us on the phone with, usually, automatic locutions whose sole purpose is to prevent us from hanging up too soon.<\/p>\n<p>Specifically, the Police speak of missed calls received from numbers in the Ivory Coast, Ghana, Nigeria, Albania and Bosnia, and in the comments to the authorities&#8217; tweet <strong>warn also of the prefix of Mali or Libya<\/strong>. Let&#8217;s see what prefixes they are so as not to return the call, not even out of curiosity, if we find &#8220;lost&#8221; from these countries.<\/p>\n<ul>\n<li>Ivory Coast &#8211; Prefix 225<\/li>\n<li>Ghana &#8211; Prefix 233<\/li>\n<li>Nigeria &#8211; Prefix 234<\/li>\n<li>Albania &#8211; Prefix 355<\/li>\n<li>Bosnia &#8211; Prefix 387<\/li>\n<li>Mali &#8211; Prefix 223<\/li>\n<li>Libya &#8211; Prefix 218<\/li>\n<\/ul>\n<p>Some mobile phones have the option of <strong>block calls from the menu itself<\/strong>, so we can stop receiving missed calls from these numbers as soon as we receive them. If our phone does not have this possibility, in the application store (Android) we find applications for these purposes such as Black List, Call Blocker or Calls Blacklist.<\/p>\n<h2>don&#8217;t call back<\/h2>\n<p>Unless the number is in your phonebook because it belongs to an acquaintance or relative, of course, in that case there will be no risk. But before unknown numbers, better to keep <strong>a defined pattern of action: do not return the call and block the number<\/strong>. When in doubt, it is better to stay with the intrigue than to incur expenses that, whether we claim it or not, will have occurred voluntarily on our part.<\/p>\n<p>This is our recommendation when it comes to protecting yourself against scams such as missed calls. As usual, <strong>the premise is to be careful<\/strong> with the numbers we dial so as not to incur additional unwanted expenses. In case new methods appear to make us fall for scams, we will try to warn you as soon as possible.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There is always someone, somewhere in the world, hatching plans to get tricks and scams carried out in order to make money from the less cautious. That is why we warn of possible scams whenever they reach our ears and that is why we do it again now with the return of a system that [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1575,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1573"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=1573"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1573\/revisions"}],"predecessor-version":[{"id":1687,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/1573\/revisions\/1687"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/1575"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=1573"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=1573"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=1573"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}