{"id":161,"date":"2022-05-03T17:10:20","date_gmt":"2022-05-03T17:10:20","guid":{"rendered":"https:\/\/infobloom.site\/nfts-daos-and-the-importance-of-roadmaps\/"},"modified":"2022-05-03T17:10:20","modified_gmt":"2022-05-03T17:10:20","slug":"nfts-daos-and-the-importance-of-roadmaps","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nfts-daos-and-the-importance-of-roadmaps\/","title":{"rendered":"NFTs, DAOs and the importance of roadmaps"},"content":{"rendered":"<p>Can this jpeg have sex with this jpeg and create a new baby jpeg?  Than?&#8221;  When CryptoPunks started in 2017, they seemed silly to many.  They were only 128px by 128px.  Who cares?  , get some of them.”  They came in and cornered the market and pushed prices up.<\/p>\n<p>Bored Apes was around the same time Gary started his project.  They got big influencers together and said, &#8220;Let&#8217;s get these.&#8221;  And everyone bought, prices rose over time.  These cost 2 Ether (ETH) at a time.  That was a lot back then!  Now the fund is like 80 ETH.  All of these NFTs (CryptoKitties, CryptoPunks, and Bored Apes) were making a lot of money.<\/p>\n<p><strong>Related: <\/strong><strong>Which NFT collection was the most profitable?<\/strong><\/p>\n<p>When I chatted with Gary in early 2021 while thinking about NFT, we discussed the launch of Wax, an NFT-specific blockchain.  It&#8217;s like WalMart but for NFTs.  NFTs are much cheaper on Wax than on Ethereum.  Gary would go on to do a great job raising $90 million just to get it onto ETH.  I just don&#8217;t like gas fees on ETH very much, it&#8217;s a big responsibility.<\/p>\n<p><\/p>\n<p>I was beginning to see the implications of what could happen with NFTs.  Many people see NFTs as mere images;  they are just jpegs, not unlike a screenshot.  NFTs have so much more to offer because they can really unlock experiences for you.  NFTs represent the next level of digital rights management.  Essentially, your NFT can be video, images, text, audio, links, AR, VR, 360 video, and a combination of all of these.  You can unlock specific locations based on geographic proximity, etc.<\/p>\n<p>An NFT can also evolve over time.  You can have a little NFT baby, maybe a little baby egg, which then turns into a baby dinosaur.  Then it turns into a small dinosaur, an adult dinosaur, and can mate with other dinosaurs and have a baby dinosaur.  The cycle begins again.  The stronger and more powerful the dinosaur or a certain lineage of dinosaurs, the more valuable.  Believe it or not, there are many real uses for it.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1651597820_880_NFTs-DAOs-and-the-importance-of-roadmaps.png\"\/><\/p>\n<p>There are also more utilities for NFT.  If you have that NFT in your wallet and can prove it&#8217;s yours, you might be able to go backstage at a concert.  There are many loyalty rewards that can be made with these NFTs.  If a gang comes to your town, they may drop something in your wallet, giving you an extra experience.<\/p>\n<p><strong>Related: <\/strong><strong>We haven&#8217;t even started to unlock the potential of NFTs yet<\/strong><\/p>\n<p>An NFT is basically a programmable smart contract that can do anything you can imagine.  It&#8217;s not just a JPEG file, it&#8217;s proof of ownership that an item is yours.  NFTs have yet to scratch the surface.<\/p>\n<p>If you have an NFT, you are now part of the community of people who have those specific NFTs.  You can enter the blockchain and see everyone who is in this community with you – your other NFT holders.  Then you could drop something on them too.  These communities are best organized as DAOs.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1651597820_549_NFTs-DAOs-and-the-importance-of-roadmaps.png\"\/><\/p>\n<h2>DAO<\/h2>\n<p>A DAO is an autonomous, decentralized organization that has no employees, no boss, no headquarters (physical location), and nowhere you can call and speak to someone to complain.  Sorry Karen, it&#8217;s a DAO.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1651597820_865_NFTs-DAOs-and-the-importance-of-roadmaps.png\"\/><\/p>\n<p>The code handles a DAO.  Let&#8217;s say there are three DAO members.  Each of us has the right to vote and participate in the DAO because we have these NFTs.  We can participate in the leadership of that particular organization.  Not all DAOs need an NFT.  Similarly, not all DAOs require a cryptographic token.  Either way, if you have X tokens, you can have a certain level of voting rights.  Alternatively, if you have a specific NFT or NFT number, you may also be entitled to vote.  It is a foolproof method of voting to govern an organization like the world has never seen before.<\/p>\n<p><strong>Related: <\/strong><strong>DAO is a major concept by 2022 and will revolutionize many industries<\/strong><\/p>\n<p>These types of organizations are not only made up of three people.  You will have thousands.  If you have a specific NFT within that organization, you will have more voting rights that correlate to your NFT holdings (either a specific level of NFT or the number of NFTs you own).  DAOs work very differently than traditional organizational hierarchies, which have an employee from the bottom up, a manager, a director, a vice president, a president, a CEO, and perhaps a president.  None of this exists in a DAO.<\/p>\n<p>A DAO is an organization governed by code rather than leaders.  That is a paradigm shift considering that it is algorithms and smart contracts that are replacing these traditional corporate structures.  They are done in many ways;  if that happens, then this.<\/p>\n<p>Smart contracts need to be automated and enforce certain rules.  For example, smart contracts can be useful when you are a freelancer trying to finish work for a client.  What if the smart contract is generated only after the work is done, you run it, and you get paid right away?  How unbelievable does that compare to having to wait 30 days for January in accounting to finally get to you more than 30 days later?<\/p>\n<p>The largest platform currently for NFTs and DAOs is Ethereum.  After all, it was the first smart contract platform ever built.  You can execute code based on what you write in the contract;  if this, then that eliminates many problems that are particularly common in the digital realm.  It eliminates the need for trust and intermediaries.  Most companies will want some kind of smart contract to run in their organization.<\/p>\n<p>There is no catch with a DAO as it resides on the blockchain and is programmed in code.  We know who has what NFTs or tokens and the vote that corresponds to them.  It&#8217;s undeniable, it&#8217;s trustworthy.  It is the way of the future to vote in organizations.<\/p>\n<p>A driverless car is like a DAO.  It is autonomous, it moves alone through the city.  You can tell him to go to a certain place.  It will follow instructions and monitor the path to keep you safe, all managed by code.  As long as you are clear on your code, it will do what you suggested.  The DAO brings a community component to NFT projects.  You can collaborate and contribute to the project.<\/p>\n<p>When creating a DAO, make sure you have the proper legal governance framework in place.  AndreessenHorowitz has a DAO legal framework that you can learn from.  Make sure to check it out.<\/p>\n<p><strong>Related: <\/strong><strong>Decentralization, DAO, and Current Web3 Concerns<\/strong><\/p>\n<h2>Schedule<\/h2>\n<p>Schedules are important.  The utilities for your NFTs are important.  If you&#8217;re in the process of creating an NFT series and the art looks great, few people will care.  A roadmap shows people that you have the necessary long-term plan for your project.  Roadmaps show that you care about a project, that you have long-term goals for the project, and that it&#8217;s not ultimately a money grab.  Many of these NFT projects are fast money.  People see other people making millions of dollars with NFTs and they want a piece of it and then they walk away.  This is not good for the community.<\/p>\n<p>A roadmap defines where the project will take quarter by quarter.  In Q1 we do this.  In Q2 we do. And guess what?  You won&#8217;t believe what we&#8217;re doing in 2023. Having an idea of ​​where you&#8217;re going shows your community that you&#8217;re serious and not a scam.  Sometimes projects that seem very legitimate have garnered huge audiences, sold out, and never been delivered.  They just took the money and ran away.  This is a carpet train and they are horrible.  Big NFT projects in 2022 will have roadmaps.<\/p>\n<p>In the future, projects will not only have a roadmap, but will also be useful beyond the artwork.  We are already seeing NFTs with better capabilities than the first generations.  For example, the concept of how NFTs fit into the metaverse has become popular.  You will be more than a profile picture, as many NFT projects have been.<\/p>\n<p><strong>Related: <\/strong><strong>Increased Metaverse NFT Adoption Will Drive Next NFT Growth Cycle<\/strong><\/p>\n<h2>Notice to investors<\/h2>\n<p>If you are an investor, only invest in NFT projects where the team is known and has misled itself.  You can go to each team member&#8217;s social media profile and see that they are public and active, especially executives and core developers.  But also the marketing team, etc.  Many current NFT projects hide behind avatars and fake names and I think that will change. <\/p>\n<p>Whether you&#8217;re starting an NFT or investing, you don&#8217;t need to know every NFT out there – take a deep breath.  Many may not be relevant to you and your business model.  Still, there is that element of loyalty and ownership that could attract a lot of listeners, and you don&#8217;t want to miss out on this potentially valuable opportunity. <\/p>\n<p class=\"post-content__disclaimer\">This article does not contain any investment advice or recommendation.  Every investment and trading move involves risk and readers should do their own research when making a decision.<\/p>\n<p class=\"post-content__disclaimer\">The views, thoughts and opinions expressed here are solely those of the author and do not necessarily reflect or represent the views and opinions of Cointelegraph.<\/p>\n<p><strong>travis wright<\/strong> is a prominent marketing technologist, author, keynote speaker, blockchain consultant, tech journalist, and growth hacker.  He is the former Symantec Global Digital and Social Strategist for the Norton brand.  Wright is the author of Digital Common Sense: The Common Sense Approach to Effectively Merging Social Business Strategy, Marketing Technology, and Customer Experience.  With Joel Comm, Wright hosts two of Apple&#8217;s Top 100 Business and Technology Podcasts, The Bad Cryptopodcast and The Posh Show.  Wright sits on the Wax Advisory Board.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Can this jpeg have sex with this jpeg and create a new baby jpeg? Than?&#8221; When CryptoPunks started in 2017, they seemed silly to many. They were only 128px by 128px. Who cares? , get some of them.” They came in and cornered the market and pushed prices up. Bored Apes was around the same [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":162,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/161"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=161"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/161\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/162"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=161"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=161"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=161"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}