{"id":171,"date":"2022-05-04T03:24:28","date_gmt":"2022-05-04T03:24:28","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-and-how-do-they-work-2\/"},"modified":"2022-05-18T11:50:03","modified_gmt":"2022-05-18T11:50:03","slug":"what-are-nfts-and-how-do-they-work-2","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-and-how-do-they-work-2\/","title":{"rendered":"What are NFTs and how do they work?"},"content":{"rendered":"<p><strong> <\/strong><\/p>\n<p>You have probably heard about the <b>NFT&#8217;s<\/b> but you may not be very clear about what it is. And it is not surprising because there are some concepts to know in order to fully understand the meaning of these acronyms. NFT comes from <b>&#8216;Non Fungible Token&#8217;<\/b> either <b>Non-expendable assets<\/b>, in Spanish. It is a kind of digital certificate that serves to prove the authenticity of a digital work, be it an image, a video, a gif, a text, etc. Specifically, NFTs are <b>stored data units <\/b>on blockchain. In other words, an NFT would be <b>a kind of certificate of authenticity<\/b>but instead of being a sheet of paper, it&#8217;s a single character string.<\/p>\n<p>When an NFT is minted, each sale of it is recorded on a blockchain (this is the same concept that powers cryptocurrencies like Bitcoin). This creates a kind of ledger with information about the property and price history. This record is known as provenance. Provenance is a basic concept also known as custody history within archival science.<\/p>\n<p>But, let us start at the beginning: <b>what does non-fungible mean? <\/b>To answer this question we must know that movable property can be<\/p>\n<h3>Expendable and non-expendable property<\/h3>\n<p><b>• Consumables: <\/b>those of which an adequate use cannot be made according to their nature without being consumed (for example, money).<\/p>\n<p><b>• Non-expendable:<\/b> The others, that is, those that are not consumed, as long as they are used appropriately.<\/p>\n<p>In this way, NFTs are non-fungible assets or tokens, which represent something unique and, therefore, <b>they are not mutually interchangeable<\/b>. This differentiates them from cryptocurrencies like bitcoin and many other utility or network tokens, which are fungible by nature.<\/p>\n<h3>Characteristics of NFTs<\/h3>\n<p><b>one. <\/b>They&#8217;re unique<\/p>\n<p><b>two.<\/b> They are indivisible<\/p>\n<p><b>3.<\/b> can be transferred<\/p>\n<p><b>Four. <\/b>Scarcity can be demonstrated<\/p>\n<p>NFTs are based on a technology that guarantees that a piece is an original work and dictates who owns it. Thanks to them, digital creations become an asset that collectors can buy and sell, guaranteeing their authenticity.<\/p>\n<h2>How to create NFTs<\/h2>\n<p>The process of creating a new NFT is called <b>coinage<\/b>. It is about turning a digital file into a digital asset on the blockchain.<\/p>\n<p>The most common is to do it in a <b>NFT market<\/b>. There are many where an NFT can be minted, verified, traded, or burned (destroyed). Among the most popular platforms are: OpenSea, Rarible, Superrare, Nifty Gateway and AtomicHub.<\/p>\n<p>Something important is that <b>to lie<\/b> (process of minting an NFT) <b>a purse or wallet is needed<\/b>. Wallets are the applications used to store cryptocurrencies and NFTs. Your wallet must be compatible with the blockchain you decide to mint your NFT on. MetaMask and Coinbase are two popular wallets, but there are many others.<\/p>\n<p>Keep in mind that when you mint an NFT you are not transferring <b>the copyright of the work, which remains with its original author<\/b>. That is, the authorship does not change. When selling the NFT, what is allowed is that the buyer can do business with it, unless they also make another agreement by which the copyright is transferred.<\/p>\n<p>As expected, there are people who are minting NFTs of works of which they are not authors, with the consequent damage to them.<\/p>\n<p>Once the NFT is a crypto asset, it can be traded on a digital market.<\/p>\n<h2>How to make money with NFTs<\/h2>\n<p>These are just two of the ways in which investment in NFT can be made profitable.<\/p>\n<p><b>1. NFT royalties: <\/b>When minting the NFT, conditions can be established such as imposing the payment of royalties each time the NFTs change hands in the secondary market. In other words, creators can earn passive income even after selling their creations to collectors. For example, if the royalty on a digital artwork could be 10% of the total sale price each time your work is resold to a new owner.<\/p>\n<p><b>2. Trading NFTs: <\/b>they can invest in NFTs by buying and selling them for a profit.<\/p>\n<h3>The challenges of NFTs<\/h3>\n<p>Although NFTs have many advantages, there are also some difficulties and barriers to overcome so that they can become a widespread product. Why?<\/p>\n<p><b>1. It is not physical:<\/b> As attractive as having NFTs is, they are still a digital asset that is not the same as having a physical sculpture or painting.<\/p>\n<p><b>2. Environmental impact: <\/b>Although few think about it, minting and transacting NFTs involves an important computer process that requires large amounts of energy. The electricity that is needed generates a lot of carbon emissions, as is the case with cryptocurrencies.<\/p>\n<p><b>3. Price volatility: <\/b>The prices of digital collectibles are subject to volatility, which opens the risk of losing money with the investment of NFTs.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>  You have probably heard about the NFT&#8217;s but you may not be very clear about what it is. And it is not surprising because there are some concepts to know in order to fully understand the meaning of these acronyms. NFT comes from &#8216;Non Fungible Token&#8217; either Non-expendable assets, in Spanish. It is a [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":172,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/171"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=171"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/171\/revisions"}],"predecessor-version":[{"id":596,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/171\/revisions\/596"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/172"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=171"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=171"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=171"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}