{"id":185,"date":"2022-05-04T09:44:36","date_gmt":"2022-05-04T09:44:36","guid":{"rendered":"https:\/\/infobloom.site\/banksys-bizarre-nft-scam\/"},"modified":"2022-05-04T09:44:36","modified_gmt":"2022-05-04T09:44:36","slug":"banksys-bizarre-nft-scam","status":"publish","type":"post","link":"https:\/\/infobloom.site\/banksys-bizarre-nft-scam\/","title":{"rendered":"Banksy&#8217;s bizarre NFT scam"},"content":{"rendered":"<ul class=\"body-ul\">\n<li>How much is the Internet worth?  Tim Berners-Lee sells an NFT of the code for 5.4 million<\/li>\n<li>Digital artist Beeple sells an NFT for 69 million: What exactly has he sold?<\/li>\n<\/ul>\n<ol\/>\n<p class=\"body-text\">The news is this: They pay 284,000 euros in Ethereum cybercurrency for a Banksy NFT (non-fungible token, the property right of a digital work) that turns out to be fake and the cyberthief returns the money to the scammer.  With a nuance: he keeps 5,800 euros (we&#8217;ll explain why shortly).  The hue is important.  Without the nuance you might think that one of two: Banksy has just been used by cybercriminals for an Internet scam or Banksy has taken advantage of the collective fever for NFTs to make a performance.  But the 5,800 euros is not very artistic to say.  So let&#8217;s stay with what is a cybercrime.  The sale did not exactly take place on the dark web.  The sale was made from Open Sea, a legal NFT auction platform that had been linked from the artist&#8217;s official website.  Banksy&#8217;s website had been hacked to include that link to the alleged piece of art, hence the collector was not suspicious: the sale was made on a platform, in principle, serious.  The problem is that Banksy had nothing to do with her.<\/p>\n<p>  This content is imported from Twitter.  You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n<\/p>\n<p class=\"body-text\">The NFT in question, titled the Great Climate Change Disaster Redistribution (sounds like a Houllebecq novel in a drawer), a very Banksy-esque name, showed a figure smoking in front of industrial chimneys, it was cool but not It was not at all the style of the artist.  The buyer thought it was Banksy&#8217;s way of adapting to new technology.  The buyer was not just any buyer, but Pranksy, a renowned collector within the token market, known above all for his collection of NBA Top Shots NFTs.  The fact that he was hosted on banksy.co.uk was the only reason the buyer made an offer.  He bid, and within an hour, the seller accepted his first offer.  As soon as the money disappeared, Pranksy suspected that he had been given a cat by Banksy.  When he went back to look for the link on Banksy&#8217;s official website, he was gone.  The news jumped to the BBC, an official Banksy spokesman made it clear that the artist had nothing to do with it, as well as that they had no record that their website had been hacked, and the cybercriminal automatically returned all the money to the collector in an act of cyber charity, except for the fee charged by the auction house for the transaction: a commission of 5,800 euros for the sale.<\/p>\n<p>  This content is imported from Twitter.  You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n<\/p>\n<p class=\"body-text\">If the dubious quality of the work wasn&#8217;t enough for the scammer to bite, perhaps the price of the NFT should have drawn the buyer&#8217;s attention.  If someone is willing to pay $69,346,250 for the right to own a digital work by an author little known to the general public, which is what the NFT paid for a digital artwork by Beeple (Mike Winkleman) a known artist, but without the prestige of Banksy&#8217;s works, getting a work by the street artist for less than 300,000 euros, that price was too attractive a bargain to be true.  <\/p>\n<p class=\"body-text\">The story is truly bizarre.  Why has the scammer returned the money if he had already taken it?  Because the scammer has not made any money (only the auction house that collected the transaction).  For pity?  It&#8217;s strange that he regrets it.  Because they could track him and he was afraid?  It is true that cryptocurrency transactions are recorded and you can see where the money is going, yes, but it is not so easy to know who owns it.  Also, if he is a professional cybercriminal, he will know how to access Banksy&#8217;s website and compromise it without leaving a trace that links him.  Was it all a performance?  Banksy could be behind it all and then refund the auction transaction money to the collector.  Although, if you think about it, what is worth more: a token or that Banksy himself has turned a human being into a token?  Did they want to teach this and the rest of the token collectors a lesson about the fragility of the incipient market?  In that case we would be talking about digital robin hoods.  Any explanation fits except the penalty.<\/p>\n<p>    This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses.  You may be able to find more information about this and similar content at piano.io<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How much is the Internet worth? Tim Berners-Lee sells an NFT of the code for 5.4 million Digital artist Beeple sells an NFT for 69 million: What exactly has he sold? The news is this: They pay 284,000 euros in Ethereum cybercurrency for a Banksy NFT (non-fungible token, the property right of a digital work) [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":186,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/185"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=185"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/185\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/186"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=185"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=185"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=185"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}