{"id":187,"date":"2022-05-04T10:05:20","date_gmt":"2022-05-04T10:05:20","guid":{"rendered":"https:\/\/infobloom.site\/nfts-and-everything-you-need-to-know-before-investing-in-them\/"},"modified":"2022-05-04T10:05:20","modified_gmt":"2022-05-04T10:05:20","slug":"nfts-and-everything-you-need-to-know-before-investing-in-them","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nfts-and-everything-you-need-to-know-before-investing-in-them\/","title":{"rendered":"NFTs and everything you need to know before investing in them"},"content":{"rendered":"<br \/>\n<h2 class=\"land-see-subtitle\">Non Fungible Token digital assets are approximations to Cryptocurrencies, unlike NFTs that cannot be traded.  NFTs are more geared towards collecting.<\/h2>\n<p>     April 30, 2022 6:54 p.m.<\/p>\n<p>If you want to enter this market either for interest in technology or for interest as an investment, it is important to understand the risks and benefits as you would with any asset.<\/p>\n<p>  Before you buy any digital asset, do your research and find out who is behind the projects,” said Jessica Tatievski.  |  computer today <\/p>\n<p>Works of art, wines, sporting goods, cards and tennis shoes are some of the objects that can be seen with the eyes of a collector or with those of an investor.  The <strong>NFT&#8217;s <\/strong>seem to add to that list of alternative collections or investments.<\/p>\n<h2>The unique properties of NFTs<\/h2>\n<p>If you want to increase the probability of buying an NFT with a promising value trajectory, check out the rarities.  The rarer the piece, the better it could fetch in the future, though it&#8217;s not a guarantee.<\/p>\n<h2>Verify the seller<\/h2>\n<p>Just like on twitter or Instagram, users on OpenSea, the largest NFT platform, have a blue check mark that certifies them as a verified and trustworthy account.  But it never hurts to take a dip in their networks to make sure they have a robust community made up of real people.<\/p>\n<h2>Check transaction fees<\/h2>\n<p>To purchase an NFT, any platform will charge a transaction fee.  Opensea charges a 2.5% commission to sellers on the value of the piece.<\/p>\n<h2>Liquidity and market volume<\/h2>\n<p>As with any investment, it&#8217;s all about buying low and selling high.  But for that to happen, there needs to be a secondary market where you can sell your assets in the future at a higher price.<\/p>\n<h2>Don&#8217;t fall for scams.<\/h2>\n<p>While you can make huge profits buying and selling NFTs, there are plenty of mistakes you can make when making buying decisions.  Currently, cybercriminals are taking advantage of this industry in a major way.  So make sure you know who is behind a project and get to know their community.<\/p>\n<h2>Growth of NFTs<\/h2>\n<p>Non-Fungible Tokens (NFTs) burst from the darkest corners of the internet in March 2021 when the auction house <strong>Christie&#8217;s <\/strong>sold a digital artwork for <strong>69 million dollars.<\/strong><\/p>\n<p>It was a piece of the artist <strong>Mike Winkelmann, <\/strong>known as <strong>beeple <\/strong>and the work was sold in NFT format.  But what is an NFT and how does it work?  How does a person become a specialist in this new market?  Is it possible to make money through NFTs?  What is the secret?<\/p>\n<p>An NFT is an asset that has the ability to be unique and unrepeatable.  Thanks to its technology (called <strong>blockchain<\/strong>) it is possible to certify both the originality of the asset and to whom it belongs.<\/p>\n<p>An item is fungible when it can be exchanged for other equivalents.  For example, a $10 bill can be exchanged for 10 $1 bills.  Instead, NFTs are unique items, so there will only be one – or a limited number – of them, Rodrigo Orellana explained in an article published on DigitalTrends.com.<\/p>\n<p>The simplest way to understand them is to consider them as if they were trading cards, paintings or works of art with the particularity that they are autographed.  This is what gives it its unique and exclusive feature.<\/p>\n<h2>How are NFTs acquired and\/or generated?<\/h2>\n<p>Most users buy NFTs on dedicated marketplaces, similar to how they might buy cryptocurrencies on an exchange.<\/p>\n<p>Even if you are a digital artist, you can create a work, and through very simple platforms you can create the code to convert it into an NFT and publish it for sale right there, either setting a price or starting an auction so that interested parties can start with a bid, explained <strong>Edgar Bezanilla, VP of Blockchain Business School,<\/strong> a school dedicated to teaching the operation of blockchain technology in the country.<\/p>\n<p><strong>Open Sea<\/strong> It is considered the main platform in the NFT market.  As of September 2021, 97.8% of all NFT activity based on <strong>ethereum <\/strong>took place on said platform, according to the site <strong>Decrypt<\/strong>.com.<\/p>\n<h2>Can you make money with NFTs?<\/h2>\n<p>The NFT market is a lot like the conventional art market.  A person can acquire a unique work for the simple fact that he likes it.  But there will always be those who buy the piece as an investment, hoping that the market will one day pay a higher value.  Something similar happens with NFTs, Bezanilla explained.<\/p>\n<blockquote>\n<p>If you buy, for example, Paris Hilton an NFT, the chances that you can resell it are very good.  But if a random person generates an NFT, there is no guarantee that its value will go up over time,” he said.<\/p>\n<\/blockquote>\n<p>There are people who are looking to enter a nascent market to diversify their investments, but it is necessary to know the benefits and risks as they would with any other asset.<\/p>\n<p>In accordance with <strong>chain analysis<\/strong>In general, 78% of sales made by buyers will result in a loss on resale.  That is, they will sell at a lower price than the price they paid as an initial investment, according to “<strong>The Chainalysis 2021 NFT Market Report”<\/strong>.<\/p>\n<p>But the true value of the NFT wave is in the adoption of the technology behind them (blockchain and smart contracts), they said. <strong>Margarita Kiruyushkina<\/strong> Y <strong>Jessica Tatievski<\/strong>founders <strong>Neue Projects,<\/strong>  a project dedicated to uniting traditional contemporary art with the world of NFTs and crypto art.<\/p>\n<h2>What to know before you start<\/h2>\n<p>If you want to enter this market, either out of interest in technology or interest as an investment, it is important to consider that it is a highly specialized market.<\/p>\n<p>It is necessary to understand the operation of blockchain technology and Ethereum smart contracts.<\/p>\n<p>In addition, it is necessary to identify the digital properties of an asset to know how rare the piece is and to know who promotes each project, this will reduce the probability of falling into scams.<\/p>\n<blockquote>\n<p>Before you buy any digital asset, do your research and find out who is behind the projects,” said Jessica Tatievski.<\/p>\n<\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>Non Fungible Token digital assets are approximations to Cryptocurrencies, unlike NFTs that cannot be traded. NFTs are more geared towards collecting. April 30, 2022 6:54 p.m. If you want to enter this market either for interest in technology or for interest as an investment, it is important to understand the risks and benefits as you [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":188,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/187"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=187"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/187\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/188"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=187"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=187"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=187"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}