{"id":193,"date":"2022-05-04T11:57:28","date_gmt":"2022-05-04T11:57:28","guid":{"rendered":"https:\/\/infobloom.site\/infringements-of-intellectual-property-rights-when-trading-nfts\/"},"modified":"2022-05-18T11:49:18","modified_gmt":"2022-05-18T11:49:18","slug":"infringements-of-intellectual-property-rights-when-trading-nfts","status":"publish","type":"post","link":"https:\/\/infobloom.site\/infringements-of-intellectual-property-rights-when-trading-nfts\/","title":{"rendered":"Infringements of Intellectual Property Rights when trading NFTs"},"content":{"rendered":"<p>Although it can be affirmed that the NFTs (Non Fungible Tokens \/ Tokens no Fungibles), have their beginnings from the year 2012 with the Colored Coins in the Bitcoin blockchain, no one is unaware of the popularity that they have over the last year. had, being considered as the word of the year 2021 by the British dictionary Collins.<\/p>\n<h2><strong>What is an NFT and its characteristics?<\/strong><\/h2>\n<p>NFTs are tokens based on a blockchain whose standard, ERC-721 and ERC-1155 are the most common, gives it the characteristic of non-fungible. Typically the most common NFT is a metadata file that contains information encoded with a digital version of the file being minted.<\/p>\n<p>The NFT contains two core elements, the ID token and the smart contract address. The combination of the ID token and the smart contract address is what makes it unique in the world. In addition to the above, a link is usually included, where the digital file can be found. From what has been explained, it can be affirmed that the NFT is not the file itself, but rather a record in the blockchain that is linked to it.<\/p>\n<h2><strong>NFT and IP infringements<\/strong><\/h2>\n<p>NFTs can be one more tool for intellectual property rights holders to exploit. A recent case that exemplifies this is the family of Pablo Picasso and his interest in minting a collection of .mp4 files titled “Man and the Beat” on the Ethereum blockchain.[1]<\/p>\n<p>However, this new form of marketing has brought a new wave of infringements of their rights. This reality is evidenced when even the first “unicorn” company of NFTs, Open Sea, indicates through a tweet that 80% of NFTs “plagiarize” works, collections or are spam. Open Sea itself has already started with measures to prevent this type of infraction from continuing to be committed through its website.[2]<\/p>\n<p>To establish the cause of infringement, the procedure, as well as the applicable law, I consider it essential to first determine the intellectual property right or rights that are being violated. As a general rule, works that are protected by copyright and related rights, as well as registered distinctive signs,[3] They are the ones that in practice have aroused the most controversy. As an indicator of the above, there is an increase in lawsuits for IP infringements in the United States (pioneering examples such as TamarindoArt LLC vs. Husain or Nike INC vs. STOCKX LLC).<\/p>\n<p>Other rights that are not strictly intellectual property and that are highly susceptible to infringement are domain names, as well as the right to one&#8217;s own image. Regarding domain names, they find their main challenge in the registration of domain names of a decentralized nature (Ethereum Name Service, Unstoppable Domain, Solana Name Service) and without a doubt they entail a challenge for the traditional centralized system. On the other hand, the right to one&#8217;s own image is largely infringed by not having the corresponding authorizations from its owner or successors in title.<\/p>\n<blockquote class=\"wp-block-quote\"><p><strong>“It cannot be ignored that the crypto\/blockchain ecosystem is in the process of reaching maturity, which is why it is extremely important that the holders of intellectual property rights or their legal representatives take this technology into account for their management and exploitation. .”<\/strong><\/p><\/blockquote>\n<p>I consider it advisable that before initiating a procedure, whether of an administrative, civil or criminal nature, a mechanism such as notification and withdrawal or its Mexican side, notice and counter-notice, be resorted to, since due to the nature and environment of files that infringe IP rights, it can be more efficient and expeditious.<\/p>\n<p>NFTs can support the exploitation of intellectual property rights by their owners. However, it cannot be ignored that the crypto\/blockchain ecosystem is in the process of reaching maturity, which is why it is extremely important that the holders of intellectual property rights or their legal representatives take this technology into account for the management and exploitation of the same, since we live in a world where the value of digital is increasingly recognized.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Although it can be affirmed that the NFTs (Non Fungible Tokens \/ Tokens no Fungibles), have their beginnings from the year 2012 with the Colored Coins in the Bitcoin blockchain, no one is unaware of the popularity that they have over the last year. had, being considered as the word of the year 2021 by [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":194,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/193"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=193"}],"version-history":[{"count":2,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/193\/revisions"}],"predecessor-version":[{"id":592,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/193\/revisions\/592"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/194"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=193"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=193"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=193"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}