{"id":195,"date":"2022-05-04T12:13:22","date_gmt":"2022-05-04T12:13:22","guid":{"rendered":"https:\/\/infobloom.site\/nfts-in-the-book-world-is-it-possible\/"},"modified":"2022-05-04T12:13:22","modified_gmt":"2022-05-04T12:13:22","slug":"nfts-in-the-book-world-is-it-possible","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nfts-in-the-book-world-is-it-possible\/","title":{"rendered":"NFTs in the book world: is it possible?"},"content":{"rendered":"<p>Since Beeple sold a <strong>NFT <\/strong>for 69 million dollars, the market set its eyes on the new forms of digital certification.  The NFTs for books are almost an unexplored world in Latin America and the large publishing groups have not yet signed up to the idea because, deep down, there is great ignorance of the possibilities of these tokens within a world that has only conceived the physical format. for monetization.<\/p>\n<p>NFTs have great potential from a practical and creative point of view.  The <strong>NFT<\/strong> they are different from the digital copies of books that are currently available on Amazon, Bookshop, Apple Store or any other marketplace that includes the sale of ebooks.<\/p>\n<p>When an e-book is purchased on Amazon, the user&#8217;s ownership of the product differs from that of a physical book.  Yes, you have purchased it, but this file will only be active if the platform where you purchased the file, in this case Amazon, is online and agrees to continue providing it.<\/p>\n<p>From this perspective, NFTs have more in common with physical books: they are a <strong>possession.<\/strong><\/p>\n<h2><strong>NFT books are not just one?<\/strong><\/h2>\n<p>For those of you wondering if an NFT of a book doesn&#8217;t make sense because it&#8217;s a single file, we&#8217;ve corrected you.  With NFTs, you don&#8217;t just own one item, but a specific item within a series of items.  One NFT is a first edition, another a second, and so on. NFT books work much like <strong>books signed by an author<\/strong>.<\/p>\n<p>It&#8217;s not that you own the only published book, which is often what people end up believing, it&#8217;s that you own one of the fifty or so books that exist.  If the author publishes fifty copies of his book, the NFT you buy is one of those fifty. <\/p>\n<h2><strong>NFT against editorial piracy<\/strong><\/h2>\n<p>Hacking an NFT book is much more difficult than a printed book and it is also more difficult to challenge the copyright of a work because everything is on the block chain.<\/p>\n<p>Another game-changing aspect between both publishing formats is the ability to apply digitized smart contracts with the <strong>NFT<\/strong>.  In the publishing market when a book is published, there are several parties that earn a percentage of each sale: the writer, the publisher, the distributor and the bookstore.  Usually the royalties of the books are paid a few times a year, depending on the publisher, in long terms because the books, although they give us a lot of life, are not an object that runs out and must be replaced, like milk, it is therefore what, with a <strong>smart contract<\/strong>created through the blockchain, when the purchase of the book&#8217;s NFT occurs, the <strong>contractual royalty payments <\/strong>would be integrated directly into the transaction.  In addition, according to journalist Melinda Crow, an expert in selling her articles for NFT, contingencies can also be included for changes in those payments over time, or even after the death of an author.<\/p>\n<p>Perhaps the most interesting part of the process is in the resale.  After purchasing an NFT, the owner of the book may decide to put it up for sale, just like second-hand bookstores, but online.  In the resale, both the authors and the other parties involved can continue to generate a profit with a lower percentage of the copyright in those resales until eternity.  According to the NFT market report carried out by the auditing company <strong>chain analysis<\/strong>By 2021, the percentage of profit for an author from the sale of their ebook used to be 30%, while the NFT resale standards were leveling off at around 10-15%.<\/p>\n<h2 id=\"h-como-no-hacer-un-libro-nft\"><strong>How NOT to make an NFT book?<\/strong><\/h2>\n<p>But not all that glitters is gold in the world of crypto assets.  Many times the creators are guilty of ignorance by not understanding the rules of intellectual property of the publishing market as well as the world of NFT.  A clear example of poor management of intellectual property and NFT is the case of the community <strong>Spice DAO<\/strong>.<\/p>\n<p>At the end of 2021, a group of NFT creators called <strong>Spice DAO<\/strong> were overjoyed when they tweeted about purchasing a concept art book: <strong>Jodorowsky&#8217;s Dune<\/strong>the bible of the ambitious but ill-fated film adaptation of Dune by <strong>Frank Herbert<\/strong>.  These &#8220;experts&#8221; had big plans to turn the book into an NFT, burn the physical copy, and adapt the story into an animated series.  However, there was a problem: they did not know that the purchase did not mean that they owned the copyright of <strong>dunes<\/strong>. <\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">We won the auction for €2.66M.  Now our mission is to:<\/p>\n<p>1. Make the book public (to the extent permitted by law) <\/p>\n<p>2. Produce an original animated limited series inspired by the book and sell it to a streaming service<\/p>\n<p>3. Support derivative projects from the community pic.twitter.com\/g4QnF6YZBp<\/p>\n<p>— Spice DAO (@TheSpiceDAO) January 15, 2022<\/p><\/blockquote>\n<p>Understanding the mess a bit: Jodorowsky&#8217;s Dune was the failed film project of Herbert&#8217;s book that was going to be directed by the famous Chilean artist and filmmaker Alejandro Jodorowsky.  The project included in the casting such important artists as <strong>Salvador Dali<\/strong>, <strong>Mick jagger<\/strong> or <strong>Orson Wells,<\/strong> and that, not being able to be realized, Jodorowsky took his frustration to the creation of a conceptual art book.  The book included set designs, characterizations, and the storyboard for the entire film outlined by the famous French illustrator, <strong>Moebius<\/strong>.<\/p>\n<p>Today it is estimated that there are between ten and twenty copies of Jodorowsky&#8217;s Dune still in existence, periodically going up for auction on the market for approximately twenty-five thousand dollars.  Last November, one such copy went up for auction at Christies, where appraisers expected it to fetch around $40,000, yet Spice DAO enthusiasts paid a hundred times Christies&#8217; modest estimate and took the book away. for<strong> 3 million dollars<\/strong>.<\/p>\n<p><strong>Spice DAO<\/strong> intended to make the book public, however the book was published for free a few months before and available at <strong>google photos<\/strong>.  Buying Jodorowsky&#8217;s Dune did not give him the <strong>Copyright<\/strong> necessary to produce the vision of the Mexican filmmaker;  They had only bought an old and very expensive book that still belongs to its author: Jodorowsky.<\/p>\n<p>Costume design for the characters of Jodorowsky&#8217;s Dune |  Image via Google Photos<\/p>\n<p>After back and forth trying to understand the mess they had gotten themselves into, the community of Spice DAO enthusiasts has failed to get the necessary approvals to publish the book online in its entirety.  According to Buzzfeed they want to make it very clear that they will not burn the book after all.  Although things have stalled after the blunder, the project of bringing Jodorowsky&#8217;s Dune to the masses remains the primary concern of many of the group&#8217;s members.<\/p>\n<h2><strong>NFT books in Spain: investing in the future<\/strong><\/h2>\n<p><strong>Rado Molina<\/strong> is the publisher of the publishing platform <strong>Linkgua<\/strong>an editorial project that has been launched in the world of NFTs in Spain after the publication, last November, of the novel <strong>paradise<\/strong> of the Cuban writer <strong>Jose Lezama Lima<\/strong>.<\/p>\n<p>Although Linkgua &#8220;is a publisher focused on the publication of Hispanic classics&#8221;, it also has its vision set &#8220;on the development of technological solutions of AI and the Semantic Web for books&#8221; according to Molina.<\/p>\n<p>It is not surprising that his bet is on the future.  With the news of the construction of <strong>metaverses <\/strong>and the NFT bubble stabilizing, as well as the exit of <strong>cryptocurrencies<\/strong> regulated by the markets, for the publisher of <strong>Linkgua<\/strong> «NFTs will have a key role in protecting rights in the digital world and in the Metaverse«, in addition to becoming the base element of the publisher&#8217;s mission. <\/p>\n<p>That is why the creation of your books in crypto digital assets is the same as that of another <strong>NFT<\/strong>, except that in the case of his books, «we also tokenize the files that constitute the edition itself and assign them a series of metadata typical of the publishing world.  The B series of our first editions are duly certified with the blockchain, a hash and a smart contract that indicates, among other certifications, the edition dates and their ISBNs.  In this last they differ from the usual NFTs».<\/p>\n<p>Rado Molina believes, contrary to what is thought within the <strong>publishing industry,<\/strong> that «NFTs are a literary option» because they provide a much safer alternative to «protect authors and publishers from indiscriminate copying of their works».  He also believes that &#8220;it is possible to generate unique copies of books or editions limited to the number of virtual copies that authors and publishers consider reasonable&#8221;, something that perhaps many within the industry have been questioning for not understanding the nature of the digital product. or, simply, because it is a product that is more expensive than printing volume physical runs.<\/p>\n<p>\n<iframe title=\"Linkgua Reader Demo\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/dHxOMQ0dvKo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>\n<\/p>\n<p>Linkgua project demo<\/p>\n<p>The catalog of <strong>Linkgua<\/strong> owns many works by deceased authors and with open rights that would make anyone wonder whether or not it is worth generating an NFT from these titles, however, as we have explained earlier in this article, the value of the work has to do with the rights that is why for this publisher the main meaning of making classic books in NFTs «is to publish the first editions of the metaverse» and, in this way, develop «the technological bases so that the books have metadata and attributes that allow them to be acquired, consume them, trade them, and resell them in the metaverse.”<\/p>\n<p><strong>First Folio <\/strong>is Linkgua&#8217;s NFT collection containing first editions of <strong>classic books<\/strong> or discontinued in Latin America and where they see a &#8220;current and future value&#8221;. <\/p>\n<p>Whether or not Linkgua&#8217;s books are an expanded ebook doesn&#8217;t matter much because its publisher knows &#8220;that the books of the future will be equipped with Artificial Intelligence and intelligent, contextual and automated search tools.&#8221;<\/p>\n<p>                                                    <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Since Beeple sold a NFT for 69 million dollars, the market set its eyes on the new forms of digital certification. The NFTs for books are almost an unexplored world in Latin America and the large publishing groups have not yet signed up to the idea because, deep down, there is great ignorance of the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":197,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/195"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=195"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/195\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/197"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=195"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=195"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=195"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}