{"id":226,"date":"2022-05-04T16:57:19","date_gmt":"2022-05-04T16:57:19","guid":{"rendered":"https:\/\/infobloom.site\/what-are-the-most-frequent\/"},"modified":"2022-05-04T16:57:19","modified_gmt":"2022-05-04T16:57:19","slug":"what-are-the-most-frequent","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-the-most-frequent\/","title":{"rendered":"What are the most frequent?"},"content":{"rendered":"<p>The popularity of cryptocurrencies has led to an increase in the number of fraud and related crimes, which is also evident in non-financial institutions.<\/p>\n<p>NFTs, which are linked to a blockchain, are becoming increasingly popular as Wall Street and Hollywood investors jump on the bandwagon.<\/p>\n<p>In 2021, more than €38.8 billion in cryptocurrencies were transferred to NFT-related smart contracts, up from €93 million the previous year.<\/p>\n<h2 id=\"volumen-falso-wash-trading\">Fake Volume (Wash Trading)<\/h2>\n<p>Wash trading (also known as “fake volume”) is a method of manipulating the value and liquidity of an asset that is illegal under the laws of many countries.  It is a common practice on bitcoin exchanges trying to increase trading volume.<\/p>\n<p>According to experts, selling a token to a wallet that already owns it is a relatively simple operation in this small universe where no one is forced to reveal their identity.<\/p>\n<p>In 2021, the corporation found that even though the vast majority of people who tried wash trading failed, those who did succeed made a fortune.<\/p>\n<p>Only 41% of the 262 wash trading activities were profitable, despite generating more than €7.8 million in revenue.  The remainder suffered a loss of approximately 500,000.<\/p>\n<p>According to the research findings, NFT (fake volume) wash trading is illegal.  “However, although wash trading is prohibited in traditional markets, it has not yet been investigated in non-traditional markets….  We ask NFT platforms to prohibit this type of behavior.”<\/p>\n<h2 id=\"blanqueo-de-dinero\">money laundering<\/h2>\n<p>Money laundering has long been a concern in traditional banking, but has now spread to digital assets, drawing the ire of law enforcement around the world.<\/p>\n<p>Illegitimate addresses sent more than €2.6 million to NFT markets last year, a significant increase from less than €441,000 the previous year.  During the second and third quarters of 2021, the vast majority of this activity came from addresses associated with fraud.<\/p>\n<p>In one case in the fourth quarter, some 250,000 euros in bitcoins were transferred from Chatex, a virtual cryptocurrency exchange where suspects of money laundering, terrorism and drug trafficking are found.<\/p>\n<p><source data-lazy-  type=\"image\/webp\"><\/source><\/p>\n<p>Aside from these two approaches, crooks use a variety of different techniques.  Those are the two areas experts have focused on, according to Kim Grauer, as they are “pretty basic” to assess on the blockchain, he added.<\/p>\n<p>He said the industry hasn&#8217;t been around long enough to witness the kind of fraud and ripping off users that is going on right now. <strong>“We anticipate that 2022 will be an important year for NFT crimes, and we will actively monitor the situation”<\/strong>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The popularity of cryptocurrencies has led to an increase in the number of fraud and related crimes, which is also evident in non-financial institutions. NFTs, which are linked to a blockchain, are becoming increasingly popular as Wall Street and Hollywood investors jump on the bandwagon. In 2021, more than €38.8 billion in cryptocurrencies were transferred [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":228,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/226"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=226"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/226\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/228"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=226"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=226"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=226"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}