{"id":229,"date":"2022-05-04T17:13:29","date_gmt":"2022-05-04T17:13:29","guid":{"rendered":"https:\/\/infobloom.site\/the-most-used-scams-when-buying-nfts\/"},"modified":"2022-05-18T11:55:05","modified_gmt":"2022-05-18T11:55:05","slug":"the-most-used-scams-when-buying-nfts","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-most-used-scams-when-buying-nfts\/","title":{"rendered":"The most used scams when buying NFTs"},"content":{"rendered":"<ul>\n<li>\n<h2>Given the scams and frauds that have been known in recent times, there are some examples of artists who have suffered.<\/h2>\n<\/li>\n<li>\n<h2>Scams using Discord direct messaging are one of the most common.<\/h2>\n<\/li>\n<li>\n<h2>Fake websites posing as official is the third most popular form used by cyber criminals.<\/h2>\n<\/li>\n<\/ul>\n<p>Non-Fungible Tokens or better known as NFTs continue to gain popularity around the world, that is why <strong>Cybercriminals have taken over scams and unrecognized transactions that affect fans and collectors of this cryptocurrency.<\/strong><\/p>\n<p>According to data from Statista, as of July 15, 2021, the aggregate value of NFT sales over 30 days amounted to approximately 31.5 million. Let us remember that NFTs are blockchain-based digital items whose units are designed to be unique, as they can also store data and be associated with images, videos, audio, memberships and more.<\/p>\n<p>Statista also details that from April 12, 2021 to February 15, 2022, the total value of non-fungible token sales in the art segment fluctuated significantly. Where as of April 12, 2021, sales of NFTs recorded on the Ethereum blockchain over the previous 30 days generated an aggregate value of almost 64 million US dollars. <strong>As of February 15, 2022, the aggregate sales value for 30 days amounted to approximately 87 million US dollars.<\/strong><\/p>\n<h2>Common scams when buying NFTs<\/h2>\n<p>Experts assure that the purchase of these digital works, as a tangible product, has its advantages and disadvantages, <strong>so users who want to access one of the tokens run the risk of possible fraud.<\/strong><\/p>\n<p>That is why, given the scams and frauds that have been known in recent times, there are some examples of artists who have had their works copied without permission and have been sold as NFTs.<\/p>\n<p><strong>Scams using Discord Direct Messaging:<\/strong> For being a very popular platform for cybercriminals, last December, cybercriminals compromised Fractal&#8217;s Discord channel, an NFT gaming marketplace,<strong> and scammed 373 users by stealing around $150,000 worth of Solana crypto from their wallets.<\/strong><\/p>\n<p><strong>Through false profiles on social networks:<\/strong> Another way widely used by digital criminals is to use false profiles on Twitter as well as on other social networks, where users have to learn to live with false profiles that try to steal them.<\/p>\n<p><strong>Fake websites posing as official (phishing):<\/strong> The third most popular way used by cybercriminals is to create fake websites that are very similar copies of NFT stores, digital wallets, etc.<\/p>\n<p><strong>Artists or creators who are imitated by criminals:<\/strong> Currently it is better to collect an NFT on a verified account and that also shows age or activity that has not been involved in anything suspicious for its users.<\/p>\n<p>It was recently revealed that the Bored Ape Yacht Club Instagram account was hacked and cybercriminals posted a link where users could supposedly make a significant move with their cryptocurrency assets.<\/p>\n<p class=\"elementor-post__title\">\n","protected":false},"excerpt":{"rendered":"<p>Given the scams and frauds that have been known in recent times, there are some examples of artists who have suffered. Scams using Discord direct messaging are one of the most common. Fake websites posing as official is the third most popular form used by cyber criminals. Non-Fungible Tokens or better known as NFTs continue [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":230,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/229"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=229"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/229\/revisions"}],"predecessor-version":[{"id":607,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/229\/revisions\/607"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/230"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=229"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=229"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=229"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}