{"id":231,"date":"2022-05-04T17:29:36","date_gmt":"2022-05-04T17:29:36","guid":{"rendered":"https:\/\/infobloom.site\/500000-worth-of-nft-stolen-with-a-simple-photoshop-tweak\/"},"modified":"2022-05-04T17:29:36","modified_gmt":"2022-05-04T17:29:36","slug":"500000-worth-of-nft-stolen-with-a-simple-photoshop-tweak","status":"publish","type":"post","link":"https:\/\/infobloom.site\/500000-worth-of-nft-stolen-with-a-simple-photoshop-tweak\/","title":{"rendered":"$500,000 worth of NFT stolen with a simple Photoshop tweak"},"content":{"rendered":"<p>Another user offered to exchange said NFTs <strong>for 3 NFTs from the Bored Ape range, <\/strong>one of the largest and most popular collections of NFTs in the world.  The collection features profile pictures of cartoon apes that are generated using an algorithm.  Owners of a Bored Ape NFT have access to a private online club, exclusive in-person events, and image IP rights.<\/p>\n<p>The truth is that S27 did not know that these were not NFTs, but simple JPG images to which the scammer had added a simple logo with Photoshop.<\/p>\n<p>Since these 3 NFTs supposedly belonged to Bored Ape&#8217;s collection, they were worth quite a bit more than the 2 NFTs that S27 was offering.  Obviously, this user did not think twice when he received the exchange request.  He checked that these NFTs were true by looking at the check mark that these images had.  These logos were totally fake.<\/p>\n<p>The hacker did not have to go through any complicated processes to pull off his scam.  He simply downloaded JPGs of the original NFT works and then added the icon to them.  S27 fell for the trick and traded 2 NFTs worth more than $560,000 for 3 worthless JPGs.<\/p>\n<p>The biggest problem is that these fake NFTs were already in the S27 account and the scammer had already disappeared.  The worst thing is that neither Swapkiwi nor other NFT buying and selling sites offer any kind of guarantee in case of this scam, so to the surprise, S27 has lost works valued at more than half a million dollars.  And blockchain technology does not offer security measures for these cases either, as NFTs are decentralized.<\/p>\n<p>embedded   <\/p>\n<blockquote data-td-script-src=\"https:\/\/platform.twitter.com\/widgets.js\" class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">  4\/ Further digging showed that he traded on swapkiwi, a trading site similar to NFTtrader or SudoSwap.  Furthermore, he *initiated* a trade to lose his apes, which is certainly not normal behavior.  I decided to play with KiwiSwap and see how this could&#8217;ve happened<\/p>\n<p> — quit.pcc.eth (@0xQuit) April 5, 2022<\/p><\/blockquote>\n<h2>Tips to avoid NFT scams<\/h2>\n<p>First of all, the history and wallet logs for the project should be checked.  OpenSea and any NFT marketplace will allow you to see the total number of transactions and users who have purchased NFT collections.  EtherScan allows you to view all transactions on the Ethereum blockchain.<\/p>\n<p>In addition, you have to follow the project on social networks.  A project must have many investors and collectors to ensure it has good liquidity, artistic value, and a long-lasting community.<\/p>\n<p>These digital assets are becoming more and more popular.  Nevertheless, <strong>there is an increase in reports of NFT theft<\/strong>.  Artists have had their work copied.  This became NFTs and was sold to people who think they are getting the real deal.<\/p>\n<p><strong>DeviantArt released a new tool to scan public blockchains<\/strong> and third-party marketplaces.  Alert your members of possible artistic fraud.  Since August 2021, it has sent more than 50,000 alerts about possible NFT violations.<\/p>\n<p>On the other hand, it is important to remember that a<strong> artwork as NFT does not mean that it has intellectual property.<\/strong> OpenSea&#8217;s easy-to-use software makes it easy for anyone to turn any image or photo into an NFT.<\/p>\n<p>A good option is to find the artist through Twitter, their website, or any other social media channel if there is one.  Ask the artist directly if the artwork is theirs and if they have the correct user profile.  Ask others in the Discord channel to verify the information.<\/p>\n<p>One vital piece of advice is to be cautious.  Make purchases only when you are sure of the information.  Make sure you investigate the project and keep your information secure.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Another user offered to exchange said NFTs for 3 NFTs from the Bored Ape range, one of the largest and most popular collections of NFTs in the world. The collection features profile pictures of cartoon apes that are generated using an algorithm. Owners of a Bored Ape NFT have access to a private online club, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":232,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/231"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=231"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/231\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/232"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=231"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=231"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=231"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}