{"id":233,"date":"2022-05-04T17:45:44","date_gmt":"2022-05-04T17:45:44","guid":{"rendered":"https:\/\/infobloom.site\/nft-collector-loses-over-560000-to-phishing-scam\/"},"modified":"2022-05-04T17:45:44","modified_gmt":"2022-05-04T17:45:44","slug":"nft-collector-loses-over-560000-to-phishing-scam","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nft-collector-loses-over-560000-to-phishing-scam\/","title":{"rendered":"NFT collector loses over $560,000 to phishing scam"},"content":{"rendered":"<p>\t\t<br \/>\n\t\t\t\t\tNFTs from the Bored Ape collection have sold for over $8 million at some auctions\t\t\t\t<\/p>\n<p>\n\t\t\t\tPhoto: Mario Tama\/Getty Images\t\t\t<\/p>\n<p><strong>Scam attempts in the NFT market are a phenomenon that has become extremely common in recent years<\/strong>.  One of the most widely used methods is phishing, in which criminals pass off fake works for pieces that can be worth hundreds of thousands of dollars.<\/p>\n<p>An example of this type of scam was reported on social networks by the Twitter user @0xQuit, who recounted through a series of posts how he was the victim of a scam that caused him to lose more than $560,000.  The user said that the event occurred on Swapkiwi, a platform where NFT collectors can freely exchange tokens. <\/p>\n<p><strong>The scam occurred after the victim identified as S27 posted that he was interested in exchanging 2 of his NFTs valued at $567,000<\/strong> received an offer to exchange them for 3 Bored Apes, some NFT works that are considered among the most valued in the crypto world.<\/p>\n<p><center\/><\/p>\n<p>However, these were not really NFT works but rather<strong> they were simple images in JPG format to which the scammer had added the verification emblem in Photoshop <\/strong>of authenticity that all Bored Apes have.<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">4\/ Further digging showed that he traded on swapkiwi, a trading site similar to NFTtrader or SudoSwap.  Furthermore, he *initiated* a trade to lose his apes, which is certainly not normal behavior.  I decided to play with KiwiSwap and see how this could&#8217;ve happened 👇<\/p>\n<p>— quit.pcc.eth (@0xQuit) April 5, 2022<\/p><\/blockquote>\n<p><strong>The victim did not realize this situation because at first sight <\/strong>the NFT looked like a genuine piece, so he proceeded to accept the trade.  It was not until after carrying out the transaction that the user was able to see that he had been scammed and that in reality the so-called Bored Ape were nothing more than simple images with no real value.<\/p>\n<p>For this moment <strong>the scammer had already withdrawn his NFTs and deleted his account on the platform<\/strong>so it was impossible to contact him points @0xQuit.<\/p>\n<p>To this is added that due to the regulations in which they operate and that users accept when using the platform, <strong>Neither Swapkiwi nor any other NFT exchange website is responsible for such a scam.<\/strong>.<\/p>\n<p>This means that for practical purposes the victim of the scam is not able to recover their works and therefore <strong>will have to face the loss of almost $600,000 dollars<\/strong>.<\/p>\n<p>@0xQuit stated that for this reason it is necessary for users to always be very vigilant when exchanging NFTs as they cannot trust that the other person is not trying to scam them in some way. <strong>He invited NFT owners to check parts before accepting an offer that seems too good to be true.<\/strong> since it is very likely that either it is not reality or that the person is on the verge of being scammed.<\/p>\n<p><strong>This may also interest you:<\/strong><br \/>– They sell an NFT for more than $23 million<br \/>– Which is the most expensive NFT and why<br \/>– What it means that the sale of NFTs on OpenSea would have burned more than $1 billion in the last 30 days<\/p>\n<p><center\/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>NFTs from the Bored Ape collection have sold for over $8 million at some auctions Photo: Mario Tama\/Getty Images Scam attempts in the NFT market are a phenomenon that has become extremely common in recent years. One of the most widely used methods is phishing, in which criminals pass off fake works for pieces that [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":235,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/233"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=233"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/233\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/235"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=233"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=233"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=233"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}