{"id":238,"date":"2022-05-04T18:17:59","date_gmt":"2022-05-04T18:17:59","guid":{"rendered":"https:\/\/infobloom.site\/they-scam-more-than-130000-euros-in-nfts-from-zilverk-the-trendy-vtuber\/"},"modified":"2022-05-04T18:17:59","modified_gmt":"2022-05-04T18:17:59","slug":"they-scam-more-than-130000-euros-in-nfts-from-zilverk-the-trendy-vtuber","status":"publish","type":"post","link":"https:\/\/infobloom.site\/they-scam-more-than-130000-euros-in-nfts-from-zilverk-the-trendy-vtuber\/","title":{"rendered":"They scam more than 130,000 euros in NFTs from Zilverk, the trendy VTuber"},"content":{"rendered":"<p>As much as <b>Willyrex, Vegetta and many other creators<\/b> ensure that NFTs are the future of collecting, the truth is that we still have a lot to learn in such a new territory.  Rare is the day when <b>we did not know about a new scam<\/b> related to the sector, and streamers in favor of this market <b>they are not immune<\/b> to the scams<\/p>\n<p>The last to suffer it has been <b>Zilverk<\/b>a popular Mexican VTuber who had thrown himself headlong into creating <b>something known as Ratz<\/b>.  This is content in NFT format -of which he is a great supporter- that he pretended to have presented yesterday, but <b>plans went awry<\/b>.<\/p>\n<p>&#8220;Today is not the best of days,&#8221; he says in a statement explaining what happened.  &#8220;The announcement we intended to make today has been canceled so <b>we believed a technical failure, and in the end that failure turned out to be a theft<\/b>&#8220;.<\/p>\n<p>According to his account, one of the developers (whose nickname is <b>Unexplained.eth<\/b>) the funds intended for the development and maintenance of the NFTs that were going to go on sale were transferred.  The value of the operation was <b>1400 sunshine<\/b>a cryptocurrency whose unit costs, right now, more than 22 euros. <b>The embezzlement thus amounts to 137,000 euros<\/b>.<\/p>\n<p>Although they trusted this person and they say he had a good reputation, after putting that money the guy disappeared: &#8220;<b>we are looking for him and the money<\/b>but if you thought we were going to <b>surrender<\/b> and that this was a post to say goodbye to the project, you are very wrong.<\/p>\n<p>Zilverk assures that it will continue financing its Ratz, although it recommends that its followers <b>take security measures<\/b> with their accounts so that the cheeky one who plucked them <b>don&#8217;t keep the money from the fans too<\/b>. <\/p>\n<p>Moral of all this?  That the NFT thing for the moment must be taken with tweezers, <b>only if you have some money left over<\/b>and always knowing that the sector where you get into is the most <b>unstable<\/b>.  If they give it with cheese to people who know how, imagine <b>those who have no idea<\/b>&#8230; Instead of NFT, use the acronym NTF: <b>do not trust<\/b>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As much as Willyrex, Vegetta and many other creators ensure that NFTs are the future of collecting, the truth is that we still have a lot to learn in such a new territory. Rare is the day when we did not know about a new scam related to the sector, and streamers in favor of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":239,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/238"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=238"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/238\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/239"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=238"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=238"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=238"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}