{"id":274,"date":"2022-05-05T09:21:07","date_gmt":"2022-05-05T09:21:07","guid":{"rendered":"https:\/\/infobloom.site\/define-pyramid-scheme-10-of-investors-in-nft-concentrate-85-of-operations\/"},"modified":"2022-05-05T09:21:07","modified_gmt":"2022-05-05T09:21:07","slug":"define-pyramid-scheme-10-of-investors-in-nft-concentrate-85-of-operations","status":"publish","type":"post","link":"https:\/\/infobloom.site\/define-pyramid-scheme-10-of-investors-in-nft-concentrate-85-of-operations\/","title":{"rendered":"Define pyramid scheme?  10% of investors in NFT concentrate 85% of operations"},"content":{"rendered":"<p>A word usually accompanies everything related to crypto culture: decentralization.  The great promise of blockchain, the technology that supports everything from cryptocurrencies to NFTs, has always been a more equitable and open future, less controlled by the narrow range of powers so characteristic of today&#8217;s capitalism.  Investing and making money is no longer the privilege of a handful of traders.  It is at your fingertips through thousands and thousands of NFTs.<\/p>\n<p>Sounds good, right?<\/p>\n<p><strong>Concentration<\/strong>.  In practice, not so much.  This is illustrated by an exhaustive study dedicated to analyzing the NFT market, one of the first of its kind.  After analyzing 6 million transactions out of a total of 4.7 million NFTs between June 2017 and April 2021, his conclusion is firm: the market is dominated by a few.  Over four years, 10% of investors made 85% of the moves;  and traded at least once with 97% of the goods.<\/p>\n<p>That same 10% moved as much money as 90% of the remaining actors.<\/p>\n<p><strong>The scheme<\/strong>.  The study does not claim that the NFT market resembles a pyramid scheme, a fairly old accusation, but it does offer data to believe it.  &#8220;The number of daily trades is greater for active investors for a longer period of time,&#8221; they explain, with great variability depending on specialization.  Every investor tends to focus on collections, aesthetics, types of art, or trends.  &#8220;Investors invest 73% of their trades in their top collection and 82% in their top two collections combined,&#8221; they add.<\/p>\n<p>That is, the money moves between very few people and in a very limited handful of NFTs (over the exorbitant total).<\/p>\n<p>     <\/p>\n<p><strong>What does it mean?<\/strong> On the one hand, that the promise of decentralization has not yet been synthesized.  Investing in an NFT looks less like the popular and democratized market that crypto communities suggest and more like the traditional elitist circuits of traditional art.  It&#8217;s logical, on the other hand: the cheapest NFT from Bored Ape Yacht Club, the most sought-after collection today, costs around $200,000.  For most people it is a lot of money, too much to risk.<\/p>\n<p><strong>few > many<\/strong>.  On the other, that the attention on NFTs and crypto investment in aggregate has a lot of media inflation and expectations to resolve.  It is still a game where few actors operate (some, yes, with a lot of money).  As explained here, much of the long-term viability of NFTs as more than just a bubble hinges on attracting new investors.  It is something transversal to the cyrpto culture and to the metanarrative nature of NFTs, whose main value lies in the unique possession of an idea or image.<\/p>\n<p><strong>You are inside?<\/strong> The NFT market is growing largely due to the intense FOMO (fear of missing out, the fear of missing out on something, usually a social event) that dominates digital culture.  If you arrive too late you will be left out of the wheel.  An idea fueled by exclusive and limited collections and by the very narrative of crypto art.  Possessing a Bored Ape Yacht Club NFT means, in practice, access to a privileged and elitist social club where Jimmy Fallon, Post Malone or Stephen Curry already appear.  One shamelessly glossed by magazines like Rolling Stone.<\/p>\n<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Name my ape!  Drop your suggestions below 👇@BoredApeYC #BAYC #BoredApeYachtClub #NFTs pic.twitter.com\/pwFynGy9QJ<\/p>\n<p>— Jimmy Fallon (@jimmyfallon) November 17, 2021<\/p><\/blockquote>\n<p><strong>parallelism<\/strong>.  In that sense and as developed in this other analysis, NFTs do work like a pyramid scheme: they depend on more and more investors entering the market to generate (move) more money.  Without new additions, the growing value of all goods (call them boring monkeys or cuckoo penguins) decreases, or in the best of cases stagnates.  The value does not reside in the art objects themselves but in the community and the perceived value of the objects.  The more people are interested in something, the more valuable it seems.<\/p>\n<p>Especially if Jimmy Fallon or Stephen Curry (who have money to spare to afford these investments) are involved.<\/p>\n<p><strong>Will it break?<\/strong> It&#8217;s the million dollar question.  If we think of NFTs as something more similar to the Philatelic Forum (where returns were promised at 6% and 8% guaranteed by the purchase and sale of stamps well above their market value) than to a respectable circuit of abstract art. .. Yes. Its market would be nothing more than a gigantic pump-and-dump maneuver very similar to that of GameStop.  The parallels are not entirely exact and the genuine interest in NFTs as a technological tool is real.  Any pyramid scheme depends on extracting a % of new investors\/participants, not just generating hype.<\/p>\n<p>As a decentralized phenomenon, at the moment, it is not having a great success.<\/p>\n<p> <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A word usually accompanies everything related to crypto culture: decentralization. The great promise of blockchain, the technology that supports everything from cryptocurrencies to NFTs, has always been a more equitable and open future, less controlled by the narrow range of powers so characteristic of today&#8217;s capitalism. Investing and making money is no longer the privilege [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":276,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/274"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=274"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/274\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/276"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=274"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=274"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=274"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}