{"id":277,"date":"2022-05-05T09:37:18","date_gmt":"2022-05-05T09:37:18","guid":{"rendered":"https:\/\/infobloom.site\/computer-fraud-crime-legaltoday\/"},"modified":"2022-05-18T11:55:15","modified_gmt":"2022-05-18T11:55:15","slug":"computer-fraud-crime-legaltoday","status":"publish","type":"post","link":"https:\/\/infobloom.site\/computer-fraud-crime-legaltoday\/","title":{"rendered":"Computer fraud crime &#8211; LegalToday"},"content":{"rendered":"<p><\/p>\n<p>The fraud<strong> computing<\/strong> It is a criminal phenomenon that in recent years is taking on greater magnitude and relevance in the field of computer crime, this being the main basis of computer crime on which cyber-crime revolves. Despite the differences that exist when establishing a <strong>unitary definition of the concept of computer fraud or computer fraud<\/strong>(This concept is more appropriate according to the doctrine), we must understand that we will refer to these as &#8220;the production of quantifiable property damage through external behavior, improper of an automated computer process, which alters the data managed by it, for profit and to the detriment of a third party”.<\/p>\n<p>The<strong> typical elements<\/strong> that make up the<strong> computer fraud crime<\/strong> are<strong>: Computer manipulation and similar artifice, transfer of assets not consented to by the owner of the same, profit and prejudice to third parties.<\/strong><\/p>\n<p>As for deception, it is noteworthy that the new figure aims to protect assets from attacks caused by new technologies, which are described by the legislator as &#8220;computer manipulation or similar artifice&#8221;, including all those mechanisms that are suitable for achieving this. Non-consensual transfer of a patrimonial asset, which is part of the act of disposition and which causes the enrichment that the author pursues. <strong>Unlike what happens with respect to the fraud provided for in No. 1 of article 248 of the Penal Code, deception is no longer a basic element nor is its presence essential<\/strong>given that the function that the use of deception played there, here is the use of computer manipulation or a similar fraudulent artifice, which are what give rise to the transfer of assets that the owner has not consented to<strong>. Establishes the jurisprudence of the Supreme Court <\/strong>that &#8220;the concurrence of any deception by the swindler is not necessary, because the stalking of other people&#8217;s assets carried out through computer manipulation acts automatically to the detriment of a third party, precisely because there is computer manipulation and therefore personal deception is not required.&#8221;<\/p>\n<p>Regarding the error, it is noteworthy that here there is not even an intersubjective relationship, nor is the “collaboration” of the victim of computer fraud an essential requirement, because the asset displacement actually occurs by virtue of computer manipulation. <strong>The action is not directed against a subject that can be misled, but rather it is exercised directly on the computer program that acts, without error, according to the information that is supplied to it.<\/strong><\/p>\n<p><strong>Establishes the doctrine of the Supreme Court<\/strong> that “in effect, electronic devices do not have errors such as those required by the traditional type of fraud, that is, in the sense of a false representation of reality. The apparatus behaves according to the program that governs it and, in principle, without &#8216;error&#8217;”. This same doctrine shows that the type of computer fraud admits various commissive modalities, &#8220;either through the creation of payment orders or transfers, or through data entry or exit manipulations, by virtue of which the machine it acts in its own mechanical function.”<\/p>\n<p>Jurisprudence has analyzed this type of behavior, differentiating in the &#8220;modus operandi&#8221; of this fraud, known as &#8220;scam&#8221;, various stages:<\/p>\n<p><strong>1st phase<\/strong>: <strong>Recruitment of intermediaries through the Internet and, especially, by email, through mass mailings of advertising from various merchants<\/strong> that make job offers to attract third parties who want to earn a large amount of money easily and quickly from their own home, opening or using their bank accounts as intermediaries, to receive amounts of money transferred from accounts of future clients.<\/p>\n<p><strong>2nd phase<\/strong>: <strong>It consists of the use of various procedures to obtain the passwords of the online banking user.<\/strong>”. <strong>The most common is the so-called “phishing”<\/strong>, which in turn consists of the massive sending of emails on behalf of supposedly banking entities, including some &#8220;links&#8221; that connect with web pages that have domain names similar to those of authentic banking entities, consisting of a form whose fields based on supposed security problems, they must be filled in through the Internet with the access keys and passwords. Once the victim provides the keys and sends them, instead of receiving them to the bank, the authors of the &#8220;phishing&#8221; do so.<\/p>\n<p><strong>The second modality is that of “Trojans<\/strong>”, by spreading viruses on the internet hidden in emails or distributed under the name of movies or songs. Once the computers are infected, the virus detects access to bank forms.<\/p>\n<p><strong>The third modality is that of “pharming<\/strong>”, which consists of the indiscriminate infection of computers, so that when the user types the address of their bank in the browser&#8217;s address bar, the browser automatically connects them to a false web page, a copy of the bank, in it the user tries to carry out their operations by entering their passwords without success receiving error messages, thus obtaining the authors of this modality their passwords.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The fraud computing It is a criminal phenomenon that in recent years is taking on greater magnitude and relevance in the field of computer crime, this being the main basis of computer crime on which cyber-crime revolves. Despite the differences that exist when establishing a unitary definition of the concept of computer fraud or computer [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":278,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/277"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=277"}],"version-history":[{"count":2,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/277\/revisions"}],"predecessor-version":[{"id":608,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/277\/revisions\/608"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/278"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=277"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=277"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=277"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}