{"id":294,"date":"2022-05-06T05:42:48","date_gmt":"2022-05-06T05:42:48","guid":{"rendered":"https:\/\/infobloom.site\/why-the-image-of-a-bored-monkey-is-worth-more-than-a-flat-in-madrid-the-strange-world-of-nfts-economy\/"},"modified":"2022-05-18T11:54:07","modified_gmt":"2022-05-18T11:54:07","slug":"why-the-image-of-a-bored-monkey-is-worth-more-than-a-flat-in-madrid-the-strange-world-of-nfts-economy","status":"publish","type":"post","link":"https:\/\/infobloom.site\/why-the-image-of-a-bored-monkey-is-worth-more-than-a-flat-in-madrid-the-strange-world-of-nfts-economy\/","title":{"rendered":"Why the image of a bored monkey is worth more than a flat in Madrid: the strange world of NFTs |  Economy"},"content":{"rendered":"<p class=\"\">There&#8217;s a fire in the neighborhood. Your daughter looks at you with an evil smile while in the background the flames devour a house. You press the photograph button. It becomes a meme baptized as <i>Disaster Girl (the girl of the disaster). <\/i>And 16 years after the famous snapshot, taken in 2005 in a small town in North Carolina, the NFT in the image sells for $500,000.<\/p>\n<p class=\"\">Stories like this have been populating the media for months with a tone of disbelief. The NFT (non-fungible tokens) market took off in 2021 moving some 41,000 million dollars, and the striking cases are almost endless. A factory of hard-to-believe headlines. In the UK, a 12-year-old boy made €340,000 from the sale of his collection of digital images of whales. The founder of the social network Twitter, Jack Dorsey, sold his first tweet for 2.4 million euros. And last week the footballer Neymar bought two digital works for 460,000 and 550,000 euros from the collection <i>Bored Ape Yacht Club<\/i> —in Spanish something like <i>the bored monkeys yacht club<\/i>—. One of the illustrations, shared on Twitter by the Brazilian from PSG, shows a monkey in a suit blowing a bubble gum and equipped with a party hat and futuristic glasses.<\/p>\n<p class=\"\">The amounts are surprising because they blow up the already fragile consensus about what is valuable and what is not, many times already cracked in traditional art, but they respond to a basic economic principle: supply and demand. The key to all this strange <i>boom<\/i> is that NFT technology makes it possible to identify the authenticity and owner of a digital work of art, an item for a video game —such as a new character or an object—, a tweet, a gif, a meme, a video, a song, a podcast, an electronic book, or anything else that circulates on the internet. That means that although we can all have the meme of <i>the disaster girl<\/i> saved in a file on our computer, there is only one authentic. Although the rest of us can download another one for free whose appearance is exactly the same.<\/p>\n<p class=\"\">Turning the internet into a space where almost everything has owners is a paradigm shift. In the sector, they equate the gap between the authentic and the copy with the thousands of reproductions of Van Gogh&#8217;s paintings that anyone can buy at bargain prices. It is possible to buy a version of <i>The starry Night<\/i> for a handful of euros, but they cost much less than what we would pay for the original that is exhibited in the Museum of Modern Art in New York. The answer to why someone would want to have an original of a Van Gogh painting is multiple and manageable: it may lie in the beauty of the painting or in the possibility of selling it for millions of euros. However, the question that makes the NFT universe so incomprehensible to a part of the population is this: why would someone want to pay for the digital image of a monkey more than the average value of a 130-square-meter flat in big cities? like Madrid or Barcelona?<\/p>\n<p class=\"\">There are two ways to answer it. Skeptics call the phenomenon sheer speculation at its kindest description, and sheer madness at its most blunt. A kind of little brother of cryptocurrencies -which is still a much larger market, valued at 1.5 trillion euros- born from a world where excess liquidity due to injections by governments and central banks, and the greed of a handful of millionaires and would-be millionaires would be creating digital monsters as overrated as 17th-century Dutch tulips.<\/p>\n<p>He knows in depth all the sides of the coin.<\/p>\n<p>subscribe<\/p>\n<p class=\"\">The second answer, that of its defenders, has to do with a change in the relationship with technology that blurs the barriers between the digital and the physical, and buries the perception that the tangible is more valuable than what we cannot touch. Perhaps social networks are for some a bottomless pit of frivolity and simplistic messages. But for others they have become much more. “There are people who collect historical moments from the internet. We make fun of memes, but in the morning they give you life, they are an important part of the internet”, says David Tomu, one of the launchers of MITO, a Spanish digital art gallery project at NFT. “The people who say that it is a scam is because they have not invested in time. Even the banks themselves realize that it is a technology that is here to stay”, he adds.<\/p>\n<p class=\"\">In cases such as the aforementioned collection <i>Bored Ape Yacht Club<\/i> -the monkeys-, in addition to Neymar, celebrities such as Paris Hilton and the American presenter Jimmy Fallon have invested, who have been criticized for speaking on the latter&#8217;s program about their NFTs, a conversation after which some see a covert promotion . The limited number of units available from the <i>Bored Ape Yacht Club<\/i> —there are only 10,000—, have made their possession a matter of status. Their owners have preferential access to other NFTs that they can resell, and they become part of an exclusive club on the Discord chat platform, where they can talk to each other.<\/p>\n<p class=\"\">Raúl Marcos explains that the NFT business is focused above all on three areas: art, collecting, and video games, and to a lesser extent on the metaverse, where it is already possible to buy and sell plots that do not physically exist. Marcos is the co-creator of the Botto project. It works like this: an artificial intelligence generates 350 digital works every week, then the community votes which one they like the most, and the chosen piece is converted to NFT format and auctioned off. Thus they have obtained 1.7 million dollars in exchange for 14 works. To buy an NFT it is necessary to pay with certain cryptocurrencies, a factor that for Marcos is not trivial. &#8220;People who have cryptocurrencies are more willing to spend it, sometimes they are like people in Dubai with money,&#8221; he compares. He points out that they do not have a special regulation because they are not financial assets, but digital ones. “I compare it to Internet domains. If you buy a domain for 100 euros and next year you sell it for 100,000 you pay taxes, but it is not a matter of financial regulation”.<\/p>\n<p class=\"\">In his opinion, NFTs should not be an investment, but a purchase based on one&#8217;s tastes, an aesthetic issue. “I wouldn&#8217;t want to have a Miró in the office because we don&#8217;t have an office, but I would like to have the NFTs of artists I like posted on my firm&#8217;s website. My advice is to always consider the NFT an expense, not an investment, and if it appreciates later and you want to sell it, go ahead, but it should not be the objective.<\/p>\n<p class=\"\">Given the figures that are handled and the resales, that ideal vision does not seem the most widespread. The prices of NFTs have reached levels similar to those paid by the most recognized artists: the auction house Christie&#8217;s sold the work last year for 57 million euros <i>Everydays: The First 5000 Days<\/i> (Every day: the first 5,000 days), a <i>collage<\/i> of 5,000 images that the artist known as Beeple collected over the past 13 years. It was the third highest price ever achieved by a living artist. Although the truth is that the astronomical figures that are paid tend to transcend the media, and not the failures of those who buy to resell more expensively and do not succeed. Neither the collections that pass without penalty or glory. &#8220;There are people making a lot of money with NFT, also people who have invested and lost everything, and people who have spent and are very happy with their collection and seeing it on a screen, on their website, or in their metaverse,&#8221; he summarizes. Frames.<\/p>\n<p>The play The First 5,000 days, by Beeple.Beeple<\/p>\n<p class=\"\">Among those accumulating the most is a mysterious Dubai-based music studio called 3F Music, which already has the meme of <i>the psycho girlfriend<\/i> (<i>Overly Attached Girlfriend<\/i>) for $411,000, the New York Times metacolumn on NFT for $560,000, or the aforementioned meme from <i>the disaster girl<\/i>. It is unknown if their intention is to resell them or monetize them in any way.<\/p>\n<p class=\"\">All that glitters is not always gold: Enrique Moris, an investor in cryptocurrencies and NFTs, warns that some owners buy their own launches or another of their partners acquires them at a high price to artificially make them more expensive, as a marketing tool, thus transferring the public the false idea that they are very valuable and can be revalued. The specter of speculation surrounds every step of NFTs. Sport is another vein, with collections like <i>messiverse<\/i>of soccer player Leo Messi, or disproportionate payments —200,000 dollars— for the video of a mate by NBA player Lebron James, easily found on YouTube.<\/p>\n<p class=\"\">Faced with accusations of blowing up a bubble, his supporters point out that his emergence has indisputable benefits. The clearest is that it is revitalizing the cultural scene. Artists like the Catalan Anna Carreras, dedicated to creating with computers, are earning money they never dreamed of earning for their creations, and that goose that lays the golden eggs can last over time: every time a work is resold, the author charges a percentage of between 5 and 10%. But as Moris points out, the jump to success is not that simple. “There is a fever of people who think they are going to release a collection of images of monkeys or whatever and they are going to sell them for a lot of money. They don&#8217;t realize that these collections are trading so much because they were the first NFTs.&#8221; Saving the distances, remember what happens with the phenomenon <i>youtuber<\/i>: there are many candidates, but those who make a living from it are few.<\/p>\n<p class=\"\">Interest is high and global. Recently, the word NFT has overtaken <i>crypto<\/i> in Google searches, thanks mainly to Asian users. Although Moris believes that what is truly disruptive are the uses that are not talked about as much. “They will serve as identifiers for practically everything. When you buy some concert tickets it&#8217;s going to be NFT, when you own a copyright on some kind of intellectual property it&#8217;s going to be an NFT identifier, when you own property in the metaverse it&#8217;s going to be a unique NFT that no one else is going to have . It will be a very useful tool in everything related to intellectual property and the identification of unique things on the internet”.<\/p>\n<p class=\"\">Contemporary art has already generated a complex debate about value and price, with cases as controversial as that of the completely blank paintings that the Danish artist Jens Haaning sold for more than 70,000 euros to a museum. he called them <i>take the money and run<\/i>and the museum that commissioned him sued him..<\/p>\n<p class=\"\">NFTs prolong that recurrent, subjective discussion. in his play <i>Art<\/i>, the French writer Yasmina Reza reflects this conflict well in the fight that breaks out between two friends over the acquisition by one of them precisely of a blank painting. &#8220;You will not have paid five million pesetas for that painting,&#8221; reproaches one another, angry at what he considers a complete scam. “Boy, it&#8217;s the price. It&#8217;s an ANTRIOS! ”, he replies. Today, in full swing, some investors may respond similarly to the incredulity of spending a small fortune on the image of a bored monkey. After all, it is an NFT.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There&#8217;s a fire in the neighborhood. Your daughter looks at you with an evil smile while in the background the flames devour a house. You press the photograph button. It becomes a meme baptized as Disaster Girl (the girl of the disaster). And 16 years after the famous snapshot, taken in 2005 in a small [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":296,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/294"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=294"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/294\/revisions"}],"predecessor-version":[{"id":604,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/294\/revisions\/604"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/296"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=294"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=294"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=294"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}