{"id":297,"date":"2022-05-06T06:18:22","date_gmt":"2022-05-06T06:18:22","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-what-everyone-talks-about\/"},"modified":"2022-05-06T06:18:22","modified_gmt":"2022-05-06T06:18:22","slug":"what-are-nfts-what-everyone-talks-about","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-what-everyone-talks-about\/","title":{"rendered":"What are NFTs?  what everyone talks about"},"content":{"rendered":"<p>For several months, NFTs have gained great popularity, especially because there are people who are making a lot of money with them.  What will this new trend be about and what is it for?  In <strong>Basher<\/strong> We bring you up to date on this much talked about topic.<\/p>\n<p><strong>What are NFTs about?<\/strong><\/p>\n<p>Non-Fungible Tokens or NFTs are products that operate as digital assets.  The idea of ​​buying a unique piece that only exists in the virtual world and that millions of people can see and produce, might be strange, but in reality we are facing the future.<\/p>\n<p>“After cryptocurrencies, a digital art called NFT appeared, and it was due to the impulse of many influencers that it has become quite popular.  As a result of the pandemic, many people have looked for new ways to invest, and found a great future in these digital assets”, said José Vargas, CEO of Basher Agency.<\/p>\n<p><strong>investment opportunity <\/strong><\/p>\n<p>When a digital piece is sold, the buyer will receive a digital token, that would be the NFT.  This asset cannot be easily exchanged like money, for example, ten soles for two coins of five.<\/p>\n<p>Among the characteristics of NFTs are the fact that they are: unique, indivisible, indestructible, absolute property, non-interoperable and verifiable.<\/p>\n<p>To make it clear why NFTs cannot be exchanged with each other, it is because no two are the same.  Your asset is unique, like a piece of digital art.<\/p>\n<p>According to Vargas, NFTs represent a great investment opportunity;  just as many invest in properties and companies, now you can also invest in land, for example on the Decentraland platform, with the aim of multiplying the value in the future.  He believes that those who first invested will be the most benefited.<\/p>\n<p>To acquire NFT&#8217;s, cryptocurrencies such as Ethereum&#8217;s Ether (ETH) or World Asset eXchange (WAX) must be used.  The former is more used to buy more popular NFTs, while the latter is more related to virtual personals and <strong>video game<\/strong>.<\/p>\n<p>Everything indicates that NFTs are a great investment opportunity and that in the future the value will multiply, but something to keep in mind is that there are malicious people with pyramid schemes who defraud people who do not know much about the subject.<\/p>\n<p><strong>NTFs and eSports<\/strong><\/p>\n<p>as for the world <strong>gaming, <\/strong>this is possibly the future, because while one spends money on video games, the industry could simply eliminate them at any time.  With the NTFs it would be different, because here the property of the asset would be guaranteed, since they would not belong to the developers of the video game.<\/p>\n<p>To give an example of the aforementioned, perhaps a skin purchased in Fortnite could be used in Roblox and sold to another for use in Minecraft.<\/p>\n<p>For people who want to get started in this world, Vargas recommends that you do a lot of research and not just get carried away by influencers or youtubers who often just want to create hype in their projects that often disappear.  On the other hand, he considers that in the future the industries that are already within the NFTs will be consolidated and many others will enter, since we will live in a virtual world.<\/p>\n<p>For people who want to get started in this world, Vargas recommends that you do a lot of research and not just get carried away by influencers or youtubers who often just want to create hype in their projects that often disappear.  On the other hand, he considers that in the future the industries that are already within the NFTs will be consolidated and many others will enter, since we will live in a virtual world.<\/p>\n<p>Today many sports are already entering the world of NFTs, as is the case of the UFC, some soccer clubs such as Paris Saint Germain and even the Peruvian National Soccer Team itself.<\/p>\n<p>As we can see, the possibilities are endless and are at the service of creativity;  it is almost a fact that the future will be virtual.<\/p>\n<\/p>\n<p>NFT&#8217;s<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For several months, NFTs have gained great popularity, especially because there are people who are making a lot of money with them. What will this new trend be about and what is it for? In Basher We bring you up to date on this much talked about topic. What are NFTs about? Non-Fungible Tokens or [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":299,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/297"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=297"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/297\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/299"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=297"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=297"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=297"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}