{"id":305,"date":"2022-05-06T09:17:30","date_gmt":"2022-05-06T09:17:30","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-and-why-is-everyone-talking-about-them-domainleader\/"},"modified":"2022-05-06T09:17:30","modified_gmt":"2022-05-06T09:17:30","slug":"what-are-nfts-and-why-is-everyone-talking-about-them-domainleader","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-and-why-is-everyone-talking-about-them-domainleader\/","title":{"rendered":"What are NFTs and why is everyone talking about them?  – DomainLeader"},"content":{"rendered":"<p>Find out what they are <strong>NFTs or non-fungible tokens<\/strong> and how they helped sell a digital image for $69 million.<\/p>\n<p>The world of cryptocurrencies is expanding and often brings us shocking news.  Blockchain technology is derived from these, which has been used in various fields or commercial sectors, and <strong>now it&#8217;s the art world&#8217;s turn<\/strong>.<\/p>\n<p>And it is that just by taking a walk through any city in the world, it is possible to find different expressions of art that have been sold for large sums of money.  This is because the original work can be displayed in only one space at a time.<\/p>\n<p>As is known, in Paris, there is the only representation of &#8220;La Gioconda&#8221; or &#8220;Mona Lisa&#8221; by Leonardo da Vinci.  But, if you write the name of this work in an Internet search engine, you will find the image repeated countless times.<\/p>\n<\/p>\n<p><source type=\"image\/webp\" \/><\/p>\n<\/p>\n<p>In the digital world it is very easy to replicate an image, audio or video, so millions of people can have with them an original representation of any artist&#8217;s digitized creation and in this way the work loses monetary value.<\/p>\n<p>But, NFTs came to solve this situation.  Below you will discover what they are and why it is that everyone talks about them.<\/p>\n<\/p>\n<h2><strong>What are NFTs?<\/strong><\/h2>\n<p>NTFs or Non-Fungible Tokens, <strong>they are a new species of digital assets that are unique, irreplaceable and cannot be exchanged for another similar<\/strong>.  For example, everyone who has a dollar bill has a good that has the same value.<\/p>\n<p>If these people exchange among themselves a note of the mentioned denomination, they will all continue to have the same value.  But, if you are the owner of a sculpture and intend to sell it, you will not find another like it on the market and its value increases over time.<\/p>\n<p>Although both cryptocurrencies and non-fungible tokens use blockchain technology, they differ in that <strong>cryptos are fungible or exchangeable, while NFTs are not<\/strong>.<\/p>\n<p>NFTs also have the quality that they cannot be copied.  This is what offers support so that unique digital files can be created in the world and that show the great value they have in the market.<\/p>\n<p>An example of this value was how Christie&#8217;s, a London auction house, sold through a marketplace an image called &#8220;Everydays: The First 5000 Days&#8221; created by the digital artist Beeple, for <strong>$69 million<\/strong>.<\/p>\n<p><strong>The token is then a kind of certificate<\/strong> which attests that the asset is original.  But, thanks to this, digital objects that may seem somewhat eccentric to you, such as a blog article, a tweet, an avatar, among others, have begun to take on value.<\/p>\n<\/p>\n<h2><strong>How do NFTs work?<\/strong><\/h2>\n<p>Non-fungible tokens work with blockchain or block chain technology, for which all <strong>the members of the network have a record that will provide proof that there is a single owner of the described asset<\/strong>.<\/p>\n<p>This chain of blocks belongs to the Ethereum network, so it is possible to manage the tokens using wallets that work with said currency.<\/p>\n<p>This platform uses a method called “proof of work” to create the digital assets in the form of non-fungible tokens.<\/p>\n<p>See how the market for these digital assets moves on the following platform:<\/p>\n<\/p>\n<p><source type=\"image\/webp\" \/><img loading=\"lazy\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1651828650_559_What-are-NFTs-and-why-is-everyone-talking-about-them.png\" alt=\"\" width=\"1343\" height=\"649\"\/><\/p>\n<\/p>\n<p>The famous game Axie Infinity is one of the forerunners in the field of NFTs.  In the last 24 hours, more than 26 million dollars in tokens have been traded.<\/p>\n<\/p>\n<h2><strong>Why Would Someone Buy an NFT?<\/strong><\/h2>\n<p>In past months the CEO of Twitter, Jack Dorsey, <strong>he sold his first tweet for $2.9 million<\/strong>.  While a video of Lebron James making a block in the middle of the game was sold by <strong>100 thousand dollars<\/strong>.<\/p>\n<p>So you know you&#8217;ll be wondering: why would anyone buy a digital item that anyone can enjoy?  The reason is that this object has begun to take on value, over time it is expected to increase and, now, the ownership belongs to that person.<\/p>\n<p>Imagine that you are the owner of a photo of Lionel Messi eating churros.  It seems silly, but it is a relevant figure in soccer today and in a few years it will be a legend, so more than one fan of this sport will want to buy it in a few years or right now.<\/p>\n<p>It may sound crazy, but it&#8217;s profitable.  The only reason, as in any market, is that a digital object has been given value, which is revalued over time even for simple pleasure.<\/p>\n<\/p>\n<h2><strong>Why is everyone talking about NFTs?<\/strong><\/h2>\n<p>Many companies are using this technology to create their own NFT coins and give value to digital objects such as land, houses or vehicles in virtual worlds.<\/p>\n<p>The market for NFTs has multiplied considerably, so much so that <strong>the work sold for 69 million dollars has increased its value to 20,000 million<\/strong>.  The rise comes despite warnings from financial experts.<\/p>\n<p>Even, <strong>some applications or websites would be offering loans by providing a non-exchangeable token as collateral<\/strong>.  Entertainment companies plan to create NFTs with excerpts from programs, images of actors and actresses, among others.<\/p>\n<p>While companies in the sports sector would venture into the world of NFTs with all kinds of materials for their fans.  These platforms create their own cryptocurrencies, which you must purchase to gain access to any NFTs available on the internal market.<\/p>\n<p>NFTs carry other controversies on their backs, such as, for example, that <strong>To generate one of these tokens, 200 kg of carbon are used due to energy consumption.<\/strong>.  This is part of the environmental problems that produce this type of technology.<\/p>\n<p>Some organizations around the world are looking for proposals to replace blockchain technology and reduce energy consumption.<\/p>\n<p>Thanks to the popularity of these tokens, too <strong>all kinds of scams or fraud have begun to be observed through sites that resemble the original operators<\/strong> of these digital assets.<\/p>\n<\/p>\n<h2><strong>conclusion<\/strong><\/h2>\n<p><strong>NFTs or Non-Fungible Tokens, are a type of unique digital asset, which cannot be exchanged<\/strong>.  They use blockchain technology to certify the digital object to which it is intended to give the identity.<\/p>\n<p><strong>OR<\/strong><strong>They use the Ethereum network for transaction processing<\/strong> and can be stored in wallets based on the aforementioned cryptocurrency.  They are bought with the idea that they will increase in value over time.<\/p>\n<p>Not only images have been categorized as NFTs, but also tweets, cars and houses in virtual environments, blog articles, among others.  There is still a lot of mistrust in financial advisors regarding this type of goods that are not regulated.<\/p>\n<p>In addition, due to the importance they have gained in the market, fraud mechanisms have also been created to steal these digital assets.<\/p>\n<p>For its part, <strong>environmental protection organizations are very concerned<\/strong> due to the amount of natural resources that are committed to the creation of a simple token.<\/p>\n<p>They hope to develop more environmentally friendly solutions that provide the same or better functionality for the digital world.<\/p>\n<p>Thanks for your time.  😉<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Find out what they are NFTs or non-fungible tokens and how they helped sell a digital image for $69 million. The world of cryptocurrencies is expanding and often brings us shocking news. Blockchain technology is derived from these, which has been used in various fields or commercial sectors, and now it&#8217;s the art world&#8217;s turn. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":306,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/305"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=305"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/305\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/306"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=305"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=305"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=305"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}