{"id":308,"date":"2022-05-06T11:17:16","date_gmt":"2022-05-06T11:17:16","guid":{"rendered":"https:\/\/infobloom.site\/hack-verified-twitter-accounts-to-steal-nfts\/"},"modified":"2022-05-18T11:53:44","modified_gmt":"2022-05-18T11:53:44","slug":"hack-verified-twitter-accounts-to-steal-nfts","status":"publish","type":"post","link":"https:\/\/infobloom.site\/hack-verified-twitter-accounts-to-steal-nfts\/","title":{"rendered":"Hack verified Twitter accounts to steal NFTs"},"content":{"rendered":"<ul>\n<li>Scammers have hijacked verified Twitter accounts to advertise a fake Azuki NFT token airdrop.<\/li>\n<li>Through a malicious link, the scammers are stealing the tokens of the victims that fall into the user link when they connect their wallet.<\/li>\n<\/ul>\n<p>Digital assets are growing in functionality and popularity every day, while new services appear that try to respond to current market needs.<\/p>\n<p>However, if you are an enthusiast of crypto assets, you should keep your eyes wide open, since like everything that is successful and money involved, there are groups of scammers in the industry willing to steal your money.<\/p>\n<p>This especially if you are a regular Internet user of the platform <strong>Twitter,<\/strong> since according to the medium Decrypt <strong>In this social network it has been reported that a series of tweets and publications have appeared in which users are tagged in a thread about a formidable opportunity to acquire <\/strong><strong>Azuki NFT.<\/strong><\/p>\n<p>Of course, it is enough to clarify that this Airdrop is not part of any official initiative of the Azuki developers.<\/p>\n<h2 id=\"hurto-de-cuentas-por-medio-de-phishing\">Theft of accounts, through phishing<\/h2>\n<p><strong>According to some statements of subjects who were victims of the trap<\/strong> and who asked to remain anonymous, <strong>indicated that their accounts were compromised through an email from <\/strong><strong>phishing<\/strong><strong>, <\/strong>which was supposedly sent by the Twitter support team.<\/p>\n<p>Likewise, one of those affected indicated that his already hacked account sent just over 6 thousand tweets, and almost all of them with potential victims tagged.<\/p>\n<p>One of the main objectives of the scammers is to take control of verified accounts, since in this way they can make the deception more solid, by giving the appearance of being reliable, more easily convincing NFT collectors to interact with your posting and therefore fall into the trap.<\/p>\n<h2 id=\"%C2%BFc%C3%B3mo-funciona-la-estafa\">How does the scam work?<\/h2>\n<p>If it is the case that you are tagged, be careful! <strong>Do not click on the link, much less connect your Ethereum wallet, because if you fall into the trap, what will happen is that hackers and scammers will take control of your wallet.<\/strong><\/p>\n<p><strong>The first part of the scam consisted of taking control of already verified accounts<\/strong>, which included journalists and media professionals. Once they have the domain of the account, they changed the text and the images of the profile in order to simulate that the account belonged to one of the co-creators of the Azuki project. It should be noted that the real founders all use pseudonyms, which you can check on the Chiru Labs website.<\/p>\n<p><strong>Once the stolen accounts were “facelifted”, the scammers posted links promising a secret Beanz airdrop. <\/strong>This non-fungible token was released for free only to existing Azuki NFT holders last week.<\/p>\n<p>As part of the scam, the post states that interested NFT collectors (and potential victims) need to click on the link to &#8220;claim a bean&#8221;, and then ask them to connect their Ethereum wallet to make the fraud effective.<\/p>\n<p><strong>If you fall into the trap and connect your wallet, what will happen is that the scammers will be able to get hold of your NFTs.<\/strong><\/p>\n<h2 id=\"sin-cifras-del-da%C3%B1o-hasta-el-momento\">No damage figures so far<\/h2>\n<p>At the moment, there are no official figures that indicate the depth of the damage of this scam in the crypto community.<\/p>\n<p>In this regard, one of those interviewed by the specialized portal Decrypt indicated that once he managed to regain control of his Twitter account, he received a barrage of direct messages from annoying people who were duped and who furiously requested the return of their Stolen NFTs.<\/p>\n<p>For those who are not very aware of the matter and why this scam works, it is necessary to point out that Azuki is one of the most popular new projects of non-fungible tokens, which has managed to generate in the secondary market a volume of operations around $563 million. dollars since its launch last January, according to information provided by CryptoSlam.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Scammers have hijacked verified Twitter accounts to advertise a fake Azuki NFT token airdrop. Through a malicious link, the scammers are stealing the tokens of the victims that fall into the user link when they connect their wallet. Digital assets are growing in functionality and popularity every day, while new services appear that try to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":309,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/308"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=308"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/308\/revisions"}],"predecessor-version":[{"id":603,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/308\/revisions\/603"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/309"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=308"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=308"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=308"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}