{"id":310,"date":"2022-05-07T01:04:17","date_gmt":"2022-05-07T01:04:17","guid":{"rendered":"https:\/\/infobloom.site\/scammers-hack-verified-twitter-accounts-to-steal-nft-from-victims\/"},"modified":"2022-05-07T01:04:17","modified_gmt":"2022-05-07T01:04:17","slug":"scammers-hack-verified-twitter-accounts-to-steal-nft-from-victims","status":"publish","type":"post","link":"https:\/\/infobloom.site\/scammers-hack-verified-twitter-accounts-to-steal-nft-from-victims\/","title":{"rendered":"Scammers Hack Verified Twitter Accounts to Steal NFT from Victims"},"content":{"rendered":"<h4 color=\"#333\" class=\"sc-e93b592e-4 cXcZBp\">Tips:<\/h4>\n<ul>\n<li class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">A group of scammers is allegedly hacking the verified accounts of several prominent people in the industry, in order to promote a phishing scheme promising gifts of NFTs from Azuki.<\/li>\n<li class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">Whoever accesses the links after trusting the promoters and connects their wallet to the site, shares control of their wallet and opens the opportunity for criminals to steal their NFTs.<\/li>\n<\/ul>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">Twitter users!  Beware: if you have been tagged in a thread about an amazing opportunity to get free Azuki NFTs, do not click the link or connect your Ethereum wallet.  This is likely part of a recent scam, and is not an official initiative from the creators of Azuki.<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">Scammers are hacking the accounts of verified Twitter users, including journalists and media professionals, then changing the profile text and images to suggest that the account belongs to one of the co-creators of the popular Azuki project (the real thing). founders of Chiru Labs all use pseudonyms).<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">From there, the scammer tweets a link promising a &#8220;secret airdrop&#8221; of Beanz, the delivery of NFTs that were doled out for free only to Azuki NFT holders last week.  The tweet suggests that community NFT collectors must click the link to &#8220;claim a bean&#8221;, and are then asked to connect an Ethereum wallet as part of the fraudulent scheme.<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">Ultimately, what seems to happen is that people who connect a wallet to the site have their NFTs stolen from their respective wallets.  They do not receive NFTs from Beanz or anything in return.<\/p>\n<p>A screenshot of the type of tweet used in the scam, which also included an image of a Beanz NFT.  Image: Twitter<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">In at least two cases, the journalist in question had their account compromised via a phishing email purporting to be sent by Twitter support.  A journalist, who spoke with <i>Decrypt<\/i> Speaking on condition of anonymity, he said his account had sent more than 6,000 tweets, almost all of which tagged multiple potential victims for the scheme.<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">The Azuki-themed scam is much like a recent one around ApeCoin (APE), the Ethereum-based token created for the fledgling Web3 ecosystem being built around Yuga Labs&#8217; NFT Bored Ape Yacht Club project.<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">In March, it was reported that more than $1 million worth of NFTs were stolen from collectors who interacted with a Twitter scam, which promised to drop an ApeCoin token reward on users.  However, when someone connected a wallet, the scammers also stole the NFTs in the wallet, including Bored Ape and Mutant Ape Yacht Club collectibles, in some cases.<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">Similar to the Azuki scam, the ApeCoin scammers hijacked the Twitter accounts of verified users, including journalists, claiming to be founders of Yuga Labs and the Bored Ape Yacht Club.  Interestingly, some of the victims of the ApeCoin scam claimed that they did not connect their wallet to the indicated website, but still said that their NFTs had been stolen.<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">Through the use of stolen verified Twitter accounts, scammers have been able to convince some NFT collectors to engage with their malicious scheme.  In some cases, people have responded to tweets openly asking why Twitter would verify a scammer, but it&#8217;s the other way around: a scammer had stolen a verified account to give the appearance of being reputable.<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">In both cases, it must be made clear that the real creators of the Bored Ape Yacht Club and Azuki NFT projects are not behind these scams.  ApeCoin was only sent to the wallets of BAYC NFT holders, while Beans have only been sent to Azuki NFT holders.  These are exclusive benefits for owners of these valuable NFT collectibles.<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">An NFT acts as a deed of ownership of a unique digital item, and the broader market produced some $25 billion of trading volume in 2021 alone, and more than $12 billion more in the first quarter of this year.  Popular NFT use cases include profile pictures (such as Azuki), sports collectibles, interactive video game items, etc.<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">The extent of the overall damage from Azuki&#8217;s scam is currently unclear.  The journalist with whom he spoke <i>Decrypt<\/i> He said that once he got his Twitter account back, he received numerous direct messages from people who had been scammed requesting the return of their stolen NFTs.  The journalist no longer had the DMs to share with Decrypt.<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">One of the media professionals most recently affected by the scam was Emily Buder, head of video for Quanta Magazine, whose account was apparently hijacked today.  As the screenshot above shows, her profile kept her real name intact, but she was listed as Azuki&#8217;s co-creator, as well as a former Overwatch video game artist.<\/p>\n<p><img alt=\"\" src=\"data:image\/gif;base64,R0lGODlhAQABAIAAAAAAAP\/\/\/yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" decoding=\"async\" data-nimg=\"responsive\" class=\"object-contain absolute inset-0 box-border p-0 border-0 m-auto block w-0 h-0 min-w-full max-w-full min-h-full max-h-full\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:contain\"\/>Journalist Emily Buder&#8217;s account was hijacked and posed as that of an Azuki co-creator.  Image: Twitter<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">Whoever controlled Buder&#8217;s account at the time tweeted the scam and then proceeded to tag thousands upon thousands of people in a thread of subsequent tweets.  Azuki&#8217;s fraudulent branding and images have been removed from the account, but the tweets are still visible at the time of writing.<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\"><i>Decrypt<\/i> He emailed Buder for additional information about the attack, but received no response. <i>Decrypt<\/i> also contacted Twitter for comment on the Azuki-themed NFT scam and the rise of examples of NFT-related scams on the platform.  A Twitter representative confirmed that the company is &#8220;aware of and actively working on a solution to combat&#8221; these scams.<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">Azuki is one of the hottest new NFT projects to launch so far in 2022, generating some $563 million in secondary market trading volume since its launch in January, according to data from CryptoSlam.<\/p>\n<p class=\"font-meta-serif-pro font-normal text-lg sm:text-xl sm:leading-9 tracking-px text-body\">A single Azuki NFT sold for a record $1.42 million last week.  Beanz NFTs, meanwhile, have already recorded $60 million in trading volume since their launch last week.<\/p>\n<h3 class=\"font-ak-bold text-lg leading-none text-neutral-800\">The best of Decrypt straight to your inbox.<\/h3>\n<p><img src=\"data:image\/gif;base64,R0lGODlhAQABAIAAAAAAAP\/\/\/yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" decoding=\"async\" data-nimg=\"fill\" class=\"object-cover absolute inset-0 box-border p-0 border-0 m-auto block w-0 h-0 min-w-full max-w-full min-h-full max-h-full\" style=\"position:absolute;top:0;left:0;bottom:0;right:0;box-sizing:border-box;padding:0;border:none;margin:auto;display:block;width:0;height:0;min-width:100%;max-width:100%;min-height:100%;max-height:100%;object-fit:cover;object-position:left center\"\/><\/p>\n<p>Get the top stories curated daily, weekly roundups &#038; deep dives straight to your inbox.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Tips: A group of scammers is allegedly hacking the verified accounts of several prominent people in the industry, in order to promote a phishing scheme promising gifts of NFTs from Azuki. Whoever accesses the links after trusting the promoters and connects their wallet to the site, shares control of their wallet and opens the opportunity [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":311,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/310"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=310"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/310\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/311"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=310"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=310"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=310"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}