{"id":312,"date":"2022-05-07T02:42:22","date_gmt":"2022-05-07T02:42:22","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-the-latest-bubble-about-to-burst-or-the-start-of-a-crypto-world-technology\/"},"modified":"2022-05-07T02:42:22","modified_gmt":"2022-05-07T02:42:22","slug":"what-are-nfts-the-latest-bubble-about-to-burst-or-the-start-of-a-crypto-world-technology","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-the-latest-bubble-about-to-burst-or-the-start-of-a-crypto-world-technology\/","title":{"rendered":"What are NFTs?  The latest bubble about to burst or the start of a crypto world |  Technology"},"content":{"rendered":"<p>The world of art has found the formula to preserve the essence of exclusivity that gives value to so many unique and unrepeatable works in the difficult era of digital copies.  Do you know what NFTs are?  We tell you.<\/p>\n<p>Videos, music, trading cards, photographs&#8230; except for sculptures, a large part of the art world has been shaken by the irruption of the digital world.  The ease with which we can copy, download and share content on the web makes it difficult to sell and author works.  NFTs seem to be here to reset the art market, but perhaps their future is even broader.<\/p>\n<p>It started as a fashion to collect <strong>small images only 8 bits<\/strong> and has exploded in the last year to be almost every day in the media.  In his latest Twitter &#8220;prank,&#8221; Elon Musk threatened to sell a song about NFTs that he apparently created. <\/p>\n<p>Apart from the eccentricities of the SpaceX tycoon to which we are accustomed, a video of the artist Beeple has sold for 6,600 million dollars.  The <strong>DJ 3LAU<\/strong> has sold 33 &#8216;tokens&#8217; of his digital records for more than <strong>$11 million<\/strong>.  Even one of Banksy&#8217;s works has been exposed to the latest internet craze, NFTs.<\/p>\n<p>Almost everything that is offered are works that we can easily replicate and share with friends on social networks, but thanks to NFTs they keep their value of authenticity and property intact.  This is the practical part, then there is the fashion and the spectacle that accompanies every boom. <\/p>\n<p>Carlos Alcocer from AMGaleria, the first entirely digital gallery in Latin America, assures that there is a lot of passing fashion, but also a promising future in this technology: &#8220;what we are seeing now is the tip of the iceberg, I think that as soon as people start adding utilitarian value to NFT, it&#8217;s going to be part of everyday life in society and it&#8217;s going to totally explode.&#8221;<\/p>\n<h2 class=\"title\">Blockchain, the root of NFTs<\/h2>\n<p>NFTs emerged several years ago on Ethereum, a network of blocks or blockchain that produces cryptocurrencies.  Its origin is due to the passion for collecting, <strong>CryptoPunks and CryptoKitties <\/strong>they were the first projects that reached significant relevance and aroused interest in this technology.<\/p>\n<p>The trick of the NFTs hides behind the <strong>Blockchain technology or chain of blocks<\/strong>, whose structure is very difficult to hack or manipulate.  Each block of the chain contains certain information, such as the data of a work of art or that of a cryptocurrency transaction.  As a result of this information, the hash is created, a unique code that connects one block with the next, making the chain grow.<\/p>\n<p>All blockchain users have a copy of that chain, so if someone else tries to tamper with it, it&#8217;s easy to find out by not matching the other copies.  This is what is known as <strong>distributed databases (DLT)<\/strong> and its democratic essence has become the perfect terrain for the flourishing of cryptocurrencies outside official currencies and exchange systems such as NFTs. <\/p>\n<p>Ethereum is the blockchain where NFTs were born and where the largest market is located, but after its popularization other platforms have emerged (Binance Smart Chain, TRON, Cardano, Avalanche) and markets dedicated to the sale of NFTs such as OpenSea and Nifty Gateway.  &#8220;The problem that Ethereum has is that the transaction costs are very high, so other artists who do not have the resources to mint a piece, look for these alternatives&#8221; explains Alcocer, &#8220;it may happen that that blockchain that offers them free transactions at some point goes away, goes out of maintenance, and then buyers and artists will lose their NFTs.&#8221;<\/p>\n<p>Carlos Alcocer recommends us <strong>try cardano<\/strong>, another blockchain that, like Ethereum, has smart contracts.  The <strong>smart contracts <\/strong>they are agreements, purchases or digital contracts in which, due to the very essence of the blockchain, they do not need the supervision of third parties, nor do they need to carry out costly legal procedures.<\/p>\n<p>In this way, the signature of a notary is not required, for example, to validate the agreement, here it is the computers and the block chain that store the documentation and electronic signatures and certify that it has not been altered by either party. the agreed.  Banks and large companies are starting to take an interest in smart contracts as a transaction method for the future, and not just as a mechanism to invest in pieces of art.<\/p>\n<p>&#8220;All the people who want to get into this, definitely the two places where they should be are Twitter and Discord, forget about Facebook, it doesn&#8217;t look like NFT at all&#8221; explains Alcocer, who also emphasizes the promotional power it has for users. artists this new market and the relationship it can create between creators and buyers. <\/p>\n<p>AMGaleria currently works for <strong>give visibility to Latin American artists<\/strong> in the NFT market.  &#8220;It&#8217;s a bit complicated, precisely because artists have a hard time understanding this&#8221;, they have also found less buyer market in Latin America, compared to the United States and Europe &#8220;definitely Latin America is very much in its infancy, there are people buying, but most of the communication comes from North America and Europe.&#8221;<\/p>\n<h2 class=\"title\">The first stolen NFTs<\/h2>\n<p>Caution and security measures are still required in the NFT market.  Although the blockchain has a reputation for being impenetrable, we must not lower our guard.  At AMGaleria they recommend not sharing the key of the wallets where cryptocurrencies and NFTs are stored. <strong>Cases of stolen NFTs have already been reported at the Nifty Gateway. <\/strong><\/p>\n<p>The company attributes the theft to the fact that the affected users did not have activated the two-step verification that reinforces the security of the accounts and this has made it easier for hackers to access the users&#8217; mail and from there to the Nifty Gateway account.  A process similar to the theft of bank accounts by phishing or SIM Swapping.<\/p>\n<p>Caution should also be exercised when buying or investing more money in NFTs than we can really afford to lose.  This market, in addition to promoting the creation and sale of art, is being used as a speculative system and is <strong>a very dangerous game<\/strong> with which you can win a lot of money, but also lose it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The world of art has found the formula to preserve the essence of exclusivity that gives value to so many unique and unrepeatable works in the difficult era of digital copies. Do you know what NFTs are? We tell you. Videos, music, trading cards, photographs&#8230; except for sculptures, a large part of the art world [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":313,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/312"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=312"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/312\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/313"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=312"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=312"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=312"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}