{"id":315,"date":"2022-05-07T11:52:14","date_gmt":"2022-05-07T11:52:14","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-should-you-invest-in-them\/"},"modified":"2022-05-07T11:52:14","modified_gmt":"2022-05-07T11:52:14","slug":"what-are-nfts-should-you-invest-in-them","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-should-you-invest-in-them\/","title":{"rendered":"What are NFTs?  Should you invest in them?"},"content":{"rendered":"<p><\/p>\n<p>From street art to unreleased songs and even artificial intelligence, NFTs are capturing attention.  But what exactly are they and why are they so popular?<\/p>\n<p>With the cryptocurrency market and decentralized technology space experiencing growth in demand, one area in particular that is really exploding in 2022 is the art of non-fungible tokens (NFTs).<\/p>\n<p>Data from the NFT NonFungible market analyst shows sustained growth.  Since NonFungible started tracking data in 2018, the total spend on NFTs to date reaches $480 million (as of February 2022).  In fact, the data suggests that the “NFT craze” is actually rather recent.  In 2021, the first NFT artwork was sold at a major auction house for $69,346,250 during an online auction hosted by Christie&#8217;s.<\/p>\n<p>But what exactly are NFTs, and why are they becoming so popular?<\/p>\n<h2>What are NFTs?<\/h2>\n<p>A non-fungible token (NFT) is a unique cryptographic object that exists on a blockchain.<\/p>\n<h3>Uniqueness<\/h3>\n<p>The unique character of NFTs comes from the original data that is linked to each NFT, that is, it is data that serves to distinguish them from any other, and that makes them invalid to be exchanged as equals.  Their uniqueness is also precisely what gives them value.<\/p>\n<p>This data could be anything.  From a string of binary code (eg 1010101001001001…) to complete works of Shakespeare.  NFT data can also include images such as PNG or JPEG files.<\/p>\n<h3>non-expendable<\/h3>\n<p>Essentially, NFTs are not fungible.  In simple words, this means that they are not mutually interchangeable and, typically, cannot be broken down into smaller pieces, as is the case with cryptocurrencies, thus further solidifying their value.  In fact, it is both the latter and the non-fungible nature that make NFT art attractive.<\/p>\n<p>Artists can store images of their pieces in unique, indivisible NFTs, and sell them globally in seconds.  However, artists can also create digital art directly in NFT format.  That is, create completely unique pieces that only exist in the form of a non-fungible token.<\/p>\n<h3>NFTs vs Crypto: What&#8217;s the Difference?<\/h3>\n<p>The main difference is that cryptocurrencies like Bitcoin (BTC) are crypto assets that do not have any unique attributes.  This means that each of the 19 million BTC in existence is equal to any other BTC, and that each can also be divided into infinitesimal fractions.  According to this, if one BTC is exchanged for another, no one would notice, but as with NFTs, a bitcoin cannot be copied.<\/p>\n<h2>Examples of NFTs<\/h2>\n<h3>CryptoKitties<\/h3>\n<p>The most famous example of an NFT-based digital art in the crypto space is that of the CryptoKitties.  CryptoKitties is a feline-themed game, based on individual cat NFTs (known as CryptoKitties).  Each one is unique in appearance, having certain non-interchangeable characteristics.<\/p>\n<p>Trivial as they may seem, at their peak of popularity in 2017, an individual CryptoKitties sold for 600 Ethereum (ETH), which would be $170,000 today.  Now, however, the bill is even more expensive: $1.1 million at current market prices.<\/p>\n<h2>NFT art in pop culture<\/h2>\n<p>Today, unique replicas of pieces by famous artists are being turned into NFTs.<\/p>\n<p>In early 2021, NFT art made history with a piece by British artist Banksy, purchased and immortalized as NFT, before being cremated.  After this, the only copy of the piece now exists on a blockchain.  The work sold for $100,000, but is almost certain to increase in value in its new digital form.<\/p>\n<p>NFTs have also crept into the music industry.  Rapper Torey Laez debuted three songs from his highly anticipated album “Playboy” as NFTs using a Marketplace built on the Bondly Finance DeFi platform.  The artist followed in the footsteps of DJ 3lau, who recently sold an NFT collection of his music for over 11 million.  In March, Kings of Leon released a tokenized album that generated at least $1.45M, or 820 Ether, in sales in its first five days.<\/p>\n<p>The artists themselves benefit from being able to sell directly to their fans, thus avoiding commissions paid to record labels and receiving more of the value of their music.<\/p>\n<p>In 2022, NFT enthusiasts will have to keep an eye out for new NFT art and projects that can reap huge profits as well as contribute to this innovative art industry.<\/p>\n<h2>Are NFTs a good investment?<\/h2>\n<h2><img loading=\"lazy\" class=\"alignnone wp-image-1234 size-full\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/What-are-NFTs-Should-you-invest-in-them.jpeg\" alt=\"\" width=\"1100\" height=\"619\"  \/><\/h2>\n<p>Just as art investors try to invest in popular works by world-renowned artists, so should you if you want to invest in NFT art.  Art will never die and NFT art is certainly a popular and unique form.  The value of investing in NFTs comes not only from the value conferred by their scarcity and originality, but in the application of those attributes to popular aspects of social culture.<\/p>\n<p>What football fan wouldn&#8217;t want the only official digital copy of their favorite player&#8217;s image?  What music fan wouldn&#8217;t want to own the only copy of an unreleased piece of music by their favorite artist or group?<\/p>\n<p>What&#8217;s more, new uses for NFTs are making headlines everywhere.  From commemorating famous athletes or events to important acts of political history.<\/p>\n<p>One of the most technically impressive immortalizations of digital art in this form comes from the 0xmons project.  They use something called a generative adversarial network (GAN) to create pixelated figures, recorded on NFTs.  A GAN is a tool that uses artificial intelligence to predict what real life objects would look like.  They are used in facial recognition technologies, as well as for nefarious &#8216;deepfakes&#8217;.<\/p>\n<p>These various use cases for NFTs surprise and drive their price higher, which is perfect for NFT investors.  With weekly earnings of $50 million, the number of investors in NFT is growing day by day.  Will you make the jump?<\/p>\n<p>As always, this article does not constitute financial advice and you should ensure that you do your own research and consult a professional financial advisor before making any investment decisions.<\/p>\n<p>To stay up to date on all things cryptocurrency, you can like Xcoins on Facebook and follow us on Twitter, Instagram, and LinkedIn.<\/p>\n<h2>Frequent questions<\/h2>\n<p><strong class=\"schema-faq-question\">What are NFTs?<\/strong> <\/p>\n<p class=\"schema-faq-answer\">NFT stands for Non-Fungible Token.  They extract value from the uniqueness of the data added to each NFT and the fact that they are non-fungible.  Non-fungible means that they are not mutually interchangeable and typically cannot be broken down into smaller pieces like cryptocurrencies.  This further solidifies its value.<\/p>\n<p>  <strong class=\"schema-faq-question\">An example of NFT?<\/strong> <\/p>\n<p class=\"schema-faq-answer\">CryptoKitties is a cat-themed fire, with individual cat NFTs (known as CryptoKitties) at the center.  Each one is unique in appearance, having some unchanging characteristics.<\/p>\n<p>  <strong class=\"schema-faq-question\">Who are some of the famous artists that are issuing NFTs?<\/strong> <\/p>\n<p class=\"schema-faq-answer\">Banksy, Kings of Leon, DJ 3lau, and rapper Torey Laez have released NFT art projects.<\/p>\n<p>  <strong class=\"schema-faq-question\">Are NFTs a good investment?<\/strong> <\/p>\n<p class=\"schema-faq-answer\">As of early 2022, the total value of NFTs sold is $480 million and the trend is up.  However, the value of an individual NFT depends on its staying popular, and that is far from guaranteed.  It is the uniqueness of NFTs that sets them apart from crypto, but that also increases the risk factor.  While the gains some have experienced from investing in NFTs are huge, the risk is more difficult to understand.  If you are new to the crypto space, then buying and holding crypto may be your safest bet.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>From street art to unreleased songs and even artificial intelligence, NFTs are capturing attention. But what exactly are they and why are they so popular? With the cryptocurrency market and decentralized technology space experiencing growth in demand, one area in particular that is really exploding in 2022 is the art of non-fungible tokens (NFTs). Data [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":318,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/315"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=315"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/315\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/318"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=315"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=315"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=315"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}