{"id":321,"date":"2022-05-08T11:13:06","date_gmt":"2022-05-08T11:13:06","guid":{"rendered":"https:\/\/infobloom.site\/the-arrival-of-nfts\/"},"modified":"2022-05-18T11:57:17","modified_gmt":"2022-05-18T11:57:17","slug":"the-arrival-of-nfts","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-arrival-of-nfts\/","title":{"rendered":"The arrival of NFTs"},"content":{"rendered":"<p>NFTs are the new big thing and their popularity will put pressure on the energy world. So far in 2021 alone, sales of NFTs represented 2.5 billion dollars (mdd) in the world; this is an increase of 1000%, compared to the transactions recorded in 2020.<\/p>\n<p>With this introduction, you probably already want to know more about NFTs.<\/p>\n<p>We have already talked in this space about how so many things have been digitized in recent years, including money, with cryptocurrencies. Now it is the turn of the NFTs that are using the same blockchain technology.<\/p>\n<h2>What are NFTs?<\/h2>\n<p>NFT stands for non-fungible token; We can translate it into Spanish as a non-fungible token or voucher. Now, fungible is the property that some elements have of being consumed over time; to become obsolete; to be perishable, or to run out over time. This is something that we have already talked about in this space.<\/p>\n<p>In such a way that NFTs aim to create a single and indivisible chain (unlike bitcoin) that can be exchanged. In this new digital world — where digital file sharing is the daily bread — NFTs would make it possible to trace the original owner of a photo, a video, an audio and any type of digital file.<\/p>\n<p>It is a revolution in many aspects. For example, in enforcing digital copyright. NFT chains could report which users use some type of digital file to demand royalties. But the current boom is not in these smart contract applications, but in the use of NFTs to sign digital art or the like.<\/p>\n<p>For example, someone bought the first tweet from Jack Dorsey, one of the founders of Twitter. This is where things get ethereal; actually the tweet was not bought as such, but a token indicating that the tweet was bought. Does it seem weird to you? It gets worse.<\/p>\n<h2>Digital proof of purchase<\/h2>\n<p>You could take a photo, put it on Instagram and sell that same photo for a few million dollars. But it&#8217;s not the physical photo, you don&#8217;t get rid of the digital file, you just provide digital proof that you bought that file. You could find the same file on the internet later or a copy; however, whoever has it will not have the digital proof, the NFT, of the collector who bought that electronic work.<\/p>\n<p>Some works may be limited, say one tweet might only sell 50 NTFs; would there be only 50 people with that digital collector&#8217;s proof or only one time or include the reproduction rights in the sale. The options are multiple and we all like to collect something, including digital chains of information.<\/p>\n<p>Those who downloaded even once Pokemon Go or a similar game will not be able to deny it. The idea is the same, digital collectors seek to have all possible proof of electronic purchase through the NTFs.<\/p>\n<p>But going back to the center of our column. What does that have to do with energy? It could be that nothing, that the NTFs are a passing bubble; that nobody uses them in the future, and they end up being one more blockchain application that did not survive in the future.<\/p>\n<p>However, if NTFs continue to trend, they could put pressure on the international energy system.<\/p>\n<p>Let us remember that Bitcoin requires an intensive use of electrical energy, equivalent to 60% of all data centers in the world. If the activity by itself were a country, it would be number 29 in highest electricity consumption.<\/p>\n<p>So, if the NTFs became widespread, it would put pressure on the electrical systems by requiring energy, not only for the digital chains, but also to store them over time.<\/p>\n<p>Time will tell if NTFs are truly permanent.<\/p>\n<p>The arrival of NFTs | Brenda Peralta<\/p>\n<p id=\"block-62ca92d7-484d-41cb-8307-5684a6ef7f01\">The opinions published in this column are the responsibility of the author and do not represent any position on the part of Business Insider Mexico.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>NFTs are the new big thing and their popularity will put pressure on the energy world. So far in 2021 alone, sales of NFTs represented 2.5 billion dollars (mdd) in the world; this is an increase of 1000%, compared to the transactions recorded in 2020. With this introduction, you probably already want to know more [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":323,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/321"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=321"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/321\/revisions"}],"predecessor-version":[{"id":612,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/321\/revisions\/612"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/323"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=321"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=321"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=321"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}