{"id":327,"date":"2022-05-08T11:51:56","date_gmt":"2022-05-08T11:51:56","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-blockchain-based-collectible-digital-assets-marketing-4-ecommerce\/"},"modified":"2022-05-08T11:51:56","modified_gmt":"2022-05-08T11:51:56","slug":"what-are-nfts-blockchain-based-collectible-digital-assets-marketing-4-ecommerce","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-blockchain-based-collectible-digital-assets-marketing-4-ecommerce\/","title":{"rendered":"What are NFTs, blockchain-based collectible digital assets &#8211; Marketing 4 Ecommerce"},"content":{"rendered":"<p><img alt=\"Facebook\" title=\"Share on Facebook\" class=\"synved-share-image synved-social-image synved-social-image-share\" width=\"48\" height=\"48\" style=\"display: inline;width:48px;height:48px;margin: 0;padding: 0;border: none\" src=\"https:\/\/marketing4ecommerce.net\/wp-content\/plugins\/social-media-feather\/synved-social\/addons\/extra-icons\/image\/social\/clearslate\/96x96\/facebook.png\"\/><img alt=\"Twitter\" title=\"Share on Twitter\" class=\"synved-share-image synved-social-image synved-social-image-share\" width=\"48\" height=\"48\" style=\"display: inline;width:48px;height:48px;margin: 0;padding: 0;border: none\" src=\"https:\/\/marketing4ecommerce.net\/wp-content\/plugins\/social-media-feather\/synved-social\/addons\/extra-icons\/image\/social\/clearslate\/96x96\/twitter.png\"\/><img alt=\"linkedin\" title=\"Share on Linkedin\" class=\"synved-share-image synved-social-image synved-social-image-share\" width=\"48\" height=\"48\" style=\"display: inline;width:48px;height:48px;margin: 0;padding: 0;border: none\" src=\"https:\/\/marketing4ecommerce.net\/wp-content\/plugins\/social-media-feather\/synved-social\/addons\/extra-icons\/image\/social\/clearslate\/96x96\/linkedin.png\"\/><\/p>\n<p><strong>The idea of ​​collecting objects has always been present among us.<\/strong> We could even say that it is one of the most common hobbies in the world.  They can be coins, sports cards, or albums like those of the Panini World Cups.  Also, with a somewhat more refined approach are the art collections, which are especially based on exclusivity.<\/p>\n<p>For the same reason, people tend to spend <strong>huge amounts of money<\/strong> in the acquisition of pieces of art or unique objects to add to your collection.  But&#8230; if the main objective of a collection is to maintain the exclusivity of a piece, <strong>How can it be applied in a digital environment?<\/strong> Digital products are generally available to everyone and can be copied, thereby losing their uniqueness.  Nevertheless,<strong> NFTS, or non-fungible tokens,<\/strong> they are a new trend that puts a spin on this problem.<\/p>\n<h2>What are NFTs<\/h2>\n<p>Non-fungible tokens are unique assets belonging to the digital environment and therefore <strong>do not have a physical form<\/strong>, that is, they are not tangible.  An NFT cannot be exchanged for another like it, or used as a means of exchange for another asset.<\/p>\n<p>That said, NFTs are unique assets that represent a digital piece, which can be any type of content on the internet, <strong>Usually audiovisual.<\/strong> For example, <strong>jack dorsey<\/strong>founder of Twitter,<strong> has put up for auction the first tweet ever written, with bids of up to 2.5 million dollars, just over 2 million euros.<\/strong><\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">just setting up my twttr<\/p>\n<p>—jack⚡️ (@jack) March 21, 2006<\/p>\n<\/blockquote>\n<p>From the example in this tweet, it&#8217;s easier to understand how these digital collectibles work compared to owning the pieces in real life.  When acquiring an NFT <strong>this would rather represent a certificate of ownership of a specific content, than the piece itself.<\/strong><\/p>\n<p>However, one of the problems in adding collectible value to digital content is the ease with which it can be copied, losing its exclusivity.  This new trend offers as a solution to this problem the use of <strong>blockchain technology<\/strong>, which we already know from cryptocurrencies, such as Bitcoin or Ethereum.  With this,<strong> the possibility of copying or generating fraud on an NFT are incredibly reduced,<\/strong> because the information about the property of each of them is stored worldwide in thousands of computers.<\/p>\n<h2>A new way to collect<\/h2>\n<p>We were talking about sports cards as a focus for collectors, and in this order there is already a solid market for its digital part.  For example, <strong>Sorare<\/strong> is a website where you play in fantastic leagues, a game in which teams are created from real players and points are generated according to the performance of said players in their respective teams.  What in Spain we know as Comunio or, for the older ones 😉 Liga Fantástica Marca.<\/p>\n<p>Players on this website are represented by <strong>cards,<\/strong> which have different degrees of exclusivity, or scarcity as shown on the page.  These grades range from the basic white ones with no unit limit, to the <strong>unique cards, of which there is only one per player of a gold and black color.<\/strong> The letters of value are auctioned within the web, which was developed on the Ethereum blockchain, a cryptocurrency, and reach exorbitant prices.  A particular case has been the unique card of <strong>Cristiano Ronaldo,<\/strong> which was sold on March 14 for just over 240,000 euros.<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">WOW! 🚀 Congratulations to FC Camembert who has just smashed our <a href=\"https:\/\/twitter.com\/hashtag\/Sorare?src=hash&amp;ref_src=twsrc%5Etfw\">#Sorare<\/a> Market record.<\/p>\n<p>The Unique 2020-21 Cristiano Ronaldo card was bought for $289920 on the Transfer Market. <a href=\"https:\/\/twitter.com\/hashtag\/OwnYourGame?src=hash&amp;ref_src=twsrc%5Etfw\">#OwnYourGame<\/a> ⚽️<\/p>\n<p>Season: 2020-2021<br \/>Serial: 1\/1<br \/>Price: $289920 <a href=\"https:\/\/t.co\/unLS9aXaN1\">pic.twitter.com\/unLS9aXaN1<\/a><\/p>\n<p>&mdash; Sorare (@Sorare) <a href=\"https:\/\/twitter.com\/Sorare\/status\/1371076627900338178?ref_src=twsrc%5Etfw\">March 14, 2021<\/a><\/p><\/blockquote>\n<p><script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n<p>For its part, this new trend also has the support of big names in the technological world, such as <strong>Elon Musk.<\/strong> The CEO of Tesla has always shown his enthusiasm about the world of cryptocurrencies, promoting them on his social networks.  Even his company recently made an investment of 1.5 million dollars in the purchase of Bitcoins, categorizing it as an investment in the future.<\/p>\n<p>But now it has gone a step further in this area,<strong> announcing the creation of a song about NFTs, which he said he would sell himself as an NFT<\/strong>.  This was posted on his personal Twitter account on March 15.  However, the next day he hinted that he would no longer sell it by saying “Actually.  It doesn&#8217;t feel good to sell this.&#8221;<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">I&#8217;m selling this song about NFTs as an NFT pic.twitter.com\/B4EZLlesPx<\/p>\n<p>— Elon Musk (@elonmusk) March 15, 2021<\/p>\n<\/blockquote>\n<h4>The other side of the coin of this technology<\/h4>\n<p>On the other hand, although there are those who support these new initiatives <strong>there are also many factors that are put against him<\/strong>, and show this market and that of cryptocurrencies as both an economic and environmental danger.  From the beginning, the use of cryptocurrencies was intended to create a more secure format for transactions on the web and, perhaps, in the future an alternative to conventional currencies.  Nevertheless, <strong>A halo of doubt that has always haunted cryptocurrencies is their valuation.<\/strong><\/p>\n<p>Something that equally affects NFTs, since lacking the physical asset<strong> it is somewhat difficult to justify the value that has been paid for this.<\/strong> Since, as such, you do not own the image, tweet, or song to which the NFT is linked, but rather a certificate of ownership of it.  Something that really does not allow you to enjoy the exclusive content of the purchased content.<\/p>\n<p>As with cryptocurrencies, these collectibles are in a bubble and have a strong tendency to speculation.  Therefore,<strong> the value of the pieces could be subject to market variations,<\/strong> that can become extreme, as was the case with the decline in cryptocurrencies in 2018. There is also concern about the <strong>Copyright<\/strong> and its management with NFTs.  This starting from the point<strong> any user could make a copy of a digital piece and generate an NFT on it, without being its author.<\/strong><\/p>\n<h4>An unfriendly option<\/h4>\n<p>From another point of view, the cost of these collectibles goes beyond the economic sphere, and <strong>affects the environment<\/strong>.  Being built on the same blockchain technology as cryptocurrencies, NFTs stand for <strong>an incredible energy cost,<\/strong> based on the energy needed to keep the technology that guarantees its exclusivity running, large centers full of processors working non-stop.<\/p>\n<p>The most worrying thing according to the studies is that most of the sources used for the maintenance of this system are based on fossil fuel.  This implies a massive production of toxic gases that affect the environment, as well as a constant demand for fuel production.  In an era marked by environmental concern, this appears to be a step backwards and could mean future problems for the sustainability of these technologies.<\/p>\n<p>Image: <strong>Depositphotos<\/strong><\/p>\n<p class=\"cursiva\">Stay informed of the most relevant news on our Telegram channel <i class=\"ico-telegram\"\/><\/p>\n<p>\t\t\t\t\t\t\t\t\t\t\t\t\t<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The idea of ​​collecting objects has always been present among us. We could even say that it is one of the most common hobbies in the world. They can be coins, sports cards, or albums like those of the Panini World Cups. Also, with a somewhat more refined approach are the art collections, which are [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/327"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=327"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/327\/revisions"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=327"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=327"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=327"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}