{"id":342,"date":"2022-05-10T01:35:56","date_gmt":"2022-05-10T01:35:56","guid":{"rendered":"https:\/\/infobloom.site\/what-are-some-of-the-most-common-types-of-scams\/"},"modified":"2022-05-10T01:35:56","modified_gmt":"2022-05-10T01:35:56","slug":"what-are-some-of-the-most-common-types-of-scams","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-some-of-the-most-common-types-of-scams\/","title":{"rendered":"What are some of the most common types of scams?"},"content":{"rendered":"<p><b>Debt Collection Scams<\/b><\/p>\n<p>Most debt collectors contact you to collect legitimate debts.  But there are scammers who pose as debt collectors to collect debts you don&#8217;t owe or that have already been paid.  Do not give out any personal financial information until you can verify the debt.  You can use this sample letter to request more information.  Read more about the warning signs.<\/p>\n<p><b>Debt Negotiation and Relief Scams<\/b><\/p>\n<p>Debt settlement companies say they can renegotiate, resolve, or otherwise change the terms of a debt a person may owe to a creditor or debt collector.  The Federal Trade Commission (FTC) provides information on when a debt settlement offer may be a scam .<\/p>\n<p><b>Foreclosure Scams <\/b><\/p>\n<p>Foreclosure relief or home loan modification scams are scams to take your money or home, often making false promises to avoid foreclosure.<\/p>\n<p>If you&#8217;re having trouble paying your mortgage, a HUD-approved housing counselor can help you evaluate your options and avoid scams.  If you think you may have been the victim of a foreclosure relief scam, you may want to consult an attorney.  Read more about foreclosure scams.<\/p>\n<p><b>grandparents scam<\/b><\/p>\n<p>If you get a call from someone who sounds like a grandchild or family member asking you to send money, make an electronic bank transfer, or send gift cards to help them out of trouble, it could be a scam.  Read more about other ways to protect seniors from financial fraud and scams.<\/p>\n<p><b>Imposter Scams<\/b><\/p>\n<p>Imposters try to convince you to send money by posing as someone you know or trust, such as a sheriff, a local, state, or federal government employee, or a charity.  Remember that caller ID can be fake.  In any case, you can call the organization or government agency and ask if the person you called works for them before sending money.  Read more about imposter scams.<\/p>\n<p><b>mail fraud<\/b><\/p>\n<p>The letters used in mail fraud look real, but the promises are false.  A common red flag is receiving a letter asking you to send money or personal information now, in exchange for something of value in the future.  Read More.<\/p>\n<p><b>Mortgage Closing Scams<\/b><\/p>\n<p>Mortgage closing scams target buyers who are close to their mortgage loan closing date.  The scammer attempts to steal the homebuyer&#8217;s closing funds, such as their down payment and closing costs, through an email sent to the homebuyer, posing as their real estate agent, the official in charge of the closing operation by the title company, escrow officer, or attorney.  Read more (in English).<\/p>\n<p><b>Lottery or prize scams<\/b> <\/p>\n<p>Scammers call or email you congratulating you on being a prize winner and asking for an up-front payment to cover certain fees and taxes.  Also, a scammer may ask you to pay some money in advance to receive the winnings of the supposedly won prize.  Read more (in English).<\/p>\n<p><b>Money transfer fraud<\/b><\/p>\n<p>Scammers use wire transfers to steal your money.  An example of a wire transfer scam is the &#8220;grandparent scam.&#8221; <\/p>\n<p>Once money has been withdrawn from a transfer, there is very little that can be done to get it back.  Being asked to wire money by someone you don&#8217;t know is a red flag of a scam.  Read More.<\/p>\n<p>To report a scam, you can file a complaint with the Federal Trade Commission.  Other options for reporting the scam include contacting your local police, sheriff&#8217;s office, or state attorney general.  Visit the National Association of Attorneys General for contact information for the attorney general in your state.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Debt Collection Scams Most debt collectors contact you to collect legitimate debts. But there are scammers who pose as debt collectors to collect debts you don&#8217;t owe or that have already been paid. Do not give out any personal financial information until you can verify the debt. You can use this sample letter to request [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":343,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/342"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=342"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/342\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/343"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=342"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=342"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=342"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}