{"id":344,"date":"2022-05-10T06:09:36","date_gmt":"2022-05-10T06:09:36","guid":{"rendered":"https:\/\/infobloom.site\/blockverse-was-a-scam-a-million-dollars-disappears\/"},"modified":"2022-05-10T06:09:36","modified_gmt":"2022-05-10T06:09:36","slug":"blockverse-was-a-scam-a-million-dollars-disappears","status":"publish","type":"post","link":"https:\/\/infobloom.site\/blockverse-was-a-scam-a-million-dollars-disappears\/","title":{"rendered":"Blockverse was a scam: a million dollars disappears"},"content":{"rendered":"<p style=\"color:#888888;font-size:12px\" class=\"post-modified-info\">✍️ Updated on January 31, 2022 – 17:35 👤 Reviewed by Jakub Motyka<\/p>\n<ul>\n<li><strong>At its launch, Blockverse managed to place 10,000 NFTs valued at $124 each.<\/strong><\/li>\n<li><strong>These NFTs were supposed to be required to access the Blockverse Minecraft server, which promised unique experiences on the Ethereum (ETH) blockchain.<\/strong><\/li>\n<li><strong>The creators of the Blockverse have been on the run with over a million dollars in a new rug pull in the world of NFT games.<\/strong><\/li>\n<\/ul>\n<p>New week, new scam starring an NFT game in the crypto world: <strong>Blockverse<\/strong> I wanted to be the project of <strong>NFT<\/strong> built on <strong>Minecraft<\/strong> to enable unique network functionalities <strong>Ethereum (ETH)<\/strong>but finally <strong>it turned out to be a scam<\/strong>.  Its creators have made <strong>a rug pull<\/strong> (pull the blanket, keep the investors&#8217; money) <strong>valued at $1.2 million<\/strong>as collected in Hypebeast.<\/p>\n<p><strong>Blockverse<\/strong> it was an NFT game <strong>totally unofficial regarding minecraft<\/strong>but used the famous platform in question to introduce a game mode <strong>P2E (Play To Earn)<\/strong> which would allow players to battle with their NFT creatures and items within the title.<\/p>\n<p>the launch of <strong>Blockverse<\/strong> it was all a success: <strong>in just 8 minutes<\/strong>the creators managed to sell all the <strong>10,000 NFTs<\/strong> configured for departure, priced at <strong>$124<\/strong> (0.05ETH) <strong>each<\/strong>.  Therefore, in these eight minutes they made a total of <strong>$1,240,000<\/strong> that, in view of events, right now they are far from their initial purpose.<\/p>\n<h2>Blockverse wanted to be the door to P2E in Minecraft<\/h2>\n<p><\/p>\n<p>The NFT project of <strong>Blockverse<\/strong> was presented as <strong>an alternative to allow P2E play in minecraft<\/strong>, thus adding a blockchain-based add-on to a world-renowned game.  The idea was that users could compete with their <strong>NFT&#8217;s<\/strong> between them through <strong>10,000 unique skin designs<\/strong>with an exchange currency that would respond to the token of <strong>$DIAMONDS<\/strong>.<\/p>\n<p>To get it off the ground, the creators of the project decided to launch an initial sale of the <strong>10,000 NFTs<\/strong> corresponding to the unique skins provided for the game.  The operation was a complete success, placing the total collection for more than 1.2 million dollars, with the only drawback that <strong>a few days later the project stopped working and its main platforms disappeared without leaving any signs of life<\/strong>.<\/p>\n<h2>Blockverse Twitter account defends itself against scam accusations<\/h2>\n<p>It is curious to verify that, in the official Twitter account of <strong>Blockverse<\/strong> (@Blockverse_NFT), an official position has been published detailing what, according to the version of its creators, have been the reasons for the fall from grace of the project in so few days.<\/p>\n<p>The statement ensures that <strong>Blockverse has fallen victim to its own FUD<\/strong> (<strong>Fear, Uncertainty, and Doubt<\/strong>;  in Spanish, Fear, Uncertainty and Doubt), alleging that the blame for the disaster was due to the <strong>unexpectedly high gas fees<\/strong>the <strong>minecraft server problems managing data volume<\/strong> and the <strong>lack of control over $DIAMONDS<\/strong>which was going to be the currency of exchange within the project.<\/p>\n<p>In view of this situation, the statement continues, &#8220;the team panicked […] Y <strong>deleted Discord server<\/strong>«, referring to the disappearance of the official channel of <strong>Blockverse<\/strong> in this service, which has only fueled suspicions about a scam in the project.<\/p>\n<p>Even more curious is the fact that the statement speaks of <strong>a second version of Blockverse that would already be underway<\/strong>, assuring that the reopening of the project is planned “in the next few days”.  &#8220;We will announce more news on Twitter in favor of continuing transparency,&#8221; the message states.<\/p>\n<p><strong>It may interest you:<\/strong><\/p>\n<p> <img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/Blockverse-was-a-scam-a-million-dollars-disappears.jpeg\" class=\"photo\" width=\"250\" alt=\"Jakub Motyka\"\/> Sooner or later it had to happen: the fever that has entered me with the world of cryptocurrencies has been such that it was only a matter of time before I started my own project of a website related to crypto, decentralized economy and projects built on it.  Especially when it comes to how I think the world is going to change with the blockchain and everything that is being generated around it.  This is how Criptokio.com was born.<\/p>\n<p>This is just the beginning.<\/p>\n<p> <img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/Blockverse-was-a-scam-a-million-dollars-disappears.jpeg\" class=\"photo\" width=\"250\" alt=\"Jakub Motyka\"\/>Latest Posts by Jakub Motyka (view all) Disclaimer: The content and links provided in this article are for informational purposes only.  Criptokio.com does not offer legal, financial or investment recommendations or advice, nor does it replace the due responsibility of each interested party.  Criptokio does not endorse any investment offer or the like promoted here.  click here for more information.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>✍️ Updated on January 31, 2022 – 17:35 👤 Reviewed by Jakub Motyka At its launch, Blockverse managed to place 10,000 NFTs valued at $124 each. These NFTs were supposed to be required to access the Blockverse Minecraft server, which promised unique experiences on the Ethereum (ETH) blockchain. The creators of the Blockverse have been [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":347,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/344"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=344"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/344\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/347"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=344"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=344"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=344"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}