{"id":350,"date":"2022-05-10T10:56:10","date_gmt":"2022-05-10T10:56:10","guid":{"rendered":"https:\/\/infobloom.site\/the-new-rise-of-crypto-scams-copies-the-old-pyramid-scheme-economy\/"},"modified":"2022-05-10T10:56:10","modified_gmt":"2022-05-10T10:56:10","slug":"the-new-rise-of-crypto-scams-copies-the-old-pyramid-scheme-economy","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-new-rise-of-crypto-scams-copies-the-old-pyramid-scheme-economy\/","title":{"rendered":"The new rise of crypto scams copies the old pyramid scheme |  Economy"},"content":{"rendered":"<p>An illustration of litecoin, ripple, and ethereum cryptocurrencies. Jack Taylor (Getty Images)<\/p>\n<p class=\"\">The nightmare began with two simple messages.  &#8220;The <i>communitybot,<\/i> [programa informático que efectúa tareas automáticas], is currently closed.  All accounts are frozen without the possibility of making reinvestments”, warned one of the texts that the company Arbistar 2.0 sent to its users in September of last year, which emerged in 2019 in Arona, a municipality of 80,000 inhabitants on the island of Tenerife.  “In the event that there are clients who file lawsuits regarding this fact, we will paralyze their payments until the judicial resolution is determined,” also threatened the company, which until then claimed to have created a manna: a bot that operated in the cryptocurrency market and that it managed, based on &#8220;buying them cheap&#8221; and &#8220;selling them more expensive&#8221;, multiplying at a frantic pace the money of those who invested through it.  The formula seemed simple.  But, according to the investigators, the pyramid scheme was served.<\/p>\n<p>More information<\/p>\n<p class=\"\">Little more than a month after those messages, the CEO of Arbistar was arrested: Santiago Fuentes, a character who had broken into the sector thanks to a YouTube video and an old acquaintance of the police, involved in the pyramid scam concocted by Germán Cardona, known as the Spanish Madoff, and from which he was acquitted in 2017. Now his case, which has been investigated by the justice system for months, has advanced a phenomenon that has not taken long to explode: the rise of cryptocurrencies has given way to the rise of of crypto scams.  The National Court has already assumed three different investigations (the <i>Arbistar cases<\/i>, <i>algorithms<\/i> Y <i>Kuailian<\/i>), about an alleged total fraud that exceeds 350 million euros and leaves tens of thousands of possible affected.  But, in addition, this same judicial body is currently studying whether to assume a fourth instruction (the <i>Nimbus case<\/i>), for some events whose economic damage has been estimated by the Civil Guard at 112.5 million euros.  Nimbus Platform assures that she is not involved in any fraud and that the accusations originate from the complaint of a single lawyer without any precautionary measure being taken against her. [Actualización: después de que el juzgado de Huelva plantease inhibirse en favor de la Audiencia Nacional, esta solicitó a ese juzgado más información sin que se haya dictado resolución sobre la inhibición].<\/p>\n<p><img alt=\"Screenshot of the Arbistar 2.0 website. \" decoding=\"auto\" class=\"_re lazyload a_m-h\" height=\"210\"  width=\"414\" loading=\"lazy\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652180170_789_The-new-rise-of-crypto-scams-copies-the-old-pyramid.jpg\"\/>Screenshot of the Arbistar 2.0 website. <\/p>\n<p class=\"\">Although each case has its particularities, the judges and agents describe in their first reports shell companies with branches abroad, figureheads, companies in tax havens, alleged money laundering operations and victims in different countries.  All this, varnished with huge advertising campaigns and promises of exorbitant returns, of up to 15% or 25%, which made savers long teeth.  “Each scam has its own personal touch”, starts the lawyer Carlos Aránguez, who defends groups of affected people, but “also points in common”.  The lawyer describes the defendants as &#8220;professional fraudsters&#8221; with a &#8220;huge capacity for conviction&#8221;, whose strength &#8220;is not new technologies&#8221;, but marketing.  &#8220;Arbistar spent about 23,000 euros a month on events, hotels and restaurants, but less than 2,000 on computer engineering,&#8221; exemplifies this former prosecutor.<\/p>\n<p class=\"\">To Javier Biosca, head behind Algorithms and in provisional prison since his arrest in June after issuing a search and arrest warrant<i>,<\/i> they also describe him as a born public relations man.  According to the complainants, who estimate his fraud at more than 250 million euros and 4,000 injured, he came to his alleged victims recommended by clients, friends and family.  They say that he moved like a fish in water at parties and meals;  he even attended the proposal of one of his investors.  Of course, he left Toledo and moved to the ostentatious Marbella, where money flows in society, explains the lawyer Emilia Zaballos, who also presents herself as president of the Association of People Affected by Investments in Cryptocurrencies: &#8220;He organized the &#8216;festival of bitcoin &#8216; at his Marbella mansion in late summer [de 2020].  She invited her intermediaries and possible people who handle large amounts of money.  A party full of glamor that ends up convincing the skeptics”.<\/p>\n<p>He knows in depth all the sides of the coin.<\/p>\n<p>subscribe<\/p>\n<p class=\"\">This type of &#8220;enlightened&#8221;, as Zaballos defines them, would not have sprouted without the ideal breeding ground.  Luis Garvía, professor and director of the Master&#8217;s in Financial Risks at ICADE Business School, explains: “We are experiencing a change of era: we are going from an industrial society to a digital one.  And this problem of scams is one more face of that, ”he stresses.  This analyst describes a traditional financial system that, in the midst of transformation, offers very low returns to savers who are looking for alternatives.  And there the cryptocurrency markets appear, and a reinvention of the traditional pyramid scam, concocted by those who attract customers by ensuring that they buy cryptocurrencies with that money and that, thanks to their good work, they generate an enormous profit, although what really happens is, as in other similar cases, that only the entry of new investors serves to pay interest to the old ones;  something unsustainable.<\/p>\n<p class=\"\">Judge Joaquín Elías Gadea, instructor of the National High Court, includes Kuailian in that group, with a number of affected and prejudice that is still &#8220;not determined&#8221;: &#8220;The clients, according to the agreed conditions, could get more affiliates for the platform through their account, and they received 10% of the investment of those recruited in their first level, 3% of those in the second level, 2% in the third level and so on, up to a total of 20% invested for each one;  which generated an exponential network of massive capture [&#8230;] The attraction of new investors would feed the base of the pyramid, allowing the return and payment of profits to the initial investors, without the operation responding to a real business”.<\/p>\n<p class=\"\">Cases like those of Arbistar and Algorithms supposedly also fit the typology of pyramid schemes.  Regarding the first case, Judge José Luis Calama also says: “What this plot allegedly did was use part of the money obtained from the investors to deliver it to other previous investors in payment of the high interest rates agreed upon, which generated great confidence. in them that their investment was safe and very profitable, in such a way that they encouraged themselves to invest a greater amount of money in the hope of obtaining an even greater profit.<\/p>\n<h3 class=\"\">Pandemic and savings<\/h3>\n<p class=\"\">The emergence of the coronavirus in 2020 did not help either.  Luis Garvía emphasizes that millions of people were locked in their homes, fearful of an uncertain future and glued to the screens of their digital devices.  According to INE data, the savings rate of Spanish households shot up 14.8% last year.  Many thought that this money had to be invested and they saw their opportunity in the cryptocurrency market – also, with one of them, bitcoin, rampant at that time.  Carlos Aránguez emphasizes this idea: “People felt financial anguish and wanted to put money to work.  There were those who invested compensation for a job dismissal.  He saw a disruptive technology and thought higher interest payments were coming back.  In addition, one always wants to believe that theirs is not a scam.<\/p>\n<p class=\"\">But the alerts were there.  Since 2018, the National Securities Market Commission (CNMV) and the Bank of Spain have warned on several occasions &#8220;about the risks&#8221; that cryptocurrencies pose, &#8220;particularly&#8221; for small investors.  In a note from last April, the CNMV went even one step further by targeting the advertising that circulated about these products, specifically aimed at retail customers, after detecting how their &#8220;intensity&#8221; grew and the means used in these advertising campaigns. promotion.  And he warned of the possibility that &#8220;they did not incorporate objective information.&#8221;<\/p>\n<p class=\"\">This same July, the <i>State official newsletter <\/i>has published the new law against tax fraud that forces companies and <i>brokers<\/i> (commission agents) to “report balances” and “holders” of the cryptocurrencies they hold, as well as the “operations (acquisition, transmission, exchange, transfer, collections and payments) in which they are involved”.  All those who have &#8220;virtual currencies abroad&#8221; must also declare it to the Treasury.<\/p>\n<p class=\"\">Is more regulation needed?  “The legislation is already there, it has to be adapted”, responds Garvía: “But, above all, the investor must be educated.  Because there are enormous paradoxes.  For example, the possibility of access to information today is greater than ever, but the inequality between those who have access and those who do not have also skyrocketed, ”he reflects.  Professor Garvía also explains how the latter may also want to benefit from this market and, &#8220;desperately&#8221;, put themselves in the hands of scammers and see how their money disappears without being able to do anything.<\/p>\n<p class=\"\">Santiago Fuentes, to whom the judge attributes an alleged scam that can reach 100 million euros and 32,000 affected, summed it up in one of the videos he posted on the web: &#8220;If one day Arbistar went to hell, you would stay with silly face.&#8221;  He was right.<\/p>\n<h3 class=\"a_de_t\">What are cryptocurrencies<\/h3>\n<p>A cryptocurrency is a digital asset that uses cryptographic encryption to guarantee its ownership and ensure the integrity of transactions, and control the creation of additional units, that is, prevent someone from making copies as would be done, for example, with a photo. .  These coins do not exist in physical form: they are stored in a digital wallet.<\/p>\n<\/p>\n<p>In recent months, many cryptocurrencies, including Bitcoin and Ether, have experienced high price volatility, which has been accompanied by a significant increase in advertising, sometimes aggressive, to attract investors.  There is still no framework in the European Union that regulates cryptoactives such as Bitcoin, and that provides guarantees and protection similar to those applicable to financial products.  Currently, a Regulation (known as MiCA) is being negotiated at the European level that aims to establish a regulatory framework for the issuance of crypto assets and the service providers on them.  As the CNMV and the Bank of Spain recall in a recent statement, cryptocurrencies are not considered a means of payment, they do not have the backing of a central bank or other public authorities and they are not covered by customer protection mechanisms such as the Deposit Guarantee Fund or Investor Guarantee Fund.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>An illustration of litecoin, ripple, and ethereum cryptocurrencies. Jack Taylor (Getty Images) The nightmare began with two simple messages. &#8220;The communitybot, [programa informático que efectúa tareas automáticas], is currently closed. All accounts are frozen without the possibility of making reinvestments”, warned one of the texts that the company Arbistar 2.0 sent to its users in [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":353,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/350"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=350"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/350\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/353"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=350"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=350"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=350"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}