{"id":380,"date":"2022-05-10T12:42:53","date_gmt":"2022-05-10T12:42:53","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-find-out-why-a-profile-picture-can-be-worth-1-million-2\/"},"modified":"2022-05-10T12:42:53","modified_gmt":"2022-05-10T12:42:53","slug":"what-are-nfts-find-out-why-a-profile-picture-can-be-worth-1-million-2","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-find-out-why-a-profile-picture-can-be-worth-1-million-2\/","title":{"rendered":"What are NFTs?  Find out why a profile picture can be worth $1 million"},"content":{"rendered":"<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Brazilian soccer player <b>Neymar Jr<\/b>.  uses a WhatsApp wallpaper that cost him more than $500,000.  The image, an NFT, is a drawing of a pink monkey chewing gum, with a party hat, light blue glasses and an orange background.  He also uses the ape as a profile picture on his networks.<\/p><source  media=\"screen and (min-width: 992px)\"\/><source  media=\"screen and (min-width: 768px)\"\/><source  media=\"screen and (min-width: 0px)\"\/><\/p>\n<p class=\"ImageMetadata__MetadataParagraph-sc-1gn0vty-0 kwihKM image-metadata\">Instagram profile of the player Neymar Jr. The profile image used by the player is an NFT that cost him more than $500,000 in January 2022. <\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Why the heck did that digital image cost so much – you may ask – if anyone can simply search for it on the web, download it in a good size, and manually put it as a WhatsApp background or as a profile picture?  The answer to that question explains what an NFT is: because Neymar&#8217;s image <b>is unique<\/b>.  It is a unique digital work.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Although it can be copied on the Internet, the information in the digital file is authenticated, it can be said, and only that image is that of the <b>bored monkey number 6633<\/b> from the Bored Ape Yacht Club NFT collection.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">That&#8217;s what an NFT is: a digital asset that has a unique publicly traceable record value.  Although there are a thousand copies, only Neymar Jr. owns THE image of the original ape # 6633, which he acquired on January 20.  For that ape and another one that he bought, the soccer player paid the equivalent of $1.1 million.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Is all this very new to you?  No problem.  NFTs are very, very new anyway.  Its &#8220;boom&#8221; is happening now, with an emphasis on the second half of 2021, but with a lot of impact in 2022 (although with a lot of criticism too).<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">the british dictionary <i>collins<\/i> chose the word “NFT” as the word of the year 2021. So again it is all.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">NFT literally stands for “non-fungible token”, which can be translated to “unique non-fungible object”.  Unique digital works.  The Urgent Spanish Foundation (Fundéu) proposes to translate it as “<b>unique digital voucher<\/b>”.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Well, as you may or may not know, thousands of people are involved in what we can call &#8220;the world of NFTs&#8221;, making million-dollar transactions to acquire these unique digital goods around the world, via the Internet;  playing video games that only the owners of some NFTs can access, meeting in digital activities as part of ultra-exclusive clubs of NFT owners, and so on.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Below, we offer you a quick guide to understand what NFTs are, and so that, if you have any questions from your friends or family, simply send them this link.<\/p><source  media=\"screen and (min-width: 992px)\"\/><source  media=\"screen and (min-width: 768px)\"\/><source  media=\"screen and (min-width: 0px)\"\/><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652186573_746_What-are-NFTs-Find-out-why-a-profile-picture-can.png\" width=\"1440\" height=\"0\" loading=\"lazy\"\/><\/p>\n<p class=\"ImageMetadata__MetadataParagraph-sc-1gn0vty-0 kwihKM image-metadata\">The boring ape NFT number 6633, owned by Neymar in 2022 (i), and a representation of the Ethereum cryptocurrency (d), the second largest in the world after Bitcoin, and the protagonist in NFT transactions in the world. <\/p>\n<h5 class=\"heading__StyledHeading-sc-5jxglz-0 iAMSBm\"><b>The basics: what is an NFT and how were they born?<\/b><\/h5>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">It is a digital piece (an image, an audio, a gif, etc), <b>that can be certified as unique<\/b>.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">No matter how many copies can be made of the piece, only one is the original.  This can be verified through the same technology used to register cryptocurrencies.  This technology is called “blockchain”.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">“Blockchain” is a digital structure organized in “blocks” or sets of data linked with cryptography, which are progressively added one after another, creating a chain.  In cryptocurrencies, these blocks record the valid transactions made with them.  In NFTs, these blocks make it possible to record that a digital voucher or non-fungible token is the authentic one and it is possible to check when it was created, how many owners it has had, how much money was paid for it, and who currently owns it (by minus the name of the digital wallet that owns it).  This is because NFTs are bought with cryptocurrencies.  The NFT is associated with the digital wallet that purchased it.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">For example, the boring ape number 6633, which Neymar bought, is linked to the largest store of NFTs in the world, <b>Open Sea<\/b>to the wallet <b>Jan Jay Vault<\/b>Neymar&#8217;s wallet.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">The &#8220;blockchain&#8221; technology works like an accounting book in which the operations are registered and which has independent programmers around the world as verifiers.  Millions of verifiers.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">It is an independent system, not centralized (unlike banks), and it is a secure system to verify transactions and, in this case, to verify the authenticity of an NFT.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">An NFT is basically a way of proclaiming the authenticity of a digital asset or object.  The object exists and can be copied to infinity, but the original object is only one.  And the owner has the certificate.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">This is similar to having an art painting of, say, Picasso.  The Picasso painting is accompanied by a certificate of authenticity that shows that it is not a copy.  I can have a high quality poster of <i>The Avignon ladies<\/i>but the original painting is in the MoMA, in New York.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Well, an NFT is something like a digital certificate for a digital asset.  Little by little, these certificates are provided with added values, beyond just the good itself.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">It is increasingly common for owners of authentic NFTs to participate in ultra-exclusive activities, open only to those who have purchased these images.  This works by collections.  For example, Neymar, <b>snoop-dog<\/b>, <b>Eminem<\/b> either <b>Jimmy Fallon<\/b>, all owners of NFTs from the collection of bored apes, can participate in exclusive virtual activities of this club.  For their part, owners of original images from the collection of CryptoPunks, Azuki, Doodles, World of Women, Zombie Club Token or Cool Cats, to name a few, could also have exclusive activities.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\"><i>This is what an NFT looks like in the store <\/i><i><b>Open Sea<\/b><\/i><i>.  Ending March 2022, this ape is the most valuable of the Bored Ape Yacht Club:<\/i><\/p>\n<h5 class=\"heading__StyledHeading-sc-5jxglz-0 iAMSBm\"><b>Why are NFTs so expensive and who buys them?<\/b><\/h5>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">It is a matter of supply and demand.  As simple as that.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">What&#8217;s new or weird is that unique digital files like NFTs didn&#8217;t exist on the Internet until very recently.  Or we had not realized its existence and possible value.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Kevin Roose, technology columnist at the <i>New York Times<\/i>explains that the Internet works essentially <b>like a gigantic copy machine<\/b>.  Any digital file can be infinitely duplicated any number of times.  And each copy remains as the original version.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">“The Internet&#8217;s endless copying quality was great at making digital objects abundant,” notes Roose, “But it was horrible at making them scarce.  If I were an artist who wanted to make just 100 first editions of my digital artwork, or a professional athlete who wanted to sell digital trading cards to my fans (and have those trading cards retain value the same way physical trading cards would) , my options were not good”.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">NFTs came to change that.  Or at least they could, because the truth is that they are still a very niche world.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Many people realized that blockchains could be used to create unique, uncopyable digital files, adds Roose.  And because these files were simply entries in a public database, anyone could verify who owned them or track them as they changed hands.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">&#8220;They are a way of having traceability, transparency and transfer of value, since everything remains in the &#8216;blockchain&#8217;, a digital book that is tamper-proof and maintains a permanent record&#8221;, <b>comments the Mexican programmer and crypto-artist Luis Ramírez, to <\/b><i><b>Forbes<\/b><\/i>.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">The NFT movement was born on the Ethereum blockchain, the second largest cryptocurrency in the world after Bitcoin.  The most important market for digital art or NFTs is currently being developed on the Ethereum “blockchain”.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Online marketplaces like OpenSea or <b>rare<\/b> they are growing platforms where one can buy NFTs, but they can also be created.  The digital files that can be transformed into NFTs are: <b>mp3, mp4, png, jpg and gif.<\/b><\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Some platforms charge an initial fee, and then the creation of each NFT is free.  For example, the largest network, OpenSea, which is paid for in Ether, has an initial entry fee that ranges from the equivalent of $20 to $130.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Then, the profits or losses that we can make in the NFT world will respond exclusively to supply and demand.  And to speculation, of course.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">It is by no means certain that the image of the boring ape number 6633 that Neymar bought for $517,000 will increase in price in three years or three months.  There is no certainty.  In fact, Gary Vaynerchuk, an entrepreneurial Belarusian-American tycoon enthusiastic about NFTs, recently predicted that about <b>98% of current NFTs will lose their value<\/b>.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">There are who <b>have earned millions of dollars<\/b> in a short time with NFTs, but there are also those who <b>they have lost a lot of money<\/b>.<\/p>\n<h5 class=\"heading__StyledHeading-sc-5jxglz-0 iAMSBm\"><b>The dark side of NFTs<\/b><\/h5>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Here we will not go into the debate of whether a gif or a jpg file is art or not.  After all, if there is demand and there is supply, two worlds come together.  Furthermore, it is a matter of significant value.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">The French sociologist, philosopher, and cultural theorist Jean Baudrillard explained that an object has a combination of four values: exchange value, functional value, symbolic value, and significant value.  What is more valuable to someone?  The expensive, the useful, the significant\/important, or the famous\/celebrated?<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">“Depends,” digital creator Pak Murat – who sold the most expensive NFT of all time – wrote on Twitter. <b>for more than $91 million<\/b>, Last December-.  “If you want to sell, what is expensive is more valuable.  If you want to use it, the useful is more valuable.  If you want to save it, what is significant\/important is more valuable.  If you want to teach it, what is famous\/famous is more valuable”.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Every object has a combination of those four values;  NFTs included.  For this reason, we will not enter into the debate about whether it is art or not, why a gif can cost more than an apartment or why a <b>original meme<\/b> it can cost the same as a Picasso.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Now, in the NFT world, just like in the world of traditional art or just in the physical world, there are also scams and there is a place for money laundering.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">It is not uncommon for an NFT project developer to run away with buyers&#8217; money.  Last October, an NFT project called Evolved Apes suddenly disappeared. <b>taking approximately $2.7 million<\/b>.  It was all a scam and a promise of a project with a video game included that never appeared.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Added to this danger, the anonymity of transactions with cryptocurrencies in the &#8220;blockchain&#8221; -we know the name of the digital wallet, but not the people behind it- allows &#8220;dirty&#8221; money, coming from illicit activities such as drug trafficking or others, whether it is invested (laundered) in NFTs or in the same cryptocurrencies.  This is something very pointed out in the world of &#8220;crypto&#8221;, and therefore it is in the NFT world.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Likewise, there is also environmental damage linked to NFTs (and cryptocurrencies).  The Ethereum blockchain requires excessive energy expenditures for the creation of NFTs.  Many times crypto mining centers are buildings full of computers working non-stop, or lineups of computers located in countries or regions where electricity is cheaper.  Renewable energy sources are not usually used for these activities.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 cptQFj body-paragraph\">Finally, we can also mention some details that are at least rare or suspicious in the world of NFTs.  Creative director, concept artist and programmer Ryder Ripps, ex-partner of rapper Azealia Banks, posted a thread on Twitter <b>detailing pro-Nazi or neo-Nazi aspects in the most popular NFT collection of all<\/b>, that of the Yacht Club of Bored Apes.  You can check it out below.  It is possible that they are pure speculations without much sense or mere coincidences, <b>as noted by experts for the magazine <\/b><i><b>Input<\/b><\/i>but it is also possible that those behind this collection are sympathizers of the radical far right and are secret admirers of Adolf Hitler, whose death anniversary, April 30, was the date of birth of these little monkeys.<\/p>\n<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">oh one more thing about these logos, they have the exact same amount of teeth in the scull, i have yet to find another ape skull drawing with 18 teeth.  pic.twitter.com\/hbIsWnGvX3<\/p>\n<p>— RYDER RIPPS (@ryder_ripps) January 7, 2022<\/p><\/blockquote>\n<p>  <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Brazilian soccer player Neymar Jr. uses a WhatsApp wallpaper that cost him more than $500,000. The image, an NFT, is a drawing of a pink monkey chewing gum, with a party hat, light blue glasses and an orange background. He also uses the ape as a profile picture on his networks. Instagram profile of the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":382,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/380"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=380"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/380\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/382"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=380"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=380"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=380"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}