{"id":396,"date":"2022-05-10T15:42:02","date_gmt":"2022-05-10T15:42:02","guid":{"rendered":"https:\/\/infobloom.site\/warn-not-to-buy-nfts-after-an-attack-on-discord\/"},"modified":"2022-05-10T15:42:02","modified_gmt":"2022-05-10T15:42:02","slug":"warn-not-to-buy-nfts-after-an-attack-on-discord","status":"publish","type":"post","link":"https:\/\/infobloom.site\/warn-not-to-buy-nfts-after-an-attack-on-discord\/","title":{"rendered":"warn not to buy NFTs after an attack on Discord"},"content":{"rendered":"<p>The servers of <strong>Discord <\/strong>of several major NFT projects were <strong>hacked by cybercriminals <\/strong>this Friday through a scam of <strong>phishing <\/strong>in which several users were tricked into handing over their digital certificates.<\/p>\n<p>  Bored Ape Yacht Club, Nyoki, and Shamanz confirmed Discord hacks on Twitter.  According to screenshots shared by independent blockchain researcher Zachxbt, the projects “Discords of NFT” Doodles and Kaiju Kingz were also attacked.  Doodles and Kaiju Kingz confirmed on their servers that they were also hacked.<\/p>\n<p>  Discord is a communication platform used by many gamers to chat and <strong>communicate while playing<\/strong>but is also used by other services.<\/p>\n<p>  NFTs are certificates of authenticity for something that exists in the digital world, not material.  Its initials mean <strong>“non-fungible token”.<\/strong> A token is a digital asset that in this case is integrated into a blockchain (Ethereum and Solana) and that it is &#8220;non-fungible&#8221; implies that it is not interchangeable.  Fungibility means that something is interchangeable and indistinguishable: a thousand Argentine peso bill is interchangeable with any other thousand Argentine peso bill.<\/p>\n<p>  Tokens, like works of art, are non-fungible because there is no way to replace them: the first tweet in history is only one, just as there is only one original Michelangelo Pietà.<\/p>\n<p>  Basically any digital image can be purchased as NFT.  This is why, during the past year and the current one, the first tweet in history was sold, a famous meme -“Disaster Girl”-, works of art by Grimes, the original source code of the web created by Tim Berners- Lee and a news article from the NYT.  Even Javier Milei, a brand new legislator for the City of Buenos Aires, sold an NFT: a video where he set fire to the Central Bank.<\/p>\n<h2>How did they find out about the hack?<\/h2><source media=\"(min-width: 720px)\" ><\/source><\/p>\n<p>&#8220;Manager Noet All&#8221;, a jumpsuit from the collection.  Reuters Photo\n<\/p>\n<p>  “Oh no, our dogs are mutating,” read one of the phishing posts posted on the BAYC Discord by a compromised bot spotted by Motherboard.  “MAKC can be staked on our token $APE<strong>.  MAYC + BAYC holders will be able to claim rewards<\/strong> exclusives by simply minting and maintaining our mutant dogs.”<\/p>\n<p>  The goal of the scam was to trick users into clicking on a link to &#8220;mint&#8221; a fake NFT by sending ETH and, in some cases, an NFT to be wrapped in a token.<\/p>\n<p>  &#8220;Stay safe. Don&#8217;t buy anything from any Discord at this time. A webhook on our Discord was briefly compromised,&#8221; BAYC&#8217;s official Twitter account said early Friday.<\/p>\n<p>  &#8220;We caught it right away, but please note: We&#8217;re not &#8220;minting&#8221; or <strong>Throwing nothing for the April Fool&#8217;s, etc.<\/strong>.  Other Discords are also being attacked right now.&#8221;<\/p>\n<p>  The Twitter account of Nyoki, the other well-known brand of NFTs, posted a similar warning.  &#8220;Along with top-tier projects like BAYC and Doodles, our server was also compromised today due to a recent large-scale attack,&#8221; the tweet read.  &#8220;We had everything under control in less than 30 minutes.<\/p>\n<p>  Two wallet addresses were linked to the hacks, now labeled Fake_Phishing5519 and Fake_Phishing5520 in the Etherscan blockchain explorer.  At least one Mutant Ape Yacht Club NFT (a BAYC spin-off from developer Yuga Labs) was stolen and <strong>quickly sold by the 5519 wallet, which sent 19.85 ETH to the 5520 wallet.<\/strong><\/p><source media=\"(min-width: 720px)\" ><img itemprop=\"image\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652197322_977_warn-not-to-buy-NFTs-after-an-attack-on-Discord.jpg\" loading=\"lazy\" alt=\"A conference of NFTs in California, this March 31.  Photo Bloomberg\"\/><\/source><\/p>\n<p>A conference of NFTs in California, this March 31.  Photo Bloomberg\n<\/p>\n<p>  This second wallet sent 61 ETH ($211,000) to the Tornado Cash mixing service early Friday morning.  The last transaction from that wallet is a transfer of .6 ETH to a previously dormant wallet that then sent the same sum to an incredibly cool wallet.<strong> active which currently has 1447 ETH<\/strong> ($5 million), 6 million Tether coins ($6 million), and an assortment of other tokens.<\/p>\n<p>  This is not the first attack targeting crypto assets on Discord, which is a hub for the vast majority of projects despite being a gaming-focused platform, nor will it be the last.  Crypto projects already have to deal with exploits that take advantage of smart contract bugs, but the fact that an excessive number of them also live on Discord exposes them to scams that exploit the platform itself.<\/p>\n<p>  We have already seen numerous high-profile accounts fall victim to schemes that hijacked channel-wide ad-responsible bots and promoted sites to steal ETH, NFT, or wallets.  None of this is likely to stop any time soon given how central Discord is to various communities and its ability to instantly share updates, collaborate<strong> on projects or share ideas.<\/strong><\/p>\n<p>  Discord did not immediately respond to a request for comment from specialized media.<\/p>\n<h2>TOPICS THAT APPEAR IN THIS NOTE<\/h2>\n","protected":false},"excerpt":{"rendered":"<p>The servers of Discord of several major NFT projects were hacked by cybercriminals this Friday through a scam of phishing in which several users were tricked into handing over their digital certificates. Bored Ape Yacht Club, Nyoki, and Shamanz confirmed Discord hacks on Twitter. According to screenshots shared by independent blockchain researcher Zachxbt, the projects [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":399,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/396"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=396"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/396\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/399"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=396"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=396"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=396"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}