{"id":400,"date":"2022-05-10T16:49:58","date_gmt":"2022-05-10T16:49:58","guid":{"rendered":"https:\/\/infobloom.site\/everything-you-need-to-know-about-non-fungible-tokens\/"},"modified":"2022-05-18T11:56:23","modified_gmt":"2022-05-18T11:56:23","slug":"everything-you-need-to-know-about-non-fungible-tokens","status":"publish","type":"post","link":"https:\/\/infobloom.site\/everything-you-need-to-know-about-non-fungible-tokens\/","title":{"rendered":"Everything you need to know about &#8220;Non-Fungible Tokens&#8221;"},"content":{"rendered":"<p>If you are reading this article it is most likely that you heard about NFTs or someone was talking about Non-Fungible Tokens, the exorbitant amount of money that they are investing in these arts and you decided to google <strong>what is an NFT?<\/strong><\/p>\n<h3>What is an NFT?<\/h3>\n<p>Non-Fungible Token or in Spanish, non-fungible token.<\/p>\n<h4>Ok, but what does non-fungible token mean?<\/h4>\n<p><strong>Non-Fungible Token<\/strong> or better known as NFTs are objects or elements that are unique, that is, non-fungible. There is only one and it cannot be replaced by something else.<\/p>\n<p>For example, a 1 US dollar bill is fungible or interchangeable for another 1 US dollar bill, that is, it is exactly the same. A trading card, for example, is a non-fungible item. If you exchanged that unique card for another, you would have something completely different with a different value.<\/p>\n<p>The example of the Mona Lisa is always brought to the table. There is only one Mona Lisa painted by Leonardo Da Vinci and it is currently in the Louvre museum in Paris. There are several replicas and copies but they are just that, copies and replicas of the original.<\/p>\n<p>If you try to buy the &#8220;original&#8221; it will surely cost you several million dollars, but if someone tries to sell you a replica or a copy it will surely not be valued at the same price because it is simply not the original.<\/p>\n<h3>but what about digital artists?<\/h3>\n<p>Good question, until now digital artists had a big problem. Anyone could right click, save file as JPEG. and have an exact copy of any digital art or logo, and there is no way to credit the owner of the art.<\/p>\n<p><strong>So how do NFTs solve this problem?<\/strong><\/p>\n<p>Now, thanks to the blockchain, each piece of art, music, photo, drawing or anything that is unique (non-fungible), has a unique digital signature on the blockchain that makes it possible to see who the issuer of that art is and who it belongs to based on the history it contains. offers the blockchain.<\/p>\n<h3>Are NFTs different from cryptocurrencies?<\/h3>\n<p>NFTs are different from crypto-currencies because they are unique, i.e. non-fungible. NFTs and cryptocurrencies are on the Blockchain but have different purposes. The currencies are fungible and work as a payment mechanism such as Bitcoin.<\/p>\n<h3>How do NFTs work?<\/h3>\n<p>NFTs live on the blockchain, which is a kind of digital public library where transactions are recorded.<\/p>\n<p>NFTs can represent tangible or intangible things such as:<\/p>\n<ul>\n<li>Arts<\/li>\n<li>GIFs<\/li>\n<li>Videos<\/li>\n<li>Photos<\/li>\n<li>collectibles<\/li>\n<li>Virtual games, avatars and skins<\/li>\n<li>Music<\/li>\n<li>domains<\/li>\n<\/ul>\n<p>NFTs are like collectibles but virtual. So instead of receiving a physical box or card, you receive a digital file with a kind of virtual certificate on the blockchain.<\/p>\n<h3>How do I buy NFTs?<\/h3>\n<p>If you want to start your collection of NFT&#8217;s, it is important that you understand some concepts.<\/p>\n<p>With each passing day it becomes easier to buy NFTs. The first thing you have to do is generate a “wallet” or wallet to be able to host your NFT. This will depend on the platform you want to use to buy your NFT.<\/p>\n<ul>\n<li><strong>Metamask (Ethereum) – <\/strong>Simply in Chrome or any browser, install an application called Metamask. To create this wallet, you have to follow a series of steps. You can then buy Ethereum or Matic using exchanges like Coinbase, Kraken, FTX or Binance. Once you buy Ether you can transfer it to your Metamask.<\/li>\n<li><strong>Phantom (Solana)<\/strong> – Phantom is similar to Metamask, only it works on Solana. The process is the same.<\/li>\n<\/ul>\n<h3>The most popular NFT marketplaces<\/h3>\n<p>These are the sites where you can find NFT&#8217;s for sale. They are marketplaces like Amazon or eBay, the difference is that they only sell NFT&#8217;s.<\/p>\n<p><strong>opensea.io<\/strong> \/ (Ethereum) – this is one of the most popular NFT platforms. “Find, collect and sell extraordinary NFTs” is their slogan. He has popular projects like Veefriends, Bored Ape Yacht Club, and Lost Poets. To get started simply plug in your wallet.<\/p>\n<p><strong>SolSea.io<\/strong> \/ (Solana) – SolSea is similar to Opensea.io, the difference is that instead of being in the Ethereum network, it is in the Solana competition. The good thing about Solana at the moment, although it is less known than Ethereum, it has less &#8220;gas fee&#8221; therefore the cost of doing a &#8220;mint&#8221; on the platform is lower.<\/p>\n<p><strong>Solanart<\/strong> \/ (Solana) – Similar to SolSea.io, Solanart is a marketplace for NFT&#8217;s on the Solana network. One of the most popular projects is «Degenerate Ape Academy» it is similar to Bored Ape Yacht Club but on the Solana network. Many say that it was the first NFT project in Solana.<\/p>\n<p>NFTs: Everything you need to know about &#8220;Non-Fungible Tokens&#8221;<\/p>\n<p>It is important to note that you have to do your research before investing in any project. When you want to buy from one of the marketplaces mentioned in the previous point, it is important that you see if it is a verified project, because there are people who publish images and pretend to be the official project.<\/p>\n<p>The way to know if a project is official or not is to look for the blue check icon to guarantee that it is an official NFT of the project.<\/p>\n<p>Not all NFT projects have that check icon as they need to have a certain volume to be verified. The other option is to search for the project on the official page to ensure that you have the correct link.<\/p>\n<p>NFTs: Everything you need to know about &#8220;Non-Fungible Tokens&#8221;<\/p>\n<p><strong>Steps to create your own NFT<\/strong><\/p>\n<h4 class=\"rank-math-step-title \">STEP 1: Identify the art or digital file you want to create as NFT “mint”<\/h4>\n<p>This first step refers to the image, video or digital item that you want to &#8220;mint&#8221; or create as NFT. For the purposes of this example we are going to imagine that it is a cartoon.<\/p>\n<h4 class=\"rank-math-step-title \">STEP 2: Create your wallet in Metamask<\/h4>\n<p>You are going to need some Ethereum (Ether) to be able to create your art as NFT. Once created, you can connect it to a marketplace like opensea.io to be able to carry out the creation process.<\/p>\n<h4 class=\"rank-math-step-title \">STEP 3: Choose a marketplace<\/h4>\n<p>This step is important since there are several marketplaces like the ones mentioned above. For the purposes of this example we are going to use opensea.io which is one of the most popular platforms on ethereum.<\/p>\n<p>connect your <strong>meta mask<\/strong> to opensea.io and once it is authenticated you can proceed to the next step.<\/p>\n<h4 class=\"rank-math-step-title \">STEP 4: Create your “Mint” NFT<\/h4>\n<p>To create an NFT on opensea.io you must first create a collection. Enter the information you have about your art, remember that you can only verify this step once. Once created you cannot change the data. Click on Mint and voila. Congratulations you have your first NFT.<\/p>\n<h4 class=\"rank-math-step-title \">STEP 5: Sell your NFT<\/h4>\n<p>Within Opensea.io place the price of your NFT ideally in ethereum, and start promoting on your social networks.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you are reading this article it is most likely that you heard about NFTs or someone was talking about Non-Fungible Tokens, the exorbitant amount of money that they are investing in these arts and you decided to google what is an NFT? What is an NFT? Non-Fungible Token or in Spanish, non-fungible token. Ok, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":403,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/400"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=400"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/400\/revisions"}],"predecessor-version":[{"id":611,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/400\/revisions\/611"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/403"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=400"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=400"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=400"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}