{"id":404,"date":"2022-05-10T21:53:18","date_gmt":"2022-05-10T21:53:18","guid":{"rendered":"https:\/\/infobloom.site\/nfts-the-way-to-collect-digital-art\/"},"modified":"2022-05-10T21:53:18","modified_gmt":"2022-05-10T21:53:18","slug":"nfts-the-way-to-collect-digital-art","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nfts-the-way-to-collect-digital-art\/","title":{"rendered":"NFTs, the way to collect Digital Art"},"content":{"rendered":"<p class=\"p1\">Blockchain technology has brought to the entire world not only changes in procedures, ways of doing business, cryptocurrencies and cryptoactives, but it has also reinvented the area of ​​art with the new way of collecting Digital Art.<\/p>\n<p class=\"p1\">This has been achieved through <i>Non-Fungible Tokens<\/i> o NFTs, a market that is gradually growing in the world and therefore in Latin America, where the possibility of investing in digital collectibles, and the speedy and secure way in which operations can be transacted, means that many people with non-productive money and with a high risk appetite enter this emerging world of NFTs. <\/p>\n<p class=\"p1\">As an example, we can point out that Visa bought a pixelated image for US$150,000.00, but furthermore, Jack Dorsey, the founder of Twitter, sold his first tweet, the one that only said “installing twitter” for US$2.9 million, and the artist named Bleepe traded an image in which, in miniature, he had most of the works made by him, for US$69.3 million.  Recently, the haute couture firm Dolce &#038; Gabbana traded an NFT of a dress model for US$1.3 million, and as a special gift, it sent the buyer exactly the same clothing as the one purchased.<\/p>\n<p class=\"p1\">But there are also very cheap pieces that can be worth a lot of money depending on their special characteristics, which is why there are already all kinds of investors in the world researching, studying, learning and betting on this type of crypto assets.<\/p>\n<p class=\"p1\">There are several platforms for buying and selling NFTs, but we will mention only 5 of these due to their specialties: Ethernity is a platform focused on sports, especially football and American football, and its recognition has been such that it is said that players like Messi and Suarez have registered with it, which allows access and sale of exclusive and limited edition NFTs.  TopShot, which only operates with Ethernity, specializes in basketball, so for lovers of this sport it represents a good alternative to collect situations or special moments of their favorite teams and players. <\/p>\n<p class=\"p1\">OpenSea, which works with Bitcoin, Ether, Bitcoin Cash and Ethereum in its USDC and DAI versions;  It is, according to its creators, the largest platform for NFTs and offers works of art, domain names, collectible cards, among others.  Valuables, operates with Ether and only allows trading tweets autographed by their authors.  Foundation, which only operates with MetaMask Wallet that works with Ethereum, and it was through this platform that Jack Dorsey sold the image of the first twitter tweet;  brings together artists, creators and collectors focused on digital art.  To date, this platform has earned more than US$45 million, and more than 475 artists who have used it to offer their works have generated more than US$12,000 in profit.<\/p>\n<p class=\"p1\">The NTFs use blockchain technology as the vehicle to carry out their transactions and, being such a new market, it has not yet been regulated by any body in any country, which makes it a high-risk investment whose security is provided by the same technology. that supports them, but that is not endorsed by any state. <\/p>\n<p class=\"p1\">Some people argue that this market could be a way to scam and say that it could become a bubble, so the best way to avoid being a victim of scams, the first thing to do is to investigate very well the comments of the buyers or people who have transacted with the bidders, as well as the trajectory of the platform on which the digital products are traded.  Another option is to start investing with little money so that you dose the risk and in the event that an operation does not have good results, the negative impact is diluted among the other investments you have made.  Remember that, like any business or investment, the greater the profit, the greater the loss.<\/p>\n<p class=\"p1\">There are people who have bought NFTs in an Ethereum and have sold it in a short time for 4 or 5 ETH, not to mention those who have bet on larger investments and have generated higher profits, but there are also some who have bought expensive and When they have gone on the market, the offers they receive are barely a third of what they paid, so they have two options, keep the digital piece and wait to see if it increases in value in the future, or sell it at the best price they can get. receive and generate a loss on that investment, everything will depend on the monetary mass that the investor has.  Being such a new market, very little is known about it, so this, coupled with the lack of physical support, becomes a weakness, so the magnitude of their &#8220;bet&#8221; on this market will depend on the person.<\/p>\n<p class=\"p1\"><b>What do I need to buy NFTs?<\/b><\/p>\n<p class=\"p1\">The best known platform that acts as a Wallet through which NFTs can be acquired is the so-called Metamask, which, according to its own website, &#8220;equips it with a key vault, secure login, token wallet and exchange of tokens, everything you need to manage your digital assets”, which works so far only with Ethereum and ERC-20 or ERC-721 tokens.<\/p>\n<p class=\"p1\">We have seen how in recent years the world has turned to digital, especially after the appearance of the pandemic that served as a catalyst for this process of digital transformation to accelerate significantly;  cryptocurrencies or cryptocurrencies are just one example of this, since more and more people are getting involved with investments and transactions with this type of market, some moving away from the way traditional banking is handled. <\/p>\n<p class=\"p1\">Likewise, we see that through blockchain technology the number of companies and people seeking to transact their businesses digitally is growing, which is why it does not sound at all unreasonable that the collectible digital art business will grow exponentially in the coming years. , which does not exclude the tangible market, just as there are and will continue to be people who prefer to use traditional banks, those who prefer to buy products and services through the orthodox route, there will continue to be people who prefer to acquire art in a tangible way, which does not exclude those who prefer the digital route.<\/p>\n<p class=\"p1\">This is why we must be cautious when investing in this type of cryptoactive, so I always recommend allocating no more than 10% of the available capital for investment, since it must be considered that the higher the utility, the higher the risk, being directly proportional to our ambition to the size of the profits or losses that we can generate.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Blockchain technology has brought to the entire world not only changes in procedures, ways of doing business, cryptocurrencies and cryptoactives, but it has also reinvented the area of ​​art with the new way of collecting Digital Art. This has been achieved through Non-Fungible Tokens o NFTs, a market that is gradually growing in the world [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":405,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/404"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=404"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/404\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/405"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=404"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=404"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=404"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}