{"id":406,"date":"2022-05-10T22:16:55","date_gmt":"2022-05-10T22:16:55","guid":{"rendered":"https:\/\/infobloom.site\/what-is-it-when-is-it-punished-and-how-to-report-it\/"},"modified":"2022-05-10T22:16:55","modified_gmt":"2022-05-10T22:16:55","slug":"what-is-it-when-is-it-punished-and-how-to-report-it","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-is-it-when-is-it-punished-and-how-to-report-it\/","title":{"rendered":"what is it, when is it punished and how to report it"},"content":{"rendered":"<p>The <strong>fraud<\/strong> has always been one of the <strong>most media and problematic types of crime<\/strong> that society has suffered.  With the increase in new technologies and the Internet, the number of scams has been increasing, many people seek information on a daily basis to resolve doubts related to this crime and, although they are complicated to prove, anyone responsible for fraud can be reported and punished.  In case of being a victim or simply to inform you, we recommend you continue reading.<\/p>\n<h2>What is a crime of fraud?<\/h2>\n<p>An <strong>Crime of fraud<\/strong> implies an action in which a subject intends<strong> trick another into making a mistake<\/strong> that leads him to commit an act of disposition to the detriment of others or his own.  It is always carried out for profit.<\/p>\n<p>We will find the crime of fraud collected in the<strong> articles 248-251 of the Penal Code<\/strong>within Chapter VI &#8220;Of the frauds Section 1 of the scams&#8221;.<\/p>\n<h3>Penalties: How is fraud punished?<\/h3>\n<p>The one who pleads guilty will be punished with:<\/p>\n<ul>\n<li>The <strong>Mild crime of fraud for an amount less than €400<\/strong> it is regulated in article 249.2 of the Criminal Code and is punishable by imprisonment from six months to three years, depending on the amount of what has been defrauded.  If the amount that was defrauded did not exceed €400, a fine of one to three months will be imposed.<\/li>\n<li>The <strong>basic crime of fraud<\/strong> It is included in article 250 of the Penal Code and is punishable by imprisonment from six months to three years, if the amount of money defrauded exceeds €400.<\/li>\n<li>The <strong>aggravated crime of fraud<\/strong> It is included in article 250 of the Penal Code.  It occurs when the signature of another is abused, when the crime falls on goods considered artistic, historical, cultural or scientific heritage, if they exceed €50,000, if it affects many people, personal relationships are abused, fraud is committed procedural or if the culprit is sentenced for at least three consequences of those mentioned above.  In any of the circumstances mentioned above, they can be punished with imprisonment from one to six years and a fine from six to twelve months.<\/li>\n<\/ul>\n<h3>Telematic and computer scams<\/h3>\n<p>In the latest amendments to the Penal Code, <strong>internet scams and fraud<\/strong> They are considered computer crimes, that is, those that are committed with the use of new technologies such as the Internet and its tools with similar characteristics.  Finally,<strong> article 248.2 was added<\/strong> which deals with this topic and is divided into two parts:<\/p>\n<ol>\n<li>In criminal law, the <strong>computer scam<\/strong> <strong>or telematics<\/strong> is the for-profit action that uses <strong>computer manipulations<\/strong> or similar and manage to make a <strong>transfer of any property<\/strong> patrimonial without consent and to the detriment of a specific subject.<\/li>\n<li>It is also considered computer fraud the action of <strong>introduce, manufacture, possess and share or sell computer programs<\/strong> intended for the commission of a fraud.<\/li>\n<\/ol>\n<h2>Supreme Court: when is fraud punished?<\/h2>\n<p>For fraud to be considered a crime, the most important thing is that <strong>there must be cheating<\/strong>, without deception there is no crime of fraud.  The Jurisprudence of the Supreme Court has established the different elements that make up the crime of fraud:<\/p>\n<ul>\n<li><strong class=\"resaltar\">concurrent deception<\/strong>.  The deception that gives rise to the scam must be concurrent and appropriate.  This means that it must have occurred before and during the commission of the crime.<\/li>\n<li><strong class=\"resaltar\">deception enough and enough<\/strong>.  That is, the deception with which one tries to induce another to commit a certain action must be proportional to the achievement of the goal that has been proposed.  For this, the suitability of the strategy for the marriage transfer must be taken into account based on the personal conditions of the affected person, the circumstances of the moment and those of society.  In other words, the deception has had to be clothed with enough seriousness and reality to deceive people of average insight and diligence.<\/li>\n<li><strong class=\"resaltar\">Produce error in the other party<\/strong>.  It is necessary that the person who deceives has produced an error in the taxpayer as a result of his ignorance of the situation or his inaccurate or distorted knowledge of reality.  This will cause him to act under a false presupposition and to issue a manifestation of will based on a flawed motive from the beginning.  At that moment is when the transfer of assets takes place.<\/li>\n<li><strong class=\"resaltar\">The act of patrimonial disposition of the victim<\/strong>.  It is the moment in which the victim delivers the patrimonial asset as a consequence of the deception.<\/li>\n<li><strong class=\"resaltar\">profit motive<\/strong>.  To consider it a scam, it is essential that the person cheating manifests the profit motive as a motivational element.<\/li>\n<li><strong class=\"resaltar\">The causal link<\/strong>.  It is an essential element for the imputation of a crime.  It is about the causal relationship between the deception and the damage caused by the deception.  In other words, it is the necessary correlation between the two that demonstrates the defrauding dynamic.<\/li>\n<\/ul>\n<h3>How should be the deception in the scam?<\/h3>\n<p>By deception, we mean any behavior that is sufficient and proper to<strong> produce the error in the affected part<\/strong>.  It can be done through <strong>written language<\/strong> (by presenting a false document, for example) or <strong>spoken<\/strong>simply through a certain action (causing an accident to collect insurance compensation) or with just a gesture.<\/p>\n<p>On the other hand, there is also the <strong>deception by omission<\/strong>which poses some difficulties because it is difficult to distinguish it from <strong>fraud<\/strong>.  Despite the fact that it is complicated to occur and that it is quite difficult to prove, the truth is that it is an assumption that is included in the Penal Code.<\/p>\n<h2>How to report a scam?<\/h2>\n<p>Before reporting, we should make sure we can&#8217;t fix it <strong>talking to the company<\/strong>.  We can also go to <strong>Municipal Consumer Information Office (OMIC)<\/strong> if the fraud has been caused in the purchase of products or contracting services.<\/p>\n<p>The OMIC, in addition to informing, helping and guiding consumers, also <strong>will handle the processing of claims<\/strong> that consumers send them about different problems in purchasing products or contracting services.<\/p>\n<p><strong>If in neither of the two previous options we find a solution<\/strong>the next step would be <strong>file a complaint<\/strong> before the <strong>State Security Forces and Bodies<\/strong> (FCSE), and for this, we should go to:<\/p>\n<ul>\n<li>Any <strong>police station<\/strong>who have the Technological Research Brigade of the Technological Research Unit.<\/li>\n<li>Any <strong>Civil Guard post<\/strong>which has the Telematic Crimes Group (GDT).<\/li>\n<\/ul>\n<p>To denounce, better if we present evidence.  Therefore, we will have to <strong>save all information related to fraud<\/strong>, whether in digital format, screenshots, paper documents, etc.  Also save web pages, email addresses, SMS, WhatsApp messages, proof of payment, etc., because they can be key elements for the investigation of a crime.<\/p>\n<p>In addition, we will have to notify those responsible so that they remove the advertisement, make the corresponding allegations and that they can collaborate with the security forces in the investigation of the scam.<\/p>\n<p><strong>Remember!<\/strong> Because of a scam, some of our personal data may be compromised or easily accessible.  For all these reasons, if we have the slightest belief that this is so, it would be important <strong>change all our passwords<\/strong> and even <strong>notify our bank so that they block our credit cards<\/strong>.  We will have to be aware of our bank movements, just in case.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The fraud has always been one of the most media and problematic types of crime that society has suffered. With the increase in new technologies and the Internet, the number of scams has been increasing, many people seek information on a daily basis to resolve doubts related to this crime and, although they are complicated [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":407,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/406"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=406"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/406\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/407"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=406"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=406"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=406"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}