{"id":413,"date":"2022-05-11T07:37:40","date_gmt":"2022-05-11T07:37:40","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-the-new-art-and-digital-goods-collecting\/"},"modified":"2022-05-18T11:59:53","modified_gmt":"2022-05-18T11:59:53","slug":"what-are-nfts-the-new-art-and-digital-goods-collecting","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-the-new-art-and-digital-goods-collecting\/","title":{"rendered":"What are NFTs: The new art and digital goods collecting"},"content":{"rendered":"<p class=\"has-text-align-left\">NFTs or non-fungible &#8216;tokens&#8217; are unique digital assets that cannot be exchanged for each other as no two are the same. Anything that can be represented digitally has the potential to become an NFT: from a tweet to a meme to a work of art. The cryptography of the &#8216;tokens&#8217; makes it possible to prove that the owner is the sole possessor of the original piece.<\/p>\n<h2>Gold is valuable because we all believe it is<\/h2>\n<p>Cuban was reflecting at the beginning of 2021 on that revolution of the new deposits of value. <strong>Many talk about bitcoin as one of those stores of value<\/strong> that replace or can replace what gold has always represented, but for Cuban in reality everything is part of the same idea.<\/p>\n<p><\/p>\n<p>And it is that as I explained then, that gold has become the reserve of value par excellence is part of “a narrative. There are plenty of precious metals that meet the same requirements, but gold has more buyers. When the number of buyers increases, the price goes up, and vice versa. <strong>There is nothing unique or special about gold other than the fact that enough people believe that story and buy gold.<\/strong>«.<\/p>\n<p>It is the same reflection that other economists and analysts have made in the past. Yuval Noah Harari talked about it in his bestseller &#8216;Sapiens: from animals to gods&#8217; and <strong>explained how the value of gold and silver &#8220;is purely cultural&#8221;<\/strong> and it had become that store of value by perfectly meeting the requirement that it have &#8220;universal trust.&#8221; We assign value to gold because many other people (the majority of the population of our world) do.<\/p>\n<h2>From what you touch and see to what you don&#8217;t touch (but can see)<\/h2>\n<p>The <strong>NFTs (Non-Fungible Tokens) are digital assets<\/strong> which are basically an extension of that same idea. Before we gave value to tangible goods that we could touch and see (gold, stamps, works of art), and now we do so more and more to intangible goods that we mostly see, but probably can&#8217;t touch.<\/p>\n<p><img src=\"data:;base64,<svg xmlns=\" alt=\"Nft1\" width=\"734\" height=\"385\" data-lazy-src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/What-are-NFTs-The-new-art-and-digital-goods-collecting.jpeg\" \/><\/p>\n<p>Cryptocurrencies are an approximation to that principle, but NFTs go a little further and apply that concept of store of value <strong>to those objects more oriented to collecting<\/strong>.<\/p>\n<p>A digital Pokémon card is a good example of this new collectible stamp format, and the concept is the same as the one that became famous years ago with that surprising fever of cryptokitties (Cryptokitties) that in fact are still active and trading at prices that for many are absurd. Why did a digital avatar of a cat cost $115,000? Easy: enough people <strong>believed that its price was indeed that<\/strong>. There&#8217;s no more.<\/p>\n<h2>What are NFTs and what characteristics do they have?<\/h2>\n<p>Contrary to what happens with cryptocurrencies, NFTs cannot be exchanged with each other, since no two NFTs are the same: <strong>your letter from a crypto kitten is unique<\/strong>as is that digital work of art or any other intangible asset that falls under this definition.<\/p>\n<p><img src=\"data:;base64,<svg xmlns=\" alt=\"NFT, the digital art that can end the financial system\" width=\"599\" height=\"394\" data-lazy-src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652254660_982_What-are-NFTs-The-new-art-and-digital-goods-collecting.jpg\" \/><\/p>\n<p>As explained in Coindesk, <strong>there is a clear analogy between an NFT and a ticket to a music festival<\/strong>: in that ticket there is information about the ticket buyer, the date of the event and its location. Those entries, like NFTs, are personal and unique.<\/p>\n<p>Most of these “tokens” (which can be coins, stamps, works of art, or crypto cats, for example) <strong>are based on the standards of the Ethereum network<\/strong> and its chain of blocks.<\/p>\n<p>This has made it easy to operate with them when buying and selling them, and that services such as MetaMask or MyEtherWallet (wallets that allow interaction with Ethereum) are benchmarks in this type of transaction. In addition to that, <strong>NFTs have several characteristics<\/strong>:<\/p>\n<ul>\n<li><strong>strangely unique<\/strong>: these assets have many analogies with works of art, of which there may be copies (it is even easier to make copies of digital works), but here the owner can certify that he is the sole and real owner of the original work, although this can be easily shared on the internet (and it does). It is a curious situation and a twist to the value we attach to physical and digital works of art.<\/li>\n<li><strong>not interoperable<\/strong>: You cannot use a Cryptokitties avatar\/card in other similar games like CryptoPunk.<\/li>\n<li><strong>indivisible<\/strong>: Unlike cryptocurrencies, NFTs cannot be broken down into smaller parts, and have full value as a whole entity or token, just like that. You can&#8217;t have 1\/1000th of a crypto kitty.<\/li>\n<li><strong>indestructible<\/strong>: The data of an NFT is stored in the blockchain through a smart contract (Smart Contract), which means that it cannot be destroyed, deleted or replicated.<\/li>\n<li><strong>absolute property<\/strong>: Unlike music or movies, if you buy one of these goods, its property is absolutely yours. You do not buy a license to see the movie or listen to the song, but that intangible asset is completely yours.<\/li>\n<li><strong>verifiable<\/strong>: the blockchain makes it possible to verify something that is much more complex to demonstrate or certify with issues such as art or stamp collecting, for example: the blockchain keeps a history of who has bought or sold an NFT and who is its current (full) owner, including the original creator from whom that digital asset was purchased in the first place.<\/li>\n<\/ul>\n<h2>NFTs as the future of business<\/h2>\n<p>We return to Cuban, <strong>absolute believer<\/strong> of this type of digital assets. In his opinion, NFTs are the future of business. &#8220;This generation knows that a digital contract and the digital asset it represents or a crypto asset is a better investment than the traditional asset that you can see, touch or feel.&#8221;<\/p>\n<p>That of course begins to make sense with this renewed boom that is being seen with cryptocurrencies and of which bitcoin and Ether are protagonists. Crypto cats have even been followed by memes like Nyan Cat, but in addition, NFTs are also beginning to have support even in very traditional segments, as has been shown by the <strong>new auction organized by Christie&#8217;s auction house<\/strong>.<\/p>\n<p>This house <strong>will auction a digital work of art<\/strong> called &#8216;Everydays: The First 5000 Days&#8217; created by a celebrated artist named Mike Winkelmann, who is much better known by his alias, Beeple.<\/p>\n<p><img src=\"data:;base64,<svg xmlns=\" alt=\"every\" width=\"606\" height=\"606\" data-lazy-src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652254660_55_What-are-NFTs-The-new-art-and-digital-goods-collecting.jpeg\" \/>Beeple&#8217;s work begins auctioning today, and although the starting price is $100, the value will ultimately reach several million dollars.<\/p>\n<p>The work is a <strong>collage of just over 5,000 images<\/strong> created (one per day) by this artist in the last 13 years. The auction, by the way, must be paid in ETH, and at Christie&#8217;s they indicate both the address of the wallet and that of the smart contract that validates and certifies that the work —an image of 21,069 x 21,069 pixels— is unique.<\/p>\n<p>Beeple, who has earned millions with his works, has now become the greatest exponent of that theoretical revolution that art and collecting could experience with NFTs. And it is that, as Cuban said, «<strong>art is art. It has always been available in almost unlimited forms<\/strong>«.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>NFTs or non-fungible &#8216;tokens&#8217; are unique digital assets that cannot be exchanged for each other as no two are the same. Anything that can be represented digitally has the potential to become an NFT: from a tweet to a meme to a work of art. The cryptography of the &#8216;tokens&#8217; makes it possible to prove [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":419,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/413"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=413"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/413\/revisions"}],"predecessor-version":[{"id":626,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/413\/revisions\/626"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/419"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=413"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=413"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=413"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}