{"id":420,"date":"2022-05-11T08:49:12","date_gmt":"2022-05-11T08:49:12","guid":{"rendered":"https:\/\/infobloom.site\/%e2%96%b7-what-to-do-if-you-have-been-scammed-on-the-internet-10-steps-%e2%98%a0%ef%b8%8f\/"},"modified":"2022-05-11T08:49:12","modified_gmt":"2022-05-11T08:49:12","slug":"%e2%96%b7-what-to-do-if-you-have-been-scammed-on-the-internet-10-steps-%e2%98%a0%ef%b8%8f","status":"publish","type":"post","link":"https:\/\/infobloom.site\/%e2%96%b7-what-to-do-if-you-have-been-scammed-on-the-internet-10-steps-%e2%98%a0%ef%b8%8f\/","title":{"rendered":"▷ What To Do If You Have Been SCAMMED On The Internet, 10 Steps ☠️"},"content":{"rendered":"<p>do you think you could be <strong>victim of an Internet scam, fraud or scam<\/strong>?  You do not know <strong>how to act <\/strong>either <strong>what steps to follow<\/strong>?  You are in the right place!<\/p>\n<p>Surely you are wondering what is of that product or service that you bought (for example, through Wallapop) and what<strong> it hasn&#8217;t arrived yet<\/strong>that SMS that you received and that made you fill in your details or pay in advance (for example, the one from the Post Office) or the job offer that offered you to make a payment to enter the selection process and from which you have not yet received called.<\/p>\n<p>Whatever your situation, we have made a complete guide in which we explain <strong>how to proceed if you have been scammed online<\/strong>.<\/p>\n<p>We know that it is a difficult time, in which you probably do not feel like doing anything and that, for a few euros, <strong>are you willing to let go<\/strong>.<\/p>\n<p>We understand you!  Yes, we encourage you to <strong>fight until the end<\/strong> to take back what is yours and not that scammers and cyber thieves do not get away with it.<\/p>\n<p>If you decide to pass, you will only be encouraging them to continue committing crimes, so from here we tell you!<strong>mobilize, denounce and help others<\/strong>!.<\/p>\n<p>If we have already convinced you or you are one of those who have always fought for a better and fairer world, read on to find out. <strong>what to do if you have been the victim of a scam<\/strong>.<\/p>\n<h2>What to do if you have been scammed online<\/h2>\n<h3>#1 Try to contact the scammer<\/h3>\n<p>The first thing you should do, and that sometimes solves the root problem, is<strong> try to contact the scammer<\/strong>.<\/p>\n<p>Think about it!  It is not in the interest of either party that the problem be solved by criminal means, so trying to solve it in private is usually a quick solution (in many cases).<\/p>\n<p>Thus, <strong>try to get in touch<\/strong> with the seller or website (or their webmaster) that scammed you. <strong>Send emails <\/strong>(it is the best weapon, since everything is in writing) or<strong> calls on the phone<\/strong>.<\/p>\n<p><i\/><\/p>\n<p>\t\t\tThe <strong>first step <\/strong>when you have been scammed you should always be trying <strong>get in touch<\/strong> with the seller or website (or their webmaster) that scammed you.\n\t\t\t<\/p>\n<p>If you&#8217;ve already done so but got nothing, or if you manage to talk to the seller but they refuse to acknowledge the scam, <strong>threatens to sue<\/strong> Let&#8217;s see if that changes your mind.<\/p>\n<h3>#2 Call your bank<\/h3>\n<p>It is critical that you do it in the shortest possible time, because there is still a chance that the payment will be canceled if you have bought a fake product, although if you have done it through a transfer it is more difficult.  Also call if you have been a victim of phishing or smishing so that your bank can try to <strong>block cards <\/strong>and current accounts to avoid future thefts, as well as check the possible movements of money in your account to make sure what has happened.  if you use<strong> PayPal <\/strong>you should know there is one <strong>user friendly policy<\/strong> and so the full payment will be returned if the product has not arrived or arrives in poor condition.<\/p>\n<h3>#3 Change all your passwords and report the profile<\/h3>\n<p>If by any chance <strong>you have entered your personal data<\/strong> in some type of external form sent by scammers or on any platform, whether it is for sale or a social network, you have to know that once the scammers have your personal data, <strong>have access to almost everything<\/strong> what has to do with your life, social network accounts, your identity data, bank accounts.  With this they can <strong>Impersonate your identity which entails a serious danger<\/strong>. <\/p>\n<p>They have very valuable information that will be worth them for a long time but do not make their job easy and once you have detected the fraud try to change the passwords of your account.  If you have entered the <strong>credit card keys<\/strong> or a bank account we recommend that you<strong> change the passwords <\/strong>or even delete them.  In addition, it is important if a false profile has been created that<strong> report it to the platform<\/strong>.<\/p>\n<h3>#4 Collect all possible evidence about the scam<\/h3>\n<p>If it has not helped you to contact the scammer in question, you have to prepare to report.  Before reporting you should try to obtain all the evidence of the scam itself, it is possible that <strong>you must do it before a notary<\/strong> to draw up a record and it may be worth a screenshot of the computer or an electronic component where the action that has given rise to the scam is seen.  If you have made a purchase through a website, it is important that you keep proof of payment.<\/p>\n<p><i\/><\/p>\n<p>\t\t\tIf the scammer has sent you a product that has nothing to do with what you bought, the scam will be <strong>harder to justify<\/strong>.  In this case you must report to the police <strong>with the product<\/strong>which will be used as evidence at trial.\n\t\t\t<\/p>\n<h3>#5 Report fraud properly<\/h3>\n<p>The <strong>citizen collaboration <\/strong>It is vital to achieve the extinction of frauds, it is also important so that everyone can know the different frauds that exist and which are the most common to be able to identify them and not fall for them, so the frauds can be intercepted in time and you will avoid that others fall for the scam.  For this there is a web page set up by the National Institute of Cybersecurity in which you can <strong>report all types of fraud <\/strong>detected over the internet.  You can also receive information from the website itself.<\/p>\n<h3>#6 Communicate what happened to the website or marketplace<\/h3>\n<p>If the fraud has occurred with a seller in an ad Marketplace such as Wallapop, Milanuncios or Vibbo, the <strong>platform will not be responsible<\/strong>, since they are only simple intermediaries in the eyes of the law.  On the other hand, if you do it on Amazon and Ebay there is a policy in which <strong>the money will be returned to you immediately<\/strong> in case of possible fraud.  Therefore, in any case,<strong> communicate what happened<\/strong> to proceed to remove the scammer&#8217;s account and ads and prevent the same thing from happening to other people. <\/p>\n<p><i\/><\/p>\n<p>\t\t\tIf the seller is <strong>Foreign <\/strong>everything is complicated, since you would be before a <strong>international law case<\/strong> and agreements between countries, which <strong>stretch the times<\/strong> and the possibility of finding a solution.\n\t\t\t<\/p>\n<h3>#7 Go to the Municipal Consumer Information Organization<\/h3>\n<p>This is a step that you must do with any scam since it is an organization that <strong>inform, help and guide<\/strong> to customers.  So it will be useful for you to know what exactly you should do and to what extent there is a possibility that you will recover your money.  Among its functions is the<strong> processing<\/strong> <strong>of claims<\/strong> that consumers send them derived from problems in purchasing products or contracting services. <\/p>\n<h3>#8 Complaint to the authorities <\/h3>\n<p>This is probably what you will end up doing because if you have been the victim of a scam, chances are that when you have tried to contact the scammer it will be like talking to a wall.  You must do it to both the Civil Guard and the National Police so that you can recover your money, although this can be somewhat complicated, but if there is a complaint<strong> you will facilitate the work of security agents<\/strong> and you will have more chances of success.  Both entities allow you to make complaints through the website itself or in person at a police station. <\/p>\n<p><i\/><\/p>\n<p>\t\t\tAt the time of reporting it is very important <strong>know the amount of money you have been scammed<\/strong>because if it is <strong>over €400<\/strong> shall be deemed <strong>crime <\/strong>while if it is <strong>less than €400<\/strong> is considered <strong>lack<\/strong>.\n\t\t\t<\/p>\n<h3>#9 Mass spread the fraud <\/h3>\n<p>To avoid fraud you must act as quickly as possible, once you have done all the previous steps, you only have to do the last but not least.  Making the scam in question known is very important for<strong> prevent scams from succeeding<\/strong>, do not hesitate to alert your family, friends, acquaintances and any other person who may be at risk of falling for the scam.  You can use social media to<strong> achieve greater impact<\/strong> and a word of mouth effect.<\/p>\n<h2>conclusion<\/h2>\n<p><strong>You&#8217;re not alone!<\/strong> Unfortunately, the Internet is full of users who take advantage of people&#8217;s good faith to get rich.  It is common for many scammed do not follow these steps because they do not want to admit that they have been victims of a scam.  If you are here because you have been a victim, from here <strong>we want to support you<\/strong> so that you are aware that it is something more common than you think that happens to thousands of people daily and that you should not feel ashamed about it. <\/p>\n<p>Although it is true that it will be very difficult for you to recover your money, following these steps is vital so that in the future<strong> Internet can be a safer place<\/strong>.  We assure you that if you follow these steps, even if you are not able to recover your money, you will be acting to <strong>achieve a better world<\/strong> because thanks to you it will be possible for a new scam to be discovered, for others not to fall where you have fallen or for the police to put one of those scammers behind bars. <strong>Now it&#8217;s your turn<\/strong>Send us your scam!<\/p>\n<p>  have you <strong>ever reported a scam<\/strong>?  What do you think about the steps to follow?  Do you think I missed a step?  Have you ever been a victim?  Have you ever faced a scammer?  Do you have any doubts or questions?  So we ask you to <strong>leave a comment<\/strong>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>do you think you could be victim of an Internet scam, fraud or scam? You do not know how to act either what steps to follow? You are in the right place! Surely you are wondering what is of that product or service that you bought (for example, through Wallapop) and what it hasn&#8217;t arrived [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":421,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/420"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=420"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/420\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/421"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=420"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=420"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=420"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}