{"id":440,"date":"2022-05-12T12:35:45","date_gmt":"2022-05-12T12:35:45","guid":{"rendered":"https:\/\/infobloom.site\/what-are-cryptocurrencies-and-the-blockchain-this-is-how-this-new-technology-works\/"},"modified":"2022-05-12T12:35:45","modified_gmt":"2022-05-12T12:35:45","slug":"what-are-cryptocurrencies-and-the-blockchain-this-is-how-this-new-technology-works","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-cryptocurrencies-and-the-blockchain-this-is-how-this-new-technology-works\/","title":{"rendered":"What are cryptocurrencies and the blockchain?  This is how this new technology works"},"content":{"rendered":"<p class=\"description\">Try National Geographic magazine for free and be part of the movement for a more sustainable world.<\/p>\n<p>MORE INFO<\/p>\n<p class=\"description\">Enjoy our special editions at a single price for being a subscriber. <\/p>\n<p>DISCOVER THEM<\/p>\n<p>When one of the most iconic works of the British artist <strong>banksy<\/strong> It was auctioned in mid-May at Sotheby&#8217;s in New York. Its great reception was no surprise, but if the work became especially famous in the news during that week, it was because the operation had a peculiarity: in addition to dollars, the conventional payment method at this establishment, the auction house <strong>accepted payment in cryptocurrencies <\/strong>like Bitcoin (BTC) or Ether (ETH).<\/p>\n<p>It was the first time that the experiment had been carried out and the results spoke for themselves: Love Is in the Air, the work auctioned, ended up reaching a price equivalent to <strong>€10.6 million<\/strong>.  Of course, the buyer had to pay the usual rates of the auction house in dollars, so both types of currencies were used in the operation in a historical movement.<\/p>\n<p><\/p>\n<p>&#13;<\/p>\n<h2 class=\"credit-title\">&#8220;Love is in the Air&#8221;, Banksy&#8217;s work auctioned at Sotheby&#8217;s, displayed at The Art of Banksy exhibition in London.<\/h2>\n<p>&#13;<\/p>\n<p>Photo: Cordon Press<\/p>\n<p>However, cryptocurrencies are moving further away from being a peculiarity every day and have caused quite a stir in recent years.  Good for him <strong>Elon Musk&#8217;s support for Dogecoin <\/strong>(DOGE), one of the main competitors of Bitcoin, or by the<strong> price fluctuation<\/strong> Of these currencies, cryptocurrencies are ceasing to be a strange item in the news.<\/p>\n<h3>What are cryptocurrencies and what are the main ones?<\/h3>\n<p>Cryptocurrencies, in essence, are <strong>digital currencies that use cryptography methods <\/strong>to secure transactions.  This means that it is a decentralized system in which, through blockchain technology, also known as block chain, each agent in the network guarantees the security and balance of transactions, moving away from the model of traditional central banks.<\/p>\n<p>In this way the cryptocurrencies<strong> eliminate the role of the middleman <\/strong>in all transactions, accelerating each process within a network in which all users ensure the proper functioning of the network.<\/p>\n<p>The model has captured the attention of many people willing to invest in cryptocurrencies, as its price has grown significantly in recent years.  Dogecoin, Bitcoin or Ethereum are some of the most famous and are also part of the <strong>list of cryptocurrencies with the highest market capitalization<\/strong>:<\/p>\n<p><img   src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/What-are-cryptocurrencies-and-the-blockchain-This-is-how-this.jpeg\" alt=\"Chart: Statista\" class=\"lazyload\" data-aspectratio=\"800\/933\"\/><\/p>\n<p>&#13;<\/p>\n<h2 class=\"credit-title\">Chart: Statista<\/h2>\n<p>&#13;<\/p>\n<h3>What is blockchain technology?<\/h3>\n<p>&#8220;Blockchain is a technology based on a chain of decentralized and public operations blocks. This technology generates a shared database to which its participants have access, who can track each transaction they have made. It is like a <strong>large unchangeable and shared ledger <\/strong>that a large number of computers are writing simultaneously&#8221;, explains Javier Sáez, Inbound &#038; Growth Manager at the IEBS business school.<\/p>\n<p>However, it is necessary to take into account the <strong>difference between blockchain and cryptocurrencies<\/strong>.  While blockchain is the decentralized technology that allows information to be stored in the form of blocks of data that are subsequently arranged in a chain, a cryptocurrency is one of the most recognized ways of implementing a blockchain network.<\/p>\n<p><img   src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652358945_97_What-are-cryptocurrencies-and-the-blockchain-This-is-how-this.jpg\" alt=\"Blockchain technology in Spanish literally means chain of blocks.\" class=\"lazyload\" data-aspectratio=\"800\/533\"\/><\/p>\n<p>&#13;<\/p>\n<h2 class=\"credit-title\">Blockchain technology in Spanish literally means chain of blocks.<\/h2>\n<p>&#13;<\/p>\n<p>Photo: iStock<\/p>\n<p>This revolution arose at the time of an unprecedented historical crisis: it was the year <strong>2008<\/strong> when a group of crypto experts – also called cryptopunks – started theorizing about the decentralization of finance.<\/p>\n<p>&#8220;At that moment they came up with a brilliant idea, which is what we know today as the blockchain: to achieve a method of verifying transactions without having to depend on a single intermediary such as the banks that record the transactions. and the governments that print the money&#8221;, adds Gabriel Rodríguez, co-founder of Sin Comisions.<\/p>\n<h3>How does this technology work?<\/h3>\n<p>On many occasions, a <strong>practical example<\/strong> it is more revealing to explain a concept as revolutionary as blockchain.  Rodríguez explains it this way: &#8220;Let&#8217;s imagine that I have to pay for a dinner, and to send those €15 let&#8217;s suppose that I do it by means of a bank transfer. Right now, <strong>the bank is the only intermediary <\/strong>and the control is only carried out by you.  In addition, the bank in turn can provide the government that I have sent a payment with the concept &#8220;dinner&#8221; for €15.  However, the block chain ensures that all network users validate this transaction, but with the particularity that <strong>both the sender and the receiver will be anonymous<\/strong>represented by the numbers and letters on our wallets.<\/p>\n<h3>Is it possible to bring down a blockchain network?<\/h3>\n<p>&#8220;It depends on each project, what their consensus protocols are and their size. Networks like Bitcoin are very secure systems and it is <strong>virtually impossible to knock them down<\/strong>since the same entity would have to control 51% of the computing power of the network, which is currently impossible.  However, smaller networks that follow similar consensus protocols but with very small sizes could be subject to hacking and manipulation,&#8221; explains Javier Sáez, Inbound &#038; Growth Manager at IEBS.<\/p>\n<p>Therefore, it is clear that not all blockchain networks are the same and can vary in speed, size and security.  &#8220;It&#8217;s like if we talk about tires and we ask ourselves what are the chances of a tire getting flat? <strong>It will depend on the type of wheel, the vehicle and the use of the wheel<\/strong>.  Therefore, bringing down the system will depend on which blockchain we are referring to,&#8221; says Adrián Bernabéu, creator of the Master of Investors.<\/p>\n<p><strong>Some blockchain networks are more secure than others<\/strong>: &#8220;the most secure blockchain that exists to date is Bitcoin and to bring down this network it would probably be necessary to completely shut down the internet on the entire planet. If this were to happen and we were left without the internet, the world problems would be much greater than the fact that stop the Bitcoin network&#8221;, adds Bernabéu.<\/p>\n<blockquote>\n<p>&#8220;To bring down the Bitcoin network, it would probably be necessary to completely shut down the internet on the entire planet. If this happened, the world&#8217;s problems would be much greater than the fact of stopping the Bitcoin network&#8221;<\/p>\n<\/blockquote>\n<h3>What is Bitcoin?<\/h3>\n<p>Bitcoin (BTC) is the oldest cryptocurrency of all and was born in 2009 by the hand of<strong> Satoshi Nakamoto<\/strong>a person or group of people whose identity is unknown, who described this type of virtual currency as &#8220;a peer-to-peer electronic money system&#8221;, as it is baptized in the founding document of Bitcoin.<\/p>\n<p>The manifesto gives some of the <strong>keys to its operation<\/strong>: &#8220;The system will allow online payments to be sent directly from one party to another without the need to go through a financial institution.&#8221;  The document also adds that digital signatures are part of the solution, but emphasizes that the main benefits of the system are lost if a third party is required to prevent double spending.<\/p>\n<p><strong>How do you avoid depending on a third party in the exchange?<\/strong> The document hits one of the keys: &#8220;we propose a solution to avoid the problem of duplicate spending by using a peer-to-peer network, which marks each transaction and includes it in a chain where a record is formed. This cannot be changed without redoing every record of every transaction again.<\/p>\n<blockquote>\n<p>In his creation manifesto, Satoshi Nakamoto described this type of virtual currency as &#8220;a peer-to-peer electronic money system&#8221;<\/p>\n<\/blockquote>\n<p><strong>How much is a Bitcoin worth?<\/strong> At the time of writing these lines, its value is estimated at 53,507.27 euros.  Without going any further, some countries have already legalized it to accept it as a valid payment method in all transactions.<\/p>\n<p>The first country in the world to do so was <strong>The Savior<\/strong>, which allows the circulation of Bitcoin as a currency in addition to the US dollar.  This is the world map of cryptocurrency ATMs, where these digital assets can be exchanged for currencies such as the euro or the dollar:<\/p>\n<p><img   src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652358945_320_What-are-cryptocurrencies-and-the-blockchain-This-is-how-this.jpeg\" alt=\"Chart: Statista\" class=\"lazyload\" data-aspectratio=\"800\/923\"\/><\/p>\n<p>&#13;<\/p>\n<h2 class=\"credit-title\">Chart: Statista<\/h2>\n<p>&#13;<\/p>\n<h3>How are bitcoins mined?<\/h3>\n<p>&#8220;This process is a technological work of art, we can imagine it as a combination of sudoku and a game of chance with a dice with many faces. The miner who through trial and error (that is why it is technically called Proof of Work ) randomly get<strong> hit and complete the math problem<\/strong> that the Bitcoin network puts up every 10 minutes will earn the reward,&#8221; says Adrián Bernabéu, creator of the Investment Master.<\/p>\n<p>That reward every 10 minutes is what<strong> attractive enough<\/strong> as for the network to work: &#8220;right now it is at 12.5 BTC, which at the moment represents approximately $775,500. This reward is reduced by half of bitcoins every 4 years, which is known as Halving, which generates a decrease in the creation of the money supply that, in contrast to the increase in demand, causes the price to inevitably increase,&#8221; adds Bernabéu.<\/p>\n<h3>Is it safe to invest in cryptocurrencies?<\/h3>\n<p>As explained in the original manifesto of Bitcoin, one of the best-known cryptocurrencies today, many of these cryptocurrencies <strong>they were never intended as an investment product <\/strong>and its goal was to decentralize and anonymize finances.  However, it is a good idea to study the market well before investing your savings: &#8220;speculation and the commotion that has been generated behind it has managed to create an extremely volatile market in which you have to be very careful when investing. First of all, All in all, we recommend getting to know any of the projects in which we want to invest in depth,&#8221; warns Rodríguez.<\/p>\n<p>An example of a scam in the world of cryptocurrencies has come thanks to the fame of one of the most watched series in the history of Netflix, the Squid Game: &#8220;without going any further, lately SQUID token has become very famous by getting fool millions of inexperienced people who, if they had knowledge, would never have been fooled It was quite obvious that it was a scam since <strong>they had no official accounts, the company leaders had no LinkedIn and no history in the world of cryptocurrencies<\/strong>but people invested because it raised astronomical amounts in a matter of minutes and everyone wants to get rich overnight,&#8221; adds Rodríguez.<\/p>\n<h3>Knowledge, information and patience, keys to investing in cryptocurrencies<\/h3>\n<p>There is no manual to follow to the letter to achieve success investing in cryptocurrencies, but there are a series of <strong>basic principles that will avoid scams<\/strong>.  &#8220;To avoid this, it is essential to read and understand the White Papers of cryptocurrencies, know and study the team behind them, follow the Reddit or Facebook communities, and in general, be very aware of everything that surrounds cryptocurrencies. cryptocurrencies that you are most interested in. One may be attractive to you because it solves a specific problem, or because it anticipates a technology to come, or simply because it will be the fastest payment method of all, but the idea is that<strong> understanding the projects better, it will be a little more difficult to lose money<\/strong>&#8220;, recommends Gabriel Rodríguez.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652358945_680_What-are-cryptocurrencies-and-the-blockchain-This-is-how-this.jpg\" alt=\"Cryptocurrencies, the carbon footprint of digital money \" class=\"imagenRelacionado lazyload\"\/>&#13;<\/p>\n<p class=\"info\">More information<\/p>\n<p>&#13;<\/p>\n<h3 class=\"title trans-background-yellow\">Cryptocurrencies, the carbon footprint of digital money<\/h3>\n<p>&#13;<\/p>\n<ul>\n<li>You enjoy history?  Are you a photography lover?  Do you want to keep up to date with the latest scientific advances?  Do you love to travel? <strong>Sign up for our National Geographic newsletter for free! <\/strong><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Try National Geographic magazine for free and be part of the movement for a more sustainable world. MORE INFO Enjoy our special editions at a single price for being a subscriber. DISCOVER THEM When one of the most iconic works of the British artist banksy It was auctioned in mid-May at Sotheby&#8217;s in New York. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":446,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/440"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=440"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/440\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/446"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=440"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=440"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=440"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}