{"id":450,"date":"2022-05-12T20:45:26","date_gmt":"2022-05-12T20:45:26","guid":{"rendered":"https:\/\/infobloom.site\/rude-golems-willyrex-and-salomondrin-nft-collection\/"},"modified":"2022-05-12T20:45:26","modified_gmt":"2022-05-12T20:45:26","slug":"rude-golems-willyrex-and-salomondrin-nft-collection","status":"publish","type":"post","link":"https:\/\/infobloom.site\/rude-golems-willyrex-and-salomondrin-nft-collection\/","title":{"rendered":"Rude Golems |  Willyrex and Salomondrin NFT Collection"},"content":{"rendered":"<h2>The team<\/h2>\n<p>It&#8217;s just that this team really has unique capabilities.  Each one is a top performer in their area, having 4 of them working for us is no small thing.<\/p>\n<h3>Willyrex<\/h3>\n<p>Willyrex has a great enthusiasm for the NFT world, his own collection of which I am a part, an NFT Gaming YouTube channel with about 20-30 thousand views per video.<\/p>\n<p>And above all, he has a lot of money.  And even more so because he has been investing in crypto these last few years.<\/p>\n<p>As I see it, the NFT world gave Willy a lot of life because he has where to invest all the crypto he has earned over the years and some fiat money may also fall.<\/p>\n<p>In the end, Willy loves to invest in projects in which he sees potential that may be things that he himself would enjoy, and if Willy knows anything, it is gaming and intellectual properties.<\/p>\n<p>Willyrex is one of the biggest brands on Youtube.  If you notice, Willy&#8217;s visits have dropped considerably in recent years.  He doesn&#8217;t play the trendy games anymore, he doesn&#8217;t goof around anymore because he thinks that&#8217;s what the fans want.  He plays what he wants, he comes to enjoy himself and invites us to accompany him.<\/p>\n<p>However, every time Willyrex is talked about, ALL the biggest streamers and youtubers in the world are echoed.<\/p>\n<p>When he released his NFT ZIGOR×WILLYREX collection, it trended on Twitter worldwide for two days, and in Spain for even longer.  Everyone wants to know what Willyrex does, even if his videos don&#8217;t get as many views as others.<\/p>\n<h3>Salomondrin<\/h3>\n<p>I just met Salomon along with the Rude Golems NFTs.  He appears to be a man with quite a bit of money, and pretends that he knows personal finance.<\/p>\n<p>According to Google, he has been a producer or has participated in an interesting number of movies and series.<\/p>\n<p>He says he&#8217;s very good at selling intellectual property, and for now I have to say that&#8217;s true.  It remains to be seen if so many promises and possibilities are fulfilled or not.<\/p>\n<h3>Juca<\/h3>\n<p>Unfortunately I don&#8217;t know Juca.<\/p>\n<h3>lordshark<\/h3>\n<p>I don&#8217;t know either.  He appears to be in charge of a very powerful collection of NFTs that came out a while ago involving some sharks.  But I have not searched for data on him or his collection<\/p>\n<h2>Rude Golems: The Biggest in Hispanic NFTs<\/h2>\n<p>It&#8217;s amazing what they&#8217;ve accomplished in just a few weeks.  Rude Golems is definitely the largest NFT community, and the most ambitious project of Hispanic NFTs, and why not say all of them.<\/p>\n<p>Thousands of Europeans and Latin Americans have bought their first NFT thanks to Rude Golems, a tremendous contribution from Creator Studios, opening the doors of the NFT world.<\/p>\n<p>Congratulations to those who have done this, congratulations!  And let&#8217;s wait to see how the promises and expectations unfold!<\/p>\n<h3>Personalities and Influencers who have Purchased Rude Golems<\/h3>\n","protected":false},"excerpt":{"rendered":"<p>The team It&#8217;s just that this team really has unique capabilities. Each one is a top performer in their area, having 4 of them working for us is no small thing. Willyrex Willyrex has a great enthusiasm for the NFT world, his own collection of which I am a part, an NFT Gaming YouTube channel [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":451,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/450"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=450"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/450\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/451"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=450"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=450"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=450"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}