{"id":452,"date":"2022-05-12T23:15:48","date_gmt":"2022-05-12T23:15:48","guid":{"rendered":"https:\/\/infobloom.site\/centralized-vs-decentralized-exchanges-bingx\/"},"modified":"2022-05-18T11:58:43","modified_gmt":"2022-05-18T11:58:43","slug":"centralized-vs-decentralized-exchanges-bingx","status":"publish","type":"post","link":"https:\/\/infobloom.site\/centralized-vs-decentralized-exchanges-bingx\/","title":{"rendered":"Centralized vs Decentralized Exchanges &#8211; BingX"},"content":{"rendered":"<p>Buying or selling cryptocurrencies is really easy these days. Cryptocurrency services or products are delivered by thousands of companies trying to differentiate themselves by what they offer. However, the very basic description divides cryptocurrency exchanges between centralized exchanges (CEXes) and decentralized exchanges (DEXes). What are the main differences, advantages or disadvantages of both? Also, when is a good time to use CEX over DEX or vice versa? All of these will be covered in the next article.<\/p>\n<h2>What are centralized exchanges?<\/h2>\n<p>The most common type of cryptocurrency exchange is a centralized exchange. This type of institution is very similar to traditional financial companies (traditional stock exchanges). The only difference is that it offers crypto-connected products and services, not stocks, bonds, or commodities (although some exchanges like Binance have started offering tokenized stocks).<\/p>\n<p>Therefore, centralized exchanges have offices, employees and are traditional companies, which will be very different compared to DEXs. These types of exchanges, due to their traditional infrastructure and systems, generally have to follow very strict regulations regarding KYC (know your customer) and AML (anti-money laundering) policies. This is often considered one of its drawbacks, but we&#8217;ll get to that later.<\/p>\n<h3>Advantages of centralized exchanges<\/h3>\n<p>First, let&#8217;s take a look at the advantages of centralized exchanges. Since they are essentially traditional financial companies, they must follow strict regulations regarding the security of the assets they store. It is a very common practice that they have strong security and cybersecurity teams that comply with up-to-date measures and rules, leading to safer storage of cryptocurrencies. Also, if they hold most cryptocurrencies in cold storage wallets (which in most cases they should), they offer an environment that should be difficult to hack.<\/p>\n<p>Since these companies must comply with regulations, they can be held liable if necessary. This may seem quite simple, but it will not be the case with DEX. In addition, they usually offer a variety of customer services and support teams that are helping customers in case of need, which is again one of their advantages.<\/p>\n<p>In general, centralized exchanges are usually quite easy to use with a very simple user interface for both retail and institutional investors. Most of them even offer fiat on\/off ramps, meaning users can easily transfer their funds to or from the exchange.<\/p>\n<h3>Disadvantages of centralized exchanges<\/h3>\n<p>As mentioned above, strict KYC and AML policies must be followed, which means that users of these exchanges cannot have adequate privacy. In many cases, KYC and AML related checks require multiple documents and IDs, which share a lot of data and personal information and may not be well received by everyone.<\/p>\n<p>Most centralized exchanges are so-called custodians, meaning they hold the cryptocurrencies you buy. Even though they almost always offer a withdrawal option, until you actually withdraw the cryptocurrencies, they are in the possession of the exchange. He simply said, &#8220;Not your keys, not your coins.&#8221;<\/p>\n<p>Furthermore, as the past few months have shown, centralized exchanges are facing various issues regarding their reliability. As with other financial companies, investors must trust the third-party provider (in this case, the centralized exchange). However, this can be difficult when the reputation of centralized exchanges is not the best.<\/p>\n<p>For example, in one week in April, 2 cryptocurrency exchanges in Turkey, Thodex and Vebitcoin shut down their services and products and are considered exit scams. Furthermore, in February, Coinbase decided to pay a fine of $6.5 million for money laundering and price manipulation, which only shows that some of the exchanges could be prone to abusing their power and it remains one of the largest. shortcomings of centralized exchanges<\/p>\n<p>Difference between CEX and DEX, Source: blockgeeks.com<\/p>\n<h2>What are decentralized exchanges?<\/h2>\n<p>The concept of decentralization was popularized mainly through the creation of cryptocurrencies and remains one of the main features and characteristics of this world. When it comes to decentralized exchanges, decentralization means that the platforms run mostly on smart contracts and are only being developed by small teams, usually not in the form of companies.<\/p>\n<p>Their ultimate goal should be, and in most cases it is, to move exchange governance solely into the hands of token holders, who should have full voting power over decisions to be made in the process. improvement and execution. As with CEXs, DEXs have several advantages and disadvantages that we will look at.<\/p>\n<h3>Advantages of Decentralized Exchanges<\/h3>\n<p>The biggest advantage of DEXs compared to CEXs is probably their ability to keep buyers (or in this case exchanges) private. It is very common that most DEXes do not have KYC and AML regulations. For some of them, you don&#8217;t even need to have an open account. It is usually enough for users to just connect their wallets to DEXs, which keeps buyers&#8217; privacy to themselves.<\/p>\n<p>Hand in hand with the privacy feature is connected, the next advantage of DEXes. This is the fact that the only person responsible for all the coins or tokens is the person who makes the trades. This means that the coins and tokens are always in his own hands and in his custody, which means that no one can prevent him from trading them or no one will ask him for more or better verification. Everything depends exclusively on you.<\/p>\n<p>DEXs also have the ability to offer countless cryptocurrencies and projects. Since most of them do not have order books, but rather are automated market makers that just need enough liquidity from liquidity pools, any currency, token, or trading pair can be traded on the DEX, if it has enough liquidity. However, this is also one of their downsides as there are many scams and exit scam projects being traded on these exchanges as there is no “veto rule” or supervision over the listed trading pairs.<\/p>\n<h3>Disadvantages of decentralized exchanges<\/h3>\n<p>As we mentioned before, the “no veto rule” means DEXes can be riddled with scams and illegal projects trying to rip off investors. However, there are several more downsides to DEXs, such as their expensive trading fees. This is mostly visible on Ethereum-based DEXs, where the scaling issue is becoming more and more present. Once scaling is resolved, fees can be significantly lower, however until that happens (likely with the implementation of ETH 2.0), DEXs built on the ETH network will always suffer.<\/p>\n<p>Also, the fact that most DEXs are only built on one network (such as Ethereum), assets from other blockchains cannot yet be traded on them. Solutions such as wrapped assets are already used; however, they may not be the best, leading to a relatively high split of projects based on the platform they are based on.<\/p>\n<p>DEXs also have no customer support. There are several blogs or platforms where the community is of great help, however, this does not mean that all problems can be solved there. Also, DEXs don&#8217;t just miss customer support, they also don&#8217;t have any special features like graphics or fiat entry ramp. This means that asset trading on DEX can be complicated or quite complex compared to CEX.<\/p>\n<h2>When to use CEX and DEX?<\/h2>\n<p>After seeing most of the positives and negatives of both types of cryptocurrencies, one might ask, when is it appropriate to use each type? The answer to that question would differ depending on the individual trader or investor, however, some basic generalizations can be made.<\/p>\n<p>When you want to buy traditional coins or tokens from all different blockchains or networks, CEX may be your best option. Also, if you are not that familiar with the cryptocurrency space, the simplicity of CEX may offer you some comfort when using it.<\/p>\n<p><img class=\"wp-image-2907 size-full jetpack-lazy-image\" src=\"https:\/\/i0.wp.com\/blog.bingx.com\/wp-content\/uploads\/2021\/05\/CEX-DEX-SUMUP.png?resize=512%2C488&amp;ssl=1\" alt=\"\" width=\"512\" height=\"488\" data-recalc-dims=\"1\" data-lazy-src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652397348_811_Centralized-vs-Decentralized-Exchanges-BingX.png\" \/>Advantages and disadvantages of CEX and DEX summed up, Source: medium.com<\/p>\n<p>On the other hand, DEXs would be beneficial if you want to buy some small-cap gems that have just started trading. Also, DEXs are used for security and privacy purposes, so if you are very careful about your whereabouts in the “digital world”, DEXs offer better privacy than CEXs. These types of exchanges are also used to buy “gems,” small-cap tokens that are new to the crypto world and fairly risky investments, but typically offer high returns.<\/p>\n<p>The decision on which exchanges to use is always up to the trader or investor. However, it might be useful to have the ability to trade in both and use, for example, DEXes to buy little-known gems and CEXes to buy well-established coins and tokens. In this way, one can be sure that they are using the world of cryptocurrencies to the fullest.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Buying or selling cryptocurrencies is really easy these days. Cryptocurrency services or products are delivered by thousands of companies trying to differentiate themselves by what they offer. However, the very basic description divides cryptocurrency exchanges between centralized exchanges (CEXes) and decentralized exchanges (DEXes). What are the main differences, advantages or disadvantages of both? Also, when [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":455,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/452"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=452"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/452\/revisions"}],"predecessor-version":[{"id":618,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/452\/revisions\/618"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/455"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=452"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=452"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=452"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}