{"id":466,"date":"2022-05-13T09:40:54","date_gmt":"2022-05-13T09:40:54","guid":{"rendered":"https:\/\/infobloom.site\/nfts-a-non-fungible-trend\/"},"modified":"2022-05-13T09:40:54","modified_gmt":"2022-05-13T09:40:54","slug":"nfts-a-non-fungible-trend","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nfts-a-non-fungible-trend\/","title":{"rendered":"NFTS: A NON-FUNGIBLE TREND?"},"content":{"rendered":"<p><strong>Many people talk about NFTs and everything that is happening in the famous Metaverse, that virtual universe in which, like the Matrix, the physical world can be surpassed.  To understand a little more about this, we invite Alvaro Emiliani, an artist and analyst of Pop Culture who has done a lot of research on this topic.<\/strong><\/p>\n<p class=\"has-text-align-center\">By Alvaro Emiliani.  Photos: Depositphotos and private archive<\/p>\n<p>Have you ever bought something because it is fashionable?  Think about it… I&#8217;ve always considered trends as something that tries to seduce and seduce you into doing any number of things or looking a certain way.  Some make it, others don&#8217;t, some come and go, others remain and are transformed, but they are always a reflection of a society and an indication of its future.  There have been many trends such as crop tops, genderless clothing, live action cartoons, among others, there are many examples.<\/p>\n<p>But how do you know if a trend is the beginning of something bigger or just temporary?  An indication that a trend is the door to a new direction is if it is named the word of the year for the Collins Dictionary, one of the most important in English that claimed that the NFT word was the most important of 2021.<\/p>\n<p>Mutant monkeys have been one of the most successful NFTs and have been paid half a million dollars for each one.<\/p>\n<p>They were among the most sought after, the most offered, the best selling and the most disruptive online.  And I thought that when it came to famous acronyms in the digital age, nothing beat WIFI, but when you realize that the acronym NFT is in political headlines, Twitter trending topics, Google Trends, which are part of the menu of McDonald&#8217;s, Prada windows, and in the Instagram reels of Paris Hilton and Maluma, you discover that it is very close to being as popular as my first choice.  They sell for thousands of dollars or a pair, they&#8217;re cool and have made several millionaires overnight.<\/p>\n<p><img width=\"800\" height=\"533\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652434854_541_NFTS-A-NON-FUNGIBLE-TREND.jpg\" alt=\"\" class=\"lazyload wp-image-7659\"  data-\/>Balenciaga is one of the luxury firms that has ventured the most into its NFTs collections<\/p>\n<p>NFT is the abbreviation for non fungible token, in Spanish they are called non-fungible objects, but for a better understanding I like to refer to them as unique, unrepeatable and therefore collectible objects, a key word in this topic.<\/p>\n<p>The Internet is full of chronicles of how the first of them was created in 2014 and that today it is worth about eight million dollars.  An animated hexagonal graphic piece that thanks to blockchain technology managed to revert digital art.  If blockchains and cryptocurrencies managed to decentralize the economy, NFTs allowed digital art, its fans and creators, to have a more profitable business model, which exalted its value as a unique and collectible piece.<\/p>\n<h2>Little gigants<\/h2>\n<p>NFTs are digital contracts, property titles that are stored and guaranteed by the famous blockchain.  To have one is to have possession of a digital asset.  All this happened within the crypto ecosystem, a very well-segmented and visionary community that, just as it saw a decentralized economic future, saw emotional and economic value in these tokens, because let&#8217;s remember the keywords: collectible and unrepeatable.  Two attributes of these little giants that have made some of them cost more than a pair of panties worn by Marilyn Monroe in auction houses today.<\/p>\n<p>Gucci has been one of the pioneering luxury brands in bringing NFTs to market.<\/p>\n<h2>The &#8220;art&#8221; of collecting<\/h2>\n<p>But in 2014, with the crypto community targeted and emotional marketing buoyed by the scoop on unit shortages and people&#8217;s urge to own them, things started to pick up a fast pace.  I have not bought an NFT yet, but I have experienced firsthand the desire, anxiety, urgency and emotional value that something you want can have, what you are capable of doing and investing to achieve it and I have an anecdote which I promise is relevant to this topic.<\/p>\n<p>Many famous sportswear brands have jumped on this trend with sneakers in NFTs that can also be transferred to the physical world.<\/p>\n<p>I was nine years old and in my backpack there were more prints of Knights of the Zodiac than colors.  Every break we would get together more than half of the room to negotiate, exchange, beg and sell those sheets in order to complete the collection, to have assets that would help us in future negotiations and bring us closer to the golden sheets, of those that there were few and they gave status to your collection, to you as a dealer and hunter of sales spots.  I emphasize that we were 9 years old and we negotiated with 45-year-old vendors and other students between 7 and 16 years old.  We were a well-segmented niche that functioned under the pressure of urgency, the limited offer and the adrenaline of achieving that object of desire, the same values ​​that the NFT current professes in its raison d&#8217;être.  We were going crazy like those first buyers of these tokens.<\/p>\n<p><img width=\"1024\" height=\"576\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/NFTS-A-NON-FUNGIBLE-TREND.jpeg\" alt=\"\" class=\"lazyload wp-image-7662\"  data-\/>The already legendary jumpsuit made an &#8220;alliance&#8221; with the firm Adidas.<\/p>\n<h2><strong>NFTs of everything and for everyone<\/strong><\/h2>\n<p>Unique, collectible objects that you can get without so much bureaucracy.  Shortly after the first NFT came new creators who used the crypto community to push this new object of desire.  Cryptokitties and Cryptopunks are some of the most popular creators who, with their urgent marketing and collectability, have managed to sell property contracts for their pieces for thousands and thousands of dollars, capturing the attention of those interested in buying as well as the press interested in talking about this new and unusual form of business that generated million-dollar transactions.  Over the years and the growth of the crypto community, the acceleration of the digital age and the virality of content, NFTs have taken hold for when it comes to digital assets in the digital age, everything seems to be <strong>jan-efe-teable<\/strong>from a meme to a tweet, going through viral photos and videos.<\/p>\n<p>The famous designer Karl Lagerfeld, now deceased, has a whole collection of figures in NFTs.<\/p>\n<h2><strong>The best is yet to come<\/strong><\/h2>\n<p>NFTs went from a niche boom to a pop culture kaboom with stories everywhere of instant millionaires buying for a couple of bucks and reselling for thousands to the likes of Justin Bieber and Steve Aoki.  Shakira uses them to raise funds for her foundation, Coachella gives away free tickets to its festivals for the purchase of theirs, and politicians use them in their campaigns to pocket generation Z. What in 2014 was looking for fair deals for digital art and give a new dimension to the blockchain, in 2022 it is a trend as popular as “Despacito” and Spanglish duets, skinny pants or Knights of the Zodiac albums.  It is inevitable to wonder: are the NFTS what is IN this spring\/summer, a new dream of being millionaires or are they the door to a new business model, fairer and more decentralized?<\/p>\n<p>NFTS, trend or sign of change?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Many people talk about NFTs and everything that is happening in the famous Metaverse, that virtual universe in which, like the Matrix, the physical world can be surpassed. To understand a little more about this, we invite Alvaro Emiliani, an artist and analyst of Pop Culture who has done a lot of research on this [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":470,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/466"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=466"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/466\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/470"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=466"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=466"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=466"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}