{"id":480,"date":"2022-05-14T11:02:49","date_gmt":"2022-05-14T11:02:49","guid":{"rendered":"https:\/\/infobloom.site\/complaints-about-scams-usagov\/"},"modified":"2022-05-14T11:02:49","modified_gmt":"2022-05-14T11:02:49","slug":"complaints-about-scams-usagov","status":"publish","type":"post","link":"https:\/\/infobloom.site\/complaints-about-scams-usagov\/","title":{"rendered":"Complaints about scams |  USAGov"},"content":{"rendered":"<p>There are many types of scams and fraud, and it&#8217;s hard to know where to report each one.  First, file a report with your local police.  You can also contact your state consumer protection office.  Some types of scams and fraud can be reported to federal law enforcement agencies.  They can&#8217;t act on your behalf, but they can use complaints to record patterns of abuse and then take action against a company or industry.<\/p>\n<li>\n<p><strong>Food Stamp (SNAP) Scam:<\/strong> Report people or merchants who commit fraud with the use, sale, or acceptance of food stamps.  File a complaint with the USDA Office of Inspector General.<\/p>\n<\/li>\n<li>\n<p><strong>Fraud<\/strong><strong> financial (credit, mortgages and loans):<\/strong> Contact the Consumer Financial Protection Bureau (CFPB) for problems or fraud related to mortgages, loans, wire transfers, student loans, credit reports, and other financial services.<\/p>\n<\/li>\n<li>\n<p><strong>Identity theft or data breach:<\/strong> File a report at IdentityTheft.gov if someone steals your identity to apply for credit, file tax returns, or commit other fraudulent acts.  This service can also help you put a plan in place for the process of recovering your identity.<\/p>\n<\/li>\n<li>\n<p><strong>Immigration Fraud:<\/strong> file a complaint with the United States Citizenship and Immigration Services (USCIS) to report the illegal use of documents or actions to evade US immigration laws.<\/p>\n<\/li>\n<li>\n<p><strong>International scams:<\/strong> Report e-commerce (sales and trades conducted over the Internet) or travel scams to econsumer.gov.<\/p>\n<\/li>\n<li>\n<p><strong>Internet fraud:<\/strong> file a complaint (in English) with the Internet Crime Complaint Center (IC3) if you are a victim of “phishing,” when a scammer uses fake emails, text messages, or fake websites officials, to steal your identity or personal information.  You can also report malicious software or “malware” intended to damage computer systems and other related problems to IC3.<\/p>\n<\/li>\n<li>\n<p><strong>Investment Fraud:<\/strong> Contact the Securities and Exchange Commission or your state securities regulator to report bid scams that use false information to get someone to invest your money.<\/p>\n<\/li>\n<li>\n<p><strong>Imposter Scams Impersonating IRS Agents or Other Government Agencies:<\/strong> Report people trying to impersonate IRS agents.  File a complaint (in English) with the Treasury Inspector General for Tax Administration (TIGTA) or 1-800-366-4484 (press 2 for Spanish).  For other scams involving alleged government agents, file a complaint with the Federal Trade Commission (FTC).<\/p>\n<\/li>\n<li>\n<p><strong>Mail Fraud:<\/strong> Contact the US Postal Inspection Service to report scams and misleading mail-delivered ads, mail theft, and other related fraud.<\/p>\n<\/li>\n<li>\n<p><strong>Medicaid Fraud:<\/strong> file a Medicaid fraud complaint with the program office in your state.  Use the Fraud and Abuse Complaint Directory (PDF, Download Adobe Reader) to find contact information for your local office.<\/p>\n<\/li>\n<li>\n<p><strong>Medicare Fraud: <\/strong>File a report in English with the Department of Health and Human Services (HHS) Office of Inspector General to report scammers trying to obtain your personal information or Medicare number to steal your identity and commit fraud.<\/p>\n<\/li>\n<li>\n<p><strong>Moving Services Fraud:<\/strong> File a complaint with your state public utility commission to report dishonest movers for service in the same state where you reside.  Instead, report to the Federal Motor Carrier Safety Administration for interstate services.<\/p>\n<\/li>\n<li>\n<p><strong>Social Security Fraud:<\/strong> File a complaint with the Social Security Administration&#8217;s Office of the Inspector General for alleged fraud, waste, or abuse, such as false statements, kickbacks, concealment of information, and others.<\/p>\n<\/li>\n<li>\n<p><strong>Phone scams:<\/strong> file a complaint in English with the Federal Communications Commission (FCC) if you discover mysterious charges on your bill (“cramming”), an illegal change of your service (“slamming”), or unwanted calls such as , phone sales.<\/p>\n<\/li>\n<li>\n<p><strong>Fraud related to the Temporary Assistance for Needy Families (TANF) Program:<\/strong> contact your local TANF office or call the Department of Health and Human Services (HHS) Office of Inspector General at 1-800-447-8477 (press 2 for Spanish) to report program fraud or abuse .<\/p>\n<\/li>\n<p>Reporting fraud won&#8217;t get you back everything you&#8217;ve lost, but it improves your chance of getting something back and avoiding future losses.  It also helps authorities stop scams before others become victims.  Learn to recognize the warning signs of common scams and fraud to protect your personal and financial information.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are many types of scams and fraud, and it&#8217;s hard to know where to report each one. First, file a report with your local police. You can also contact your state consumer protection office. Some types of scams and fraud can be reported to federal law enforcement agencies. They can&#8217;t act on your behalf, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":176,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/480"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=480"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/480\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/176"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=480"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=480"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=480"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}