{"id":485,"date":"2022-05-14T12:22:39","date_gmt":"2022-05-14T12:22:39","guid":{"rendered":"https:\/\/infobloom.site\/this-is-how-cryptocurrency-scams-are-in-the-metaverse\/"},"modified":"2022-05-18T12:01:10","modified_gmt":"2022-05-18T12:01:10","slug":"this-is-how-cryptocurrency-scams-are-in-the-metaverse","status":"publish","type":"post","link":"https:\/\/infobloom.site\/this-is-how-cryptocurrency-scams-are-in-the-metaverse\/","title":{"rendered":"this is how cryptocurrency scams are in the metaverse"},"content":{"rendered":"<p>The China Banking and Insurance Regulatory Commission issued a warning against <strong>illegal fundraising schemes <\/strong>related to the metaverse, amid the rise of Chinese activity in the digital sector that seeks to combine virtual reality, video games, cryptocurrencies and social networks.<\/p>\n<p>According to this commission there are unknown groups that <strong>&#8220;They manufacture false investment projects<\/strong> in the metaverse&#8221; and make false claims to absorb public funds. Metaverse Investment Project and Metaverse Chain Tour appear to be prime suspects.<\/p>\n<p>The regulator noted that criminals manage to defraud investors by <strong>create hype around the metaverse<\/strong> and &#8220;deceive participants into investing by exchanging cryptocurrencies.&#8221;<\/p>\n<p>“Some criminals link the concepts of the metaverse with their projects and introduce the concepts of earning money while playing and <strong>high yields with short cycles<\/strong> to entice people to invest by trading virtual currencies and assets in games,” the regulator said, noting that virtual real estate is another scheme used by fraudsters.<\/p>\n<p><\/p>\n<p>Axie Infinity. The king of NFT games is known as “the Bitcoin of blockchain games”.<\/p>\n<p>Beijing seems to have authorized projects related to the metaverse even though it is a concept closely associated with gaming and cryptocurrencies. In this sense, China essentially <strong>banned cryptocurrencies<\/strong> <strong>and blockchain games<\/strong> that have tokens.<\/p>\n<p>So far, the regulator has made no specific mention of the <strong>NFTs that are revolutionizing digital art<\/strong> nor to blockchain games, which could be the gateway of cryptocurrencies to the metaverse. In this way, the commission is limited to addressing the common investment concepts that are commonly used in these two spaces.<\/p>\n<p>The metaverse is a concept that is expanding rapidly in China, especially in large technology companies.<\/p>\n<p>The state telecommunications conglomerate <strong>Chinese Mobile<\/strong> established the Metaverse Industry Committee last October, while Chinese tech giants such as Tencent Holdings Ltd. and Alibaba Group Holdings Ltd. filed in recent months <strong>trademark applications <\/strong>related to the metaverse.<\/p>\n<p>“We may be seeing a bifurcation of metaverse technology and virtual asset trading, as we have already seen in the blockchain industry in China,” said Winston Ma, managing partner in New York at CloudTree Ventures, which invests in gaming, esports and virtual reality technologies.<\/p>\n<h2>Cryptocurrencies in free fall<\/h2>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652530959_422_this-is-how-cryptocurrency-scams-are-in-the-metaverse.jpg\" alt=\"Bitcoin lost almost half of its value since its November 2021 high. Photo: REUTERS.\" \/><\/p>\n<p>Bitcoin lost almost half of its value since its November 2021 high. Photo: REUTERS.<\/p>\n<p>On the other hand, Bitcoin and other cryptocurrencies lost value in recent days and began to reflect the repercussions of the growing tensions between Russia and Ukraine, which lead investors to avoid riskier assets.<\/p>\n<p>Bitcoin was trading this Thursday at $36,649 and fell almost 6.5% in the last few hours, according to data published by CoinDesk.<\/p>\n<p>The <strong>most famous cryptocurrency in the world<\/strong> It fell below $40,000 over the weekend and continued to decline as the Ukraine crisis intensifies, according to the Ansa agency.<\/p>\n<p>The coin has already lost nearly half of its value from its November high of $68,990 due to <strong>geopolitical tensions<\/strong>the prospect of increases in interest rates by the United States Federal Reserve<strong> and the restrictions of some major economies on digital assets.<\/strong><\/p>\n<p>Other cryptocurrencies like <strong>ethereum<\/strong>the second most valuable in the world, fell more than 8% in the last hours and was trading at 2,520 dollars.<\/p>\n<h2><\/h2>\n","protected":false},"excerpt":{"rendered":"<p>The China Banking and Insurance Regulatory Commission issued a warning against illegal fundraising schemes related to the metaverse, amid the rise of Chinese activity in the digital sector that seeks to combine virtual reality, video games, cryptocurrencies and social networks. According to this commission there are unknown groups that &#8220;They manufacture false investment projects in [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":488,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/485"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=485"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/485\/revisions"}],"predecessor-version":[{"id":629,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/485\/revisions\/629"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/488"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=485"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=485"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=485"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}