{"id":489,"date":"2022-05-15T08:40:12","date_gmt":"2022-05-15T08:40:12","guid":{"rendered":"https:\/\/infobloom.site\/the-list-of-companies-and-industries-that-are-already-in-the-metaverses\/"},"modified":"2022-05-18T11:52:50","modified_gmt":"2022-05-18T11:52:50","slug":"the-list-of-companies-and-industries-that-are-already-in-the-metaverses","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-list-of-companies-and-industries-that-are-already-in-the-metaverses\/","title":{"rendered":"The list of companies and industries that are already in the metaverses"},"content":{"rendered":"<p>The list of companies that are in the metaverses grows day by day. It is believed that the metaverse built on the blockchain may become the successor to the current internet. Therefore, more and more companies compete with each other to get the best sites in these parallel realities. Little by little, the metaverses are filling up with companies that adapt the offer of their goods and services in the real world to virtual worlds. Last week we learned about the sale of two virtual lots of land for 5 million dollars. And there are already real estate companies that offer the same services in the metaverses as in real life.<\/p>\n<p><\/p>\n<p>We tell you the differences between the different types of metaverses<\/p>\n<p>Just as a person needs to buy clothes in real life, their avatar also needs to buy clothes in the metaverses. Therefore, you need a store to sell you such clothes. The possibilities provided by the monetary connection between the virtual and real world is attracting the attention of companies from all kinds of industries. According to a report by crypto investment group Grayscale, metaverses may represent a market opportunity of more than $1 trillion in annual revenue.<\/p>\n<h2>List of companies in the metaverses<\/h2>\n<p>In addition to the big technology companies, which are already working on building their own metaverses, as is the case with Facebook or Microsoft, numerous &#8220;traditional&#8221; companies from all kinds of industries have already opened their headquarters in some metaverse to market their goods and services. services virtually.<\/p>\n<h4>Fashion<\/h4>\n<p>The fashion industry has great opportunities in the metaverses. In fact, some fashion giants have already taken their first steps in these parallel realities. One of the firms that seems to have it clearer is <strong>Nike<\/strong>. The sports fashion firm presented Nikeland last November. A metaverse of its own in the Roblox gaming platform, which allows users to exercise with their avatars through different games, but also to dress their avatars with the clothes and shoes of the popular American brand. Similarly, the German clothing multinational <strong>Adidas<\/strong>, announced just a week ago its alliance with the cryptocurrency exchange Coinbase. In addition to being able to accept payments in crypto, many people believe that the association will bring about the construction of a metaverse of its own (adiVerse), in The Sandbox.<\/p>\n<p>Sports fashion is not the only one that is already experimenting with metaverses. The endless possibilities offered by these virtual worlds have also caught the attention of luxury brands. Last September, <strong>Balenciaga<\/strong> started selling skins in the Fortnite metaverse for $8 each. <strong>Gucci<\/strong> He sold a digital version of his well-known Dionysus bag in the Roblox metaverse for over four thousand dollars, $800 more than the original. <strong>Dolce &amp; Gabbana<\/strong> He sold a collection of NFTs last October, made up of 5 physical designs and 4 digital creations for more than $6 million.<\/p>\n<p>NFTs as digital identity in the metaverse economy<\/p>\n<h4>Car<\/h4>\n<p>Another of the industries that may have the most future in the metaverses is that of the automobile, since the avatars, as in the real world, have to move from one place to another and the distances are long. The National Association for Stock Car Racing (<strong>NASCAR<\/strong>) launched its own NFT market in September, where every week there is a race it launches digital collections. NASCAR also partnered with gaming platform ZED RUN to include several NASCAR-branded NFT-format horses in the game. In other words, in the horse game you can race with NASCAR-branded horses.<\/p>\n<p>In addition, <strong>nissan<\/strong> announced some time ago that an innovative technology that will allow the occupants of the vehicles to connect with the metaverse. Nissan&#8217;s intention is to transmit the data from the avatar to the interior of the vehicle, so that you can communicate interactively with other avatars. Both inside and outside the car. On the other hand, the NVIDIA video game platform partnered with the German car brand <strong>BMW<\/strong> last April, to create an exact replica of its factory in Resensburg, Germany. The objective is to virtually test different options to be applied to the physical factory, if they work.<\/p>\n<h4>real estate<\/h4>\n<p>The Metaverse Property company, in addition to offering plots in the Decentraland, the Sandbox, Somnium, Upland and Cryptovoxels metaverses, also offers leasing, property management, marketing, project development and consulting services. The company has an investment project, called REIT, where it reports the creation of the first virtual real estate investment trust on the aforementioned metaverses. Metaverse Property last week bought 116 lots of virtual land in the district <i>Fashion Street Estate,<\/i> from Decentraland, for 618,000 MANA. At the close of the purchase, the MANA tokens were worth $2.4 million.<\/p>\n<p>MANA, the token of the Decentraland metaverse, reaches its maximum price<\/p>\n<h4>consumer companies<\/h4>\n<p>Metaverses and NFTs are also being widely used as a marketing strategy in different consumer companies. The clearest example is <strong>Coca Cola<\/strong>. The American beverage multinational launched its own collection of NFTs with an avatar party on the roof of a building in the Decentraland metaverse. Thus, thanks to that party, Coca-Cola transferred a good part of its iconography to this metaverse, being one of the pioneers of meta-advertising. Likewise, other beverage companies such as Bacardi and Budweiser have also launched NFT collections. Currently, it is rumored that the Budweiser brewery also wants to create its own metaverse.<\/p>\n<p>What is it and how to enter the Decentraland metaverse for the first time?<\/p>\n<h4>Leisure<\/h4>\n<p>Just like in real life, avatars also have the option to go to a nightclub to socialize in the virtual worlds. <strong>Amnesia Ibiza<\/strong>, one of the best-known nightclubs in the world, held a big party on October 9 to mark the opening of its first completely virtual nightclub in the Decentraland metaverse. Like many other leisure spaces, the Amnesia nightclub was forced to close its doors as a result of Covid-19. The owners of this iconic nightclub see the metaverse as the future of virtual relationships. Within this space, avatars can listen to the songs of the best musical artists and DJs in the world.<\/p>\n<h4>Media<\/h4>\n<p>Blockchain Observatory opened its headquarters in the metaverse last November, with the inauguration of a laboratory to investigate the opportunities that these virtual realities offer to the media. Observatory will offer its information and videos in NFT format and will also experiment with subscriptions to special content through the use of NFTs. Our journal is located on the third floor that Vicox Legal purchased in the Decentraland metaverse.<\/p>\n<p>Vicox and Blockchain Observatory come together to bring the metaverse closer to companies<\/p>\n<p>South China Morning Post (SCMP) announced last July a partnership with The Sandbox metaverse. In addition to introducing the reader to the new technologies provided by the metaverses, SCMP announced the launch of a collection of NFTs inspired by its library of photographs, visual illustrations, data visualizations, and infographics. The South China Morning is the leading newspaper in Hong Kong and is owned by the Alibaba Group.<\/p>\n<h4>art and auctions<\/h4>\n<p>Although the list of companies in the metaverses does not stop growing, at the moment, it is the art industry that has been experimenting with the metaverses\/NFTs binomial for the longest time. <strong>Shoteby´s<\/strong>, the world&#8217;s oldest auction house, opened a digital replica of its London gallery in the Decentraland metaverse last June to auction off its works digitally. Shotheby&#8217;s has gone even further and last November it opened its own NFT marketplace and its own metaverse.<\/p>\n<h2 class=\"screen-reader-text\">post navigation<\/h2>\n","protected":false},"excerpt":{"rendered":"<p>The list of companies that are in the metaverses grows day by day. It is believed that the metaverse built on the blockchain may become the successor to the current internet. Therefore, more and more companies compete with each other to get the best sites in these parallel realities. Little by little, the metaverses are [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":491,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/489"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=489"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/489\/revisions"}],"predecessor-version":[{"id":602,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/489\/revisions\/602"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/491"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=489"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=489"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=489"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}