{"id":500,"date":"2022-05-15T18:21:42","date_gmt":"2022-05-15T18:21:42","guid":{"rendered":"https:\/\/infobloom.site\/invest-in-amazon-do-not-fall-into-this-scam\/"},"modified":"2022-05-15T18:21:42","modified_gmt":"2022-05-15T18:21:42","slug":"invest-in-amazon-do-not-fall-into-this-scam","status":"publish","type":"post","link":"https:\/\/infobloom.site\/invest-in-amazon-do-not-fall-into-this-scam\/","title":{"rendered":"INVEST IN AMAZON &#8211; DO NOT FALL INTO THIS SCAM"},"content":{"rendered":"<p>There is a scam currently on the internet, which has been talked about in recent months, and it has to do with investing in Amazon.<\/p>\n<p>In this post, we will talk about what is a scam and what is NOT a scam when it comes to investing.<\/p>\n<p>To begin with, we will define what “Invest” is.<\/p>\n<p>Invest: To use money or time to obtain something in the future.<\/p>\n<p>With this in mind, there are 2 ways you can &#8220;invest&#8221; in Amazon to get more money in the future:<\/p>\n<h2>Invest in Amazon by becoming a partner who sells products on their Marketplace.<\/h2>\n<p>One is through an Amazon program called &#8220;Amazon FBA,&#8221; where you buy or make products and ship them to Amazon warehouses.  Amazon then takes care of distributing those products every time you make a sale on the platform.<\/p>\n<p>For this service, Amazon will charge you a commission or fixed fee.  This is an option that, although it sounds simple (and it is, when you already have the business running), in practice it does not come to be, since you may not have sales, or the competition may be very tough between sellers if they sell. the same products as you.<\/p>\n<p>This service is gradually beginning to reach Mexico and Latin America, promoted by sales &#8220;gurus&#8221;, who most of the time make more money selling these services than their clients.<\/p>\n<p>In the United States, there is a variant of FBA called &#8220;Amazon Automation&#8221;, which is a service that we emphasize <strong>Does NOT Offer Amazon, <\/strong>but they are companies dedicated to creating stores that sell the products for you on the platform.<\/p>\n<p>That is, you are paying someone to make a store, find products and manage it for you.  This is not cheap, and it does not give good returns in many cases.<\/p>\n<p>As we said, this has not yet arrived in Latin America but it will most likely not be long in coming, so it is best that you DO NOT buy this type of courses and services.<\/p>\n<h2>Invest in Amazon, buying shares of the company.<\/h2>\n<p>The second way to invest in Amazon is to buy shares of the company.  A share is a “part of the company”.  These can be worth hundreds or thousands, and by having one you would be forming what is known as being a shareholder of the company.<\/p>\n<p>This does not mean that you can go to an Amazon warehouse or its offices, have preferential treatment despite being &#8220;owner of Amazon&#8221; in quotes, since that share you have is a very small part of the entire company.  Now, the more shares you have, the more you would own as such.<\/p>\n<p>Surely you are wondering, then if Amazon shares do not serve me to make company decisions, what can I use them for?<\/p>\n<p>What we can do with stocks is not only buy them, we can also sell them!  The idea is to buy a share at X price, and in the future be able to sell it at a price <strong>more expensive than the one you bought it from.<\/strong><\/p>\n<h2>What is the scam?<\/h2>\n<p>The scam arises since the shares cannot be bought anywhere.<strong> Amazon shares are only traded on the Stock Exchange.<\/strong>.  The most accessible way to invest in the stock market for ordinary people is through brokers, who are intermediaries between you and the stock market.<\/p>\n<p>These brokers are regulated by the authorities or governments of your city\/country.<\/p>\n<p>And here is the scam, the ads that you normally see on YouTube or in banners are companies that are not often regulated brokers, or that are not regulated by the authorities of your country, or a recognized country.  What these fraud companies do is sell you something called CFDS, and NOT shares.<\/p>\n<p>One way to identify scams is by looking at the value of Amazon shares, where a share is currently valued at over $3,000 USD, while these ads offer you to buy an Amazon share for less than $200 USD. <\/p>\n<p>You can check our express guide on how to invest safely in Amazon here<\/p>\n<p>The real value of an Amazon share today<\/p>\n<h2>Are there other ways to invest in Amazon?<\/h2>\n<p>If there are ways to invest in Amazon indirectly with less money, for example through ETFs, which are like a basket in which several people invest, and in the basket are the shares of Amazon and other companies.  We emphasize other companies.  Do not think that you will only be buying Amazon<\/p>\n<p>If you don&#8217;t know what ETFs are and how they work, we leave you a video so you can understand it easily:<\/p>\n<p>\n<iframe title=\"¿QUE ES UN ETF? - EXPLICADO PARA PRINCIPIANTES\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/RYWDytWR4No?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>\n<\/p>\n<h2><strong>So, is it safe to invest in Amazon shares if I buy with a regulated broker? <\/strong><\/h2>\n<p>That depends on what you consider safe.  If for sure you understand that you are buying legitimate shares, then <strong>YES<\/strong> It is safe.  However, stocks on the stock market go up and down in price, something you should be aware of. <strong>NOT<\/strong> It is an option that assures you that you will get more money, since by investing in the stock market you are risking your money.  This is not bad, just something you should keep in mind when investing in the stock market.  Stocks are instruments that can go up or down in price, so if your expectation is to always win, <strong>Is not safe<\/strong>. <\/p>\n<p>In Amazon&#8217;s case, the stock has performed terribly so far.  Many people have made a lot of money in the past, but again, this is no guarantee that it will remain true in the future and <strong>your<\/strong> you&#8217;re going to make a lot of money.  Only invest in individual stocks like Amazon when you know the risks of investing in stocks.<\/p>\n<p>Here is a video that summarizes and deepens this article. <\/p>\n<p>\n<iframe title=\"La ESTAFA de invertir en Amazon EXPLICADA - NO CAIGAS\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/BjykEware6I?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<p>There is a scam currently on the internet, which has been talked about in recent months, and it has to do with investing in Amazon. In this post, we will talk about what is a scam and what is NOT a scam when it comes to investing. To begin with, we will define what “Invest” [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":502,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/500"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=500"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/500\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/502"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=500"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=500"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=500"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}