{"id":505,"date":"2022-05-16T10:42:24","date_gmt":"2022-05-16T10:42:24","guid":{"rendered":"https:\/\/infobloom.site\/the-6-most-common-frauds-in-cdmx-how-they-can-steal-up-to-100-thousand-dollars\/"},"modified":"2022-05-18T11:31:15","modified_gmt":"2022-05-18T11:31:15","slug":"the-6-most-common-frauds-in-cdmx-how-they-can-steal-up-to-100-thousand-dollars","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-6-most-common-frauds-in-cdmx-how-they-can-steal-up-to-100-thousand-dollars\/","title":{"rendered":"The 6 most common frauds in CDMX… how they can steal up to 100 thousand dollars"},"content":{"rendered":"<p>Martin received a call. The person on the other end of the line told him that he communicated from the offices of <strong>master card<\/strong> to notify you that you had a <strong>electronic purse with 12 thousand accumulated points.<\/strong> So, I could offer you that in exchange for depositing a certain amount of money, these points could be exchanged for a<strong> travel membership.<\/strong><\/p>\n<p>The customer thought it was a great deal and obviously <strong>gave the requested payment,<\/strong> In addition to signing a contract. However, everything was false, after a while they stopped answering the phone. His case would be listed as one of the many<strong> scams<\/strong> of which are <strong>victims the capitals.<\/strong><\/p>\n<p>Although there are hundreds of types of fraud, whether through phone calls or Internet pages, the authorities have detected at least the six most common in the <strong>Mexico City.<\/strong><\/p>\n<p>These scams are related to: the offer of products cheaper than their original price in the market; a necessary payment to “save” a family member or employer who is in trouble; cover a certain amount of taxes to receive gifts or a package from another country, and also, with doing a monetary favor to a person with whom you have a long-distance love relationship.<\/p>\n<p>The profits scammers make from these types of hookups vary, but the <strong>Citizen Security Council of Mexico City and the Secretariat of Citizen Security (SSC) <\/strong>have detected ranging from<strong> 3 thousand pesos up to 100 thousand dollars<\/strong>depending on the type of scam and how long the victim continues to deposit money.<\/p>\n<p>“In reality, fraud is as infinite as the imagination of these people; new frauds always occur in the elite, they are more sophisticated, there is more intelligence work, investigation that they do. They apply certain modalities, they usually apply it in the financial world and some of those people who have to do with real estate or nearby property damage, liquid money that is at home, watches, jewelry, etc. Involve to remove them from the legal property of the victim. There are many types of fraud, perhaps a thousand,” Salvador Guerrero Chiprés, president of the Citizen Council, explained in an interview.<\/p>\n<p>Recently, this agency announced that from January 2018 to March 2019, 9,374 reports were registered on its hotline. The most denounced is the “Prize Winner” fraud with 3,648 complaints, which consists of “one being known as a prize winner, the victim receives a call or a message. They tell him that he is an award winner. They obfuscate him with the story that he is privileged by luck and the universe and he begins to get wrapped up in that story to the point where he ends up depositing money at a convenience store or somewhere else, and there may be one, two, or three deposits until who ends up understanding that this can only be a farce”, says Guerrero Chiprés.<\/p>\n<p>Next, the second most common is “Relative coming to visit”. This has a total of 2 thousand 111 reports in the same period. Specifically in this scam, a person is led to believe that his distant relative, perhaps living in the United States, will visit him in Mexico City, but needs money to complete the journey or a loan.<br \/>\n<br \/>\nPhotography: DIEGO SIMÓN SÁNCHEZ\/ EL UNIVERSAL<\/p>\n<p>In third place, by incidence, is the &#8220;Sale and Purchase on the Internet&#8221; scam with 1,555 complaints. In these cases, all kinds of products that are usually expensive in the market are offered at low prices. For example, a suit, a car or even a house. So, when a person calls the number that appears on a certain website, they are asked for a deposit to set aside said product, since it is coveted and the only one in existence.<\/p>\n<p>In fourth place, with 1,166 complaints, is the “injured, injured or detained person” scam, which consists of criminals making phone calls claiming that they are a figure of authority or that they have some power to help that family member who supposedly was present in a crash, or committed a foul and will be detained.<\/p>\n<p>In fifth position is the &#8220;Employer in trouble&#8221;, also known as &#8220;La Patrona&#8221;, the same fraud that was recently disclosed by the Citizen Council, since according to their complaint line, they have 846 reports.<\/p>\n<p>In this case, repetitive calls are made to the domestic workers to obtain information and personal data of the inhabitants of said house.<\/p>\n<p>Then, the criminals pose as authorities such as Public Ministries, Treasury officials; or lawyers and accountants to make the victim believe that their employer has a problem. Then they manipulate them so that they do not give notice to the &#8220;bosses&#8221; and also, look in the chamber for a &#8220;yellow envelope&#8221; that contains valuables, or a safe.<\/p>\n<p>When the maids have such belongings, they are persuaded to put everything in a black bag for delivery.<\/p>\n<p>To commit fraud, alerts the president of the Citizen Council, there is a prior investigation of the victim that is done through social networks, telephone calls, or data collection in the areas where they are usually found: “In all cases there is a part of survey, research, review of your networks, face-to-face knowledge of where you live. In all cases there is a set of elements of familiarity of information that make a story believable”.<\/p>\n<p><img style=\"width: 567px; height: 349px;\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652697744_593_The-6-most-common-frauds-in-CDMX…-how-they-can.jpg\" alt=\"frauds_cdmx_0.jpg\" \/><br \/>\nPhotography: DIEGO SIMÓN SÁNCHEZ\/ EL UNIVERSAL<\/p>\n<p>Another type of scam that the Citizen Security Secretariat has detected is that of the “Marine or military hitch”, as explained by Édgar Martínez, from the Cyber ​​Police.<\/p>\n<p>Specifically in this type of scam, men and women over 40 or older adults who are divorced or widowed are victims. Here, the first contact is usually made through the Tinder mobile application and later, when there is trust, it is transferred to text messages, WhatsApp or Messenger of the Facebook social network.<\/p>\n<p>The modus operandi is to make the victim believe that she has a sentimental relationship with a United States soldier or marine and that he, in love, decides to leave everything in his country to move to Mexico. In that move, the alleged couple sends a luggage with gifts, cash that the victim must collect. At that point, he makes up the story that said suitcase got stranded due to improperly made tax payments.<\/p>\n<p><img style=\"width: 566px; height: 720px;\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/The-6-most-common-frauds-in-CDMX…-how-they-can.gif\" alt=\"numeralia complaint\" \/><\/p>\n<p>Guerrero Chiprés issues three recommendations to avoid being a victim of fraud: “everything that is too easy, cheap, is false; everything that is an emergency in which I cannot verify the veracity of the information, or its objectivity, is fraud; In all cases I have to train as a citizen because it is impossible for there to be a police officer and a public prosecutor for each case”.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Martin received a call. The person on the other end of the line told him that he communicated from the offices of master card to notify you that you had a electronic purse with 12 thousand accumulated points. So, I could offer you that in exchange for depositing a certain amount of money, these points [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":509,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/505"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=505"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/505\/revisions"}],"predecessor-version":[{"id":582,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/505\/revisions\/582"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/509"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=505"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=505"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=505"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}