{"id":525,"date":"2022-05-17T11:14:09","date_gmt":"2022-05-17T11:14:09","guid":{"rendered":"https:\/\/infobloom.site\/are-nfts-a-bubble-assw-2019\/"},"modified":"2022-05-17T11:14:09","modified_gmt":"2022-05-17T11:14:09","slug":"are-nfts-a-bubble-assw-2019","status":"publish","type":"post","link":"https:\/\/infobloom.site\/are-nfts-a-bubble-assw-2019\/","title":{"rendered":"Are NFTs a bubble?  – ASSW 2019"},"content":{"rendered":"<p>American comedian and actor Robin Williams once said that cocaine was &#8220;God&#8217;s way of telling you that you&#8217;re making too much money.&#8221;  Right now that role may have been superseded by non-fungible tokens, or NFTs.<\/p>\n<p>NFTs are a way to claim sole ownership of digital assets using blockchain technology.  Unlike physical objects, such as duplicate keys in Barcelona, ​​these can be easily copied by anyone, even without being the owner.<\/p>\n<p>The latest NFT-based craze involves paying a large amount of money for each of 10,000 avatars called “Bored Apes”.  These are just that, drawings of monkeys that seem to be bored.<\/p>\n<p><\/p>\n<h2>Eminem already has his boring monkey<\/h2>\n<p>Last month, rapper Eminem (real name Marshall Mathers) paid around €400,000 in Ethereum cryptocurrency to purchase Bored Ape&#8217;s number 9055.  This jumpsuit was already called EminApe because the khaki and gold chain resembles Eminem&#8217;s outfit<\/p>\n<p>This NFT is said to join 160 other NFTs in Eminem&#8217;s collection.  The characters in Bored Ape seem to come from the drawings of Jamie Hewlett, the artist who created Tank Girl and the virtual group Gorillaz.<\/p>\n<p>According to its creators, each variation is generated from more than 170 possible traits, including facial expressions, head hair, and clothing.  Each monkey is unique, but some are rarer than others.<\/p>\n<h2>What does it mean to own an NFT?<\/h2>\n<p>So what does Eminem own now?  You have an electronic version of the image you use for your Twitter profile.  But so can anyone who copies images from the Internet.  The only difference is that you have a record in the blockchain that shows you bought it.<\/p>\n<p>You can also become a member of a members-only online space called &#8220;Bored Monkeys Yacht Club,&#8221; whose benefits and purpose, beyond being a marketing gimmick, are unclear.<\/p>\n<p>That&#8217;s all, right?  Intellectual property (as is) belongs to the creator.  You are not entitled to a portion of the merchandise revenue generated by this character.<\/p>\n<h2>NFTs as a speculative product<\/h2>\n<p>So the only way Eminem can cash in on the character he&#8217;s bought is if he finds &#8220;another chump&#8221; who&#8217;s willing to pay even more for the NFT.  The chances of that happening are slim.<\/p>\n<p>Although the publicity of the rapper&#8217;s purchase has increased demand, the average price paid for a Bored Ape NFT, by 2022, is about 83 Ether (currently about 250,000 euros).<\/p>\n<p>Eminem may have been willing to pay more for NFTs that are more like him, but what about the rest of us?<\/p>\n<h2>NFTs and the irrational exuberance of the markets<\/h2>\n<p>NFTs are often bought on a speculative basis.  The market is based on being able to prove the unique property of it.  Something that is only really important if you have bragging rights, and the prospect of selling your NFTs in the future.<\/p>\n<p>Eminem&#8217;s monstrous payments, in particular, lend credence to the idea that these NFTs have some value.  However, he is not the only celebrity who has helped draw attention to Bored Ape&#8217;s NFTs.<\/p>\n<p>Basketball players Shaquille O&#8217;Neal and Stephen Curry, billionaire Mark Cuban, electronic music DJ Steve Aoki, YouTuber Logan Paul and TV host Jimmy Fallon have also joined the trend.<\/p>\n<p>These purchases have worked effectively in the form of celebrity endorsements, a proven marketing tactic.  It is a graphic example of the power of media culture to fuel &#8220;irrational exuberance&#8221; in financial markets.  And we already know how this ends.<\/p>\n<h2 class=\"screen-reader-text\">post navigation<\/h2>\n","protected":false},"excerpt":{"rendered":"<p>American comedian and actor Robin Williams once said that cocaine was &#8220;God&#8217;s way of telling you that you&#8217;re making too much money.&#8221; Right now that role may have been superseded by non-fungible tokens, or NFTs. NFTs are a way to claim sole ownership of digital assets using blockchain technology. Unlike physical objects, such as duplicate [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":526,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/525"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=525"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/525\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/526"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=525"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=525"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=525"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}