{"id":529,"date":"2022-05-17T17:04:54","date_gmt":"2022-05-17T17:04:54","guid":{"rendered":"https:\/\/infobloom.site\/2013-energy-reform-was-a-scam-for-mexicans-cfe\/"},"modified":"2022-05-17T17:04:54","modified_gmt":"2022-05-17T17:04:54","slug":"2013-energy-reform-was-a-scam-for-mexicans-cfe","status":"publish","type":"post","link":"https:\/\/infobloom.site\/2013-energy-reform-was-a-scam-for-mexicans-cfe\/","title":{"rendered":"2013 energy reform was a scam for Mexicans: CFE"},"content":{"rendered":"<p>            <\/p>\n<p>The 2013 constitutional reform in energy matters was a scam and a deception towards Mexicans since it promised a series of benefits for the Federal Electricity Commission (CFE), for the National Electric System (SEN) and for society in general, but none were met, said Rubén Cuevas Plancarte, CFE&#8217;s Director of Administration, during a series of briefings with workers.<\/p>\n<p>Cuevas Plancarte compared the supposed benefits announced to promote the current legislation with what actually happens in the current one.  He said that one of the objectives was to reduce the costs of electricity service for the benefit of the population and the industry, but unlimited economic benefits are only granted to the private sector with minimum and preferential rates.<\/p>\n<p>“Another objective was to regulate the development of the sector and impose interconnection obligations and transparent porter fees on the participants.  What is the reality?  private energy generating companies do not pay the real cost of using the CFE transmission network, nor do they pay support for intermittent energies”, he stated.<\/p>\n<p>In 2013 it was also mentioned that the State would not lose control of the electrical system, however, the National Center for Energy Control (CENACE) only dispatches between 38 and 39% of the electricity of the CFE and under this scheme , the private sector would have control of the electricity market in a few years and would impose its own rates.  &#8220;The trend is that the CFE would disappear,&#8221; he said.<\/p>\n<p>“It was also commented that an efficient electrical dispatch of the energy generated by the power plants would be guaranteed, under principles of efficiency and impartiality, but in reality, CENACE preferably dispatches the energy generated by private companies, without considering the real costs of the generation,&#8221; he said.<\/p>\n<p>Another supposed objective of the 2013 reform was to ensure the reliability, quality, continuity, sustainability and efficiency of the electricity supply, but currently there are cases such as that of February 2021 in which, due to the rise in fuel prices, private generators turned off its plants and the CFE had to come to the rescue to meet all the energy demand.  That crisis cost the CFE 75 billion pesos.<\/p>\n<p>Cuevas Plancarte said that it was also promised that there would be an interconnection process that would increase transparency and efficiency in granting access to the transmission network.  However, the Energy Regulatory Commission (CRE) granted generation permits indiscriminately, without considering the stability of the SEN, so there is currently an excess of permits and an oversupply of electricity.<\/p>\n<p>The 2013 energy reform proposed the creation of a competitive market, which would place the CFE in a position to compete and would give it incentives to make its own processes more efficient, but unfair companies were created, such as self-supply companies that cover up fraud to the law and possible tax evasion by reporting as partners those who are actually clients.<\/p>\n<p>The director emphasized that the CFE has been affected in its finances by absorbing part of the generation and transmission costs of the private companies, in addition to the fact that the energy not dispatched, due to the restrictions imposed, also generates a loss for the national company.<\/p>\n<p>Cuevas Plancarte stressed that, unlike the 2013 reform, the current Constitutional Reform Initiative on Energy Matters, promoted by the President of the Republic, will not be carried out &#8220;in the dark&#8221; and for this reason the informative meetings are held in the that the details of the proposal are presented to the workers.<\/p>\n<p>During his participation in the informative meeting on November 4, Miguel Alejandro López López, Deputy Director of Contracting and Services, stressed that the CFE has sufficient capacity to supply 85% of the energy that the country needs, however, the restrictions imposed current dispatch rules limit it to providing only 39% of the electricity consumed in Mexico.<\/p>\n<p>Addressing the issue of self-supply companies, López López said that this figure is used to cover up fraud against the law and possible tax evasion by reporting as partners those who are actually clients.  He explained that, if they were partners, each of the participants would benefit from dividends, which does not happen, since what you really have is a commercial relationship.  In addition, he pointed out that the current law grants self-supply companies subsidies in the transport of energy and priority in dispatch, which provides them with additional advantages.  However, he recalled that in the energy crisis last February, the generating plants of the self-supply companies stopped producing electricity due to the rise in fuel prices, but their clients continued with their electricity consumption and it was the CFE who came to their rescue.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The 2013 constitutional reform in energy matters was a scam and a deception towards Mexicans since it promised a series of benefits for the Federal Electricity Commission (CFE), for the National Electric System (SEN) and for society in general, but none were met, said Rubén Cuevas Plancarte, CFE&#8217;s Director of Administration, during a series of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":530,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/529"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=529"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/529\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/530"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=529"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=529"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=529"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}