{"id":585,"date":"2022-05-18T11:40:50","date_gmt":"2022-05-18T11:40:50","guid":{"rendered":"https:\/\/infobloom.site\/scams-victim-of-the-international-parcel-modality-services-justice\/"},"modified":"2022-05-18T11:50:59","modified_gmt":"2022-05-18T11:50:59","slug":"scams-victim-of-the-international-parcel-modality-services-justice","status":"publish","type":"post","link":"https:\/\/infobloom.site\/scams-victim-of-the-international-parcel-modality-services-justice\/","title":{"rendered":"Scams: victim of the international parcel modality"},"content":{"rendered":"<p id=\"p497036-m472-471-473\" class=\"contenido\">In the midst of compulsory isolation, the use of new technologies and social networks has made the passing of days more bearable because you are in permanent contact with family, friends and work activities.<\/p>\n<p>Parallel to this, criminals have turned their illicit actions towards social networks and platforms that offer different services. Thus, <b>Reports of bank fraud and fraud have increased, the latter in various forms.<\/b><\/p>\n<p id=\"p497036-m516-2-517\" class=\"contenido\">Andrés is 30 years old, is a journalist, lives in Bogotá and although on many occasions he has heard of cases of scams through social networks, he was one of those who thought that “<b>That can never happen to me.&#8221;<\/b><\/p>\n<p>But it happened to him. On Wednesday, May 13, a cousin who lives in the United States contacted him through a well-known social network and confirmed that she was returning to Colombia.<\/p>\n<p>“My so-called cousin gave me confidence because she wrote to me about her husband and son with their own name, and <b>He described to me that although they had done well in New York, they wanted to return because of the shock caused by the pandemic<\/b>”, Andrew narrated.<\/p>\n<p>(You may be interested in reading: <b>Computer theft: &#8216;With a single call they stole my savings&#8217;<\/b>).<\/p>\n<p>The young man points out that the conversation (on the platform) lasted for several minutes and then he asked for his cell phone number, he wanted to verify that it was the same one he had because he wanted to ask him for a favor.<\/p>\n<p id=\"m572-571-573\" class=\"mensaje\">Words more, words less, they asked me to pay an income tax on the merchandise, the figure of $ 2,300,000.<\/p>\n<p id=\"p497036-m591-5-592\" class=\"contenido\">Andrés gave him his number and a few minutes later he was contacted by WhatsApp. The profile photo was of his cousin, which for obvious reasons left him calm and in a state of total confidence.<\/p>\n<p>“To summarize, my so-called cousin <b>He asked me to receive a package that would arrive in Bogotá by air the next day.<\/b>. He had basically sent technology equipment and some gifts for the family. I told him that I would gladly collaborate with him. Finally he asked me for my identity card number, ”said Andrés.<\/p>\n<p>The young man relates that on Thursday, May 14, in the morning, he was contacted by the supposed parcel company: “<b>words more, words less, they asked me to pay an income tax on the merchandise, the figure $2,300,000<\/b>. I told them that the parcel was not mine and that I did not have that money.”<\/p>\n<p>(We recommend you read: Buying a puppy in quarantine ended in scam and impersonation)<\/p>\n<p>The official of the supposed company tells Andrés that if he does not pay the tax, the international parcel will be returned. To give him credibility, they sent him documents with Dian logos that supported the need to pay the tax.<\/p>\n<p id=\"m609-1-610\" class=\"titulo\">It is the image of the false document sent to the victim of fraud under the form of false entrustment.<\/p>\n<p id=\"p497036-m623-7-624\" class=\"contenido\">Immediately, Andrés contacted his cousin via WhatsApp, who<b> asked him to lend him the money, because he cannot lose the investment<\/b>and that he ran the risk that the parcel would be lost.<\/p>\n<p>“He sounded so convincing and, of course, he used familiar facts or activities to give me confidence that I agreed to lend him the money. The company had left me some consignment information. <b>I went out and did the turn and ended the chapter. I was waiting for the delivery of the order<\/b>Andrew pointed out.<\/p>\n<p>The young man assured that that same day, in the afternoon, an alleged Dian official called him to report that the scanner had detected a figure, apparently bills, and that he had to report the amount immediately, paying 10 percent of the value,<b>or go to jail immediately for illicit enrichment<\/b>”.<\/p>\n<p>Frightened, the young man immediately communicates with the supposed cousin, who admits that he had sent<b> “hidden” $60,000<\/b> and that for that reason the encomienda could not be lost.<\/p>\n<p>“He told me to pay what they asked for, and that when the package arrived at my house, I would take the money from the same 60,000 dollars,” Andrés recounted.<\/p>\n<p>(You may be interested:<b> <\/b><b>Police warn about scams through the internet by coronavirus<\/b>).<\/p>\n<p>That response was what made him react and realize that he was being the victim of a crime.<\/p>\n<p>He immediately contacted his relatives by phone, who denied sending them such a package. Simultaneously, he or the criminals kept calling him to intimidate him with the alleged crime he was committing.<\/p>\n<p>“I really felt scared, they had my data and they kept calling me even though they had already robbed me. So, <b>I immediately contacted the Police, but this is the date on which I have not been able to file the complaint, because the pages or platforms for that purpose do not work<\/b>Andrew assured.<\/p>\n<p>(Also: Former officials who have been released due to expiration of terms)<\/p>\n<p id=\"m641-1-642\" class=\"titulo\">With false stationery from the Tax and Customs Police they intended to continue fraud.<\/p>\n<p id=\"p497036-m655-9-656\" class=\"contenido\">EL TIEMPO contacted the Police, who pointed out that this type of scam is called &#8220;<b>the false international entrustment<\/b>”. Personal information is tracked, based on millimetric work, from photos, groups, names and activities that are published on social networks.<\/p>\n<p>“These criminals specialize in profiling their victims. P<b>or generally, we make groups of family or friends in the networks; that makes it easy for them to steal personal information, download photos and open accounts and put photos of people<\/b> to ensure that it is who communicates.<\/p>\n<p>That is, they supplant with the information they extract. The serious thing is that by not using the personal information access insurance offered by social networks or platforms, &#8220;we are opening a world of opportunities for criminals,&#8221; said a police investigator.<\/p>\n<p>(In other news: They will identify soldiers who are leaking information to regimes)<\/p>\n<p>He recommended that as soon as a message of this nature is received, the family member be called directly to establish the veracity of the communication, to avoid falling into these networks of scammers.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the midst of compulsory isolation, the use of new technologies and social networks has made the passing of days more bearable because you are in permanent contact with family, friends and work activities. Parallel to this, criminals have turned their illicit actions towards social networks and platforms that offer different services. Thus, Reports of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":587,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/585"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=585"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/585\/revisions"}],"predecessor-version":[{"id":597,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/585\/revisions\/597"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/587"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=585"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=585"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=585"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}