{"id":649,"date":"2022-05-18T13:49:10","date_gmt":"2022-05-18T13:49:10","guid":{"rendered":"https:\/\/infobloom.site\/cositortos-arrest-why-pyramid-schemes-are-an-epidemic-in-argentina\/"},"modified":"2022-05-18T13:49:10","modified_gmt":"2022-05-18T13:49:10","slug":"cositortos-arrest-why-pyramid-schemes-are-an-epidemic-in-argentina","status":"publish","type":"post","link":"https:\/\/infobloom.site\/cositortos-arrest-why-pyramid-schemes-are-an-epidemic-in-argentina\/","title":{"rendered":"Cositorto&#8217;s arrest.  Why pyramid schemes are an epidemic in Argentina"},"content":{"rendered":"<p class=\"com-paragraph   --s\">David Villegas is 46 years old and was a truck driver, a greengrocer and an itinerant vendor of cheeses and sweets.  Leonardo Cositorto, 52 years old, was also a salesman.  In his case, he of books, perfumes, cars and telephone lines.<\/p>\n<p class=\"com-paragraph   --s\">These two men &#8211; loquacious and aggressive, trained to survive with the harsh codes of the street &#8211; were the unusual leaders of the two companies that claim to have revolutionized the finances of Argentines, Ganancias Deportivas and Generación Zoe, but that the Justice investigates for considering them pyramid scams.<\/p>\n<p>Leonardo Cositorto is the leader of Generation Zoe and is on the run<\/p>\n<p class=\"com-paragraph   --s\">Both fell from grace.  Cositorto was arrested today in the Dominican Republic by Interpol personnel and the police of that country and Villegas opened up about the company and now says that he was also scammed, but before they captivated thousands of people who invested their money with the promise fabulous returns.<\/p>\n<p class=\"com-paragraph   --s\">Ganancias Deportivas offered packages that started at about 200 euros and gave a return of 20% per month, also in euros.  They said that they achieved these results because they had discovered a method to earn money in the sports betting market.  Generation Zoe asks for investments from 500 dollars with a monthly return of 7.5%.  Their argument is that they profit from the Stock Market and from cryptocurrency operations.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/Cositortos-arrest-Why-pyramid-schemes-are-an-epidemic-in-Argentina.jpeg\" alt=\"David Villegas promoted Sports Earnings in San Rafael, but now says he was scammed\" width=\"2000\" height=\"1333\" class=\"com-image \"  loading=\"lazy\" importance=\"low\" decoding=\"async\"\/>David Villegas promoted Sports Earnings in San Rafael, but now says he was scammed<\/p>\n<p class=\"com-paragraph   --s\">They are not the only ones.  Adhemar Capital is a company from Catamarca investigated in Tucumán and Córdoba because it could have incurred in a pyramid scheme.  Argentina is experiencing a fever of this type of undertaking.  Mario Villar, prosecutor of the Office of the Attorney for Economic Crime and Money Laundering (Procelac), says that there are ten companies of the kind that have already received a criminal case.  Sebastián Negri, vice president of the National Securities Commission (CNV) points out that the body is investigating 15 and that there are 500 files underway with various complaints and irregularities.<\/p>\n<p class=\"com-paragraph   --s\">What is the reason behind its boom?  Do Argentines have an intrinsic weakness that makes them fall for the promises of financial fabricators?  Specialists explain that it is difficult to measure the real penetration of the phenomenon &#8211; many victims do not appear before the Justice &#8211; and compare it with what happens in other countries.  But the number of complaints makes it clear that we are facing an epidemic of pyramid schemes.<\/p>\n<p>  &#13;<br \/>\n<iframe class=\"pym lntools lntools_generic-como-funciona-generacion-zoe\" id=\"lntools_generic-como-funciona-generacion-zoe\" frameborder=\"0\" width=\"100%\" height=\"800\" scrolling=\"no\" src=\"https:\/\/especialeslntools.lanacion.com.ar\/generic-como-funciona-generacion-zoe\/index.html\"> <\/iframe>  &#13;\n<\/p>\n<p class=\"com-paragraph   --s\">Causes include economic crisis and inflation.  The extensive quarantine decreed as a result of the pandemic decimated the income of most people and, in some cases, encouraged the search for alternative solutions, such as those offered by the Villegas and the Cositortos.  In addition, the inflationary process cuts purchasing power and encourages heterodox saving methods.<\/p>\n<p class=\"com-paragraph   --s\">The little financial education adds to the combo, which is completed with social networks.  These types of scams have always existed, but they used to be limited to the circle of contacts of the promoter and his associates.  WhatsApp messages and Facebook posts went viral in the area of ​​influence.<\/p>\n<p class=\"com-paragraph   --s\">Most of these companies also work with cryptocurrencies, which adds a new level of opacity to their operation.  Its leaders also share a discourse that mixes anarcho-capitalist concepts with a financial self-help manual.<\/p>\n<p class=\"com-paragraph   --s\">From their perspective, the State and the banks are allied to impede the progress of the people and they are the enlightened ones who, with generosity, share the necessary knowledge to shake off the chains of oppression and finally be free, rich and powerful. .  Before their decline, Villegas and Cositorto spoke with the ferocity of Javier Milei, the conviction of a religious pastor in a trance, and the information found in books like Rich Dad, Poor Dad.  For Justice, all that eloquence, however, would hide two more swindlers out of the thousands that have existed throughout history.<\/p>\n<p>&#13;<br \/>\n<iframe class=\"pym lntools lntools_generic-como-funciona-ganancias-deportivas\" id=\"lntools_generic-como-funciona-ganancias-deportivas\" frameborder=\"0\" width=\"100%\" height=\"800\" scrolling=\"no\" src=\"https:\/\/especialeslntools.lanacion.com.ar\/generic-como-funciona-ganancias-deportivas\/index.html\"> <\/iframe>  &#13;\n<\/p>\n<p class=\"com-paragraph   --s\">The scam models are similar and, according to a manual prepared by the CNV, they can be grouped into two basic categories: pyramid schemes and Ponzi schemes.<\/p>\n<p class=\"com-paragraph   --s\">In the pyramid scheme, scammers claim that they can turn a small investment into large profits in a short period of time.  However, the scheme can only grow or reproduce if new participants are continually brought into the program.  It works to the extent that the investor base grows and that is why people are encouraged to get new adherents with agreements that multiply their profits as they enlarge their network.<\/p>\n<p class=\"com-paragraph   --s\">Pyramid scams come crashing down when new members are cut off, leaving the last line of entrants with no chance of getting their money back.  The maneuver is ancient and one of the last incarnations of it was the Loom of Abundance, a feminist version of the same deception.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/Cositortos-arrest-Why-pyramid-schemes-are-an-epidemic-in-Argentina.JPG\" alt=\"Roberto Tapia invested all his savings in Sports Earnings and lost them\" width=\"2500\" height=\"1667\" class=\"com-image \"  loading=\"lazy\" importance=\"low\" decoding=\"async\"\/>Roberto Tapia invested all his savings in Sports Earnings and lost themMarcelo Aguilar<\/p>\n<p class=\"com-paragraph   --s\">In Ponzi schemes, a scammer collects money from new people and uses it to pay back supposed profits from earlier-stage investors, rather than investing or managing the money as promised.  Like pyramid schemes, Ponzi schemes require a constant flow of money to stay afloat.  The difference is that investors in a Ponzi scheme do not usually have to recruit new adherents to get a share of the “profits”.  The scam is named after Charles Ponzi, who in the 1920s convinced thousands of people to invest in a complex scheme involving postage stamps.  Another known Ponzi is the one carried out by Bernie Madoff, in the United States, and Enrique Blaksley, in Argentina.<\/p>\n<p class=\"com-paragraph   --s\">A third type of very current scam is multilevel marketing, which involves direct sales businesses in which a commission is received for the products sold, but also for the products placed by other people that the investor brought into the structure.  “A multi-level marketing company will be a pyramid scheme as long as the real business is not selling products to the final consumer, but rather selling briefcases of products to commercials who will then try to sell them with little success among friends, acquaintances, or house to house”, explains Andrés Gago, research professor at the Di Tella University Business School.<\/p>\n<p>&#13;<br \/>\n<iframe class=\"pym lntools lntools_generic-tipos-de-estafas-basicas\" id=\"lntools_generic-tipos-de-estafas-basicas\" frameborder=\"0\" width=\"100%\" height=\"800\" scrolling=\"no\" src=\"https:\/\/especialeslntools.lanacion.com.ar\/generic-tipos-de-estafas-basicas\/index.html\"> <\/iframe>  &#13;\n<\/p>\n<p class=\"com-paragraph   --s\">Is it just greed, the temptation to earn easy money without working, that pushes many to put money into these schemes?  For Daniel Fridman, a sociologist at the University of Texas at Austin, the answer is no.  “The idea of ​​making a lot of money is there, but it is only one component of the offer.  The promise of integrating a network of people who motivates you and helps you improve is a fundamental part of the appeal that these businesses offer”, explains the author of The Dream of Living Without Working, a book where<strong> <\/strong>explores the world of financial self-help and entrepreneurial fantasies.  For Fridman, some of those who invest just want to get rich, but many others seek to &#8220;build the person they aspire to be&#8221;: free, enterprising and daring.<\/p>\n<p class=\"com-paragraph   --s\">The economist Juan Carlos de Pablo, on the other hand, is more direct.  &#8220;There are people who believe that they are less stupid than others,&#8221; he explains.  But if an investment promises a 7.5% monthly return in dollars, there is no logical explanation.  Raja from there.”  These scams, he says, have been around since the beginning of history.  In 1634, the tulip fever, for example, multiplied the price of bulbs exponentially until its resounding collapse in February 1637.<\/p>\n<p class=\"com-paragraph   --s\">What remains a constant in most fraudulent schemes is their horizontal expansion among groups of acquaintances.  Trust is a central element when summoning new investors and this means that companies usually have very limited geographical or social focuses of expansion.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652881750_552_Cositortos-arrest-Why-pyramid-schemes-are-an-epidemic-in-Argentina.JPG\" alt=\"Leonardo Nastacio denounced Generation Zoe before the Justice\" width=\"2000\" height=\"1333\" class=\"com-image \"  loading=\"lazy\" importance=\"low\" decoding=\"async\"\/>Leonardo Nastacio denounced Generation ZoeSantiago Filipuzzi before the Justice<\/p>\n<p class=\"com-paragraph   --s\">In the case of Ganancias Deportivas, its fury was San Rafael.  The city of Mendoza has about 200,000 inhabitants and, according to the figures handled by Villegas and the Justice, there were more than 40,000 who put money into Sports Earnings.  &#8220;San Rafael is a town,&#8221; confirms Cristian Barceló, a journalist who took the issue to local television.  We all know each other and we are very attentive to how our neighbor is doing.  That&#8217;s how Ganancias Deportivas grew.&#8221;<\/p>\n<p class=\"com-paragraph   --s\">“One tries to enjoy the time it lasts”, a 38-year-old man with hands tanned by his work in construction who had put money to buy a brick machine justified himself in August of last year, in full swing of the company. ecological.<\/p>\n<p class=\"com-paragraph   --s\">For that same time, Roberto Tapia was exultant.  He had invested his dollars, then two trucks and a motorhome and ended up convincing his children and his father to also put up money.  Six months later, Tapia lost everything &#8211; he calculates that 15 million pesos &#8211; and had to reactivate his sound company.  Goodbye to your dreams of living on rents.  “The losses have been tremendous.  Sporting Earnings has screwed everyone up,” he laments.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652881750_896_Cositortos-arrest-Why-pyramid-schemes-are-an-epidemic-in-Argentina.jpg\" alt=\"Javier Giaroli is a prosecutor from San Rafael who investigated Sports Earnings\" width=\"2500\" height=\"1667\" class=\"com-image \"  loading=\"lazy\" importance=\"low\" decoding=\"async\"\/>Javier Giaroli is a San Rafael prosecutor who investigated Sports Earnings Marcelo Aguilar<\/p>\n<p class=\"com-paragraph   --s\">Javier Giaroli is an Instruction Prosecutor in San Rafael and initiated an ex officio investigation that was later stopped due to a competition problem.  From the beginning he warned of the danger involved in the undertaking.  &#8220;Everyone here wants to be the wolf of Wall Street,&#8221; he says.  He has no doubt that Earnings Sports is a fraud.  The prosecutor is convinced that the sports betting argument is false.  There is no investment, he says, the money comes from the new members that each associate gets.<\/p>\n<p class=\"com-paragraph   --s\">Many are aware that the promised returns are not sustainable, but still choose to risk their money.  Juan José Barilaro, a 38-year-old kinesiologist who lives in Lomas de Zamora, always knew that Generación Zoe was going to fall.  The question was when it was going to happen and how much he could earn until then.<\/p>\n<p class=\"com-paragraph   --s\">He started by investing about $10,000 last May in a robot that paid 25, 30, 35, 45, 50 and 55% interest per month for six months and the capital was returned on the seventh.  December arrived and, when it was time to collect, he was tempted by a new Christmas robot that offered three months of 33% interest and the fourth month the capital and re-invested an important sum.  He has invested an amount of money equivalent to three cars.<\/p>\n<p class=\"com-paragraph   --s\">“You get involved to make a difference or capitalize.  Obviously I would like to continue earning money, but it could fall due to the returns it gave.  My initial assumption was that they didn&#8217;t arrive until December, but then I speculated that during the summer nothing would happen because there is not much news.  I work in health, but I like to diversify my savings,” she says.<\/p>\n<p class=\"com-paragraph   --s\">Barilaro would have included other colleagues hard hit financially by the pandemic in these investments, but he believes that there is still a possible way out if the company reorganizes.<\/p>\n<p class=\"com-paragraph   --s\">“Several businesses that are similar before the first attack disappear, but these continue to show their faces.  The coaching training is not bad and they take you on trips.  I understand that they should be regulated, but if the community agrees, I think it can be extended.  You can collaborate to keep it going.&#8221;<\/p>\n<p class=\"com-paragraph   --s\">Leonardo Nastacio, a 21-year-old model from the town of San Martín, doesn&#8217;t have that much faith.  With the sponsorship of Ignacio Trimarco, he has already filed a criminal complaint against those responsible for the firm Generación Zoe for unfulfilled payments.<\/p>\n<p class=\"com-paragraph   --s\">“I entered through a friend from the gym who entered through a barber.  Last December I put 3,000 dollars of mine and 5,000 of my parents.  On January 15, I received the first installment of $5,300.  He had to recover $16,000 in three months, but since February 15 there has been no response.  They told me to wait and the guys who brought me in did not answer me, ”he explains.  Nastacio says that he bears the burden of having made his family invest.  His dad worked as a truck driver and his mom is a seamstress.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>David Villegas is 46 years old and was a truck driver, a greengrocer and an itinerant vendor of cheeses and sweets. Leonardo Cositorto, 52 years old, was also a salesman. In his case, he of books, perfumes, cars and telephone lines. These two men &#8211; loquacious and aggressive, trained to survive with the harsh codes [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":655,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/649"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=649"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/649\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/655"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=649"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=649"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=649"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}