{"id":669,"date":"2022-05-19T09:16:19","date_gmt":"2022-05-19T09:16:19","guid":{"rendered":"https:\/\/infobloom.site\/%e2%97%81-8-examples-of-nfts\/"},"modified":"2022-05-19T09:16:19","modified_gmt":"2022-05-19T09:16:19","slug":"%e2%97%81-8-examples-of-nfts","status":"publish","type":"post","link":"https:\/\/infobloom.site\/%e2%97%81-8-examples-of-nfts\/","title":{"rendered":"◁ 8 Examples of NFTs"},"content":{"rendered":"<p>The world of art, culture and the value that people give to goods is changing.  We see a clear example in the boom of <u><strong>cryptocurrencies<\/strong><\/u>, the well-known digital currencies.  NFTs have recently been added to this new way of understanding technology, the so-called <strong>“collecting of the future”, <\/strong>Although they have existed for years, it is one of the main current trends in the business and entrepreneurship world.<\/p>\n<h2><strong>What does NFT mean?<\/strong><\/h2>\n<p>The NFTs is the acronym for non-fungible token (“non-fungible tokens”):<\/p>\n<ul>\n<li><strong>token,<\/strong> because it refers to a digital good;<\/li>\n<li>Y <strong>non-expendable<\/strong> it means that it is unique, indivisible, permanent and irreplaceable.  It is important to know that no two are the same and their ownership is easily demonstrable, which is why many people give these pieces enormous value.<\/li>\n<\/ul>\n<p>NFTs are basically<strong> unique and unrepeatable digital items\/assets<\/strong> generated through technology <strong>blockchain<\/strong>, the same one that operates in the world of cryptocurrencies.  What really shakes up the world of digital art is the ability to buy and sell these types of unique digital files shielded under the umbrella of digital property.  To exemplify its concept a bit, we could say that NFTs are the digital version of stamps, art, letters, a drawing or even a tweet.  Thanks to blockchain technology, in addition to providing reliable security, it is possible to certify that a person is <strong>owner of this “digital asset”.<\/strong><\/p>\n<h2><strong>Real examples of selling NFTs<\/strong><\/h2>\n<p>Do you know Logan Paul?  He is an American boxer, actor, influencer and well-known youtuber who released 3,000 NFTs of Pokemon cards for sale a few months ago.  In a matter of days he ended up selling all the assets for approximately 5 million euros.  Thus, any fan or collector who buys one of these NFTs will be able to say that <strong>he is the only person in the world who owns<\/strong>for example, letter number 490. What is interesting lies in the value that this NFT has in the future, because in 2021 these digital assets that Logan Paul took out could be worth 2,000 dollars, but in 2030 their value could rise to 30,000.<\/p>\n<p>For him <strong>business and entrepreneurship world<\/strong>Just as gold or ancient works of art have been given value for thousands of years, in the midst of 2021 a new path has been opened by conceiving value for intangible digital elements that we can see but not touch.<\/p>\n<p>Another real example of NFT is the <strong>artwork CROSSROAD by digital artist Beeple, <\/strong>which was sold for around 6.6 million dollars.  As in the world of cryptocurrencies, NFTs work as something speculative, since you can buy an NFT simply because you believe that in a few years that digital work will be worth much more than it is now.  Beeple himself defined NFTs with a very clear example: you can take a picture of the Mona Lisa, but that does not mean that you are the only certified owner of the Mona Lisa.<\/p>\n<p>As Mark Cuban, an important and well-known American investor and businessman, says;  “Art is art.  It has always been available in almost unlimited forms.<\/p>\n<h2>More examples of NFTs<\/h2>\n<ul>\n<li><strong>The first tweet in history<\/strong>which was auctioned by Jach Dorsey, CEO and founder of Twitter, for the equivalent of $2,915,835.47 in Ethereum.<\/li>\n<li><strong>A flying cat meme: <\/strong>It is a graphic composed of 8 bits in which a cat is observed flying that leaves a rainbow as a shadow.  It was sold for $590,000.<\/li>\n<li><strong>virtual furniture<\/strong>: The designer Andrés Reisinger has managed to sell up to 10 virtual pieces of furniture for 400,000 euros in an online auction.<\/li>\n<li><strong>Time covers:<\/strong> Different covers of the legendary publication Time have been auctioned, including the first one that was published in 1966.<\/li>\n<li>the horror anthology <strong>Killroy Was Here<\/strong> by filmmaker Kevin Smith, currently on sale.<\/li>\n<li>Companies like <strong>McDonalds or Coke<\/strong> have joined this trend and have auctioned different NFTs. <\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>The world of art, culture and the value that people give to goods is changing. We see a clear example in the boom of cryptocurrencies, the well-known digital currencies. NFTs have recently been added to this new way of understanding technology, the so-called “collecting of the future”, Although they have existed for years, it is [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":670,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/669"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=669"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/669\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/670"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=669"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=669"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=669"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}