{"id":677,"date":"2022-05-19T11:09:12","date_gmt":"2022-05-19T11:09:12","guid":{"rendered":"https:\/\/infobloom.site\/nfts-are-an-excellent-way-to-launder-money\/"},"modified":"2022-05-19T11:09:12","modified_gmt":"2022-05-19T11:09:12","slug":"nfts-are-an-excellent-way-to-launder-money","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nfts-are-an-excellent-way-to-launder-money\/","title":{"rendered":"NFTs are an excellent way to launder money"},"content":{"rendered":"<\/p>\n<p><\/p>\n<p>That image you see is CryptoPunk #9998 and <strong>It is the most expensive work of art in history.<\/strong> (above Da Vinci&#8217;s Salvator Mundi which cost 450 million).  It sold last week for $532 million to an anonymous buyer and is currently listed for more than $1 billion.  The image is part of the collection of 10,000 NFTs in the series that launched in June 2017 as one of the first non-fungible tokens on the Ethereum blockchain.  The project was developed by the American studio Larva Labs, a two-person team consisting of Canadian software developers Matt Hall and John Watkinson.<\/p>\n<p>A similar one was recently sold for almost 11 million dollars and the buyer was Shalom McKenzie, businessman and largest shareholder of DraftKings, an online betting operator, whose fortune reaches hundreds of millions of dollars.<\/p>\n<p>NFT sales went from $13.7 million in the first half of 2020 to $2.5 billion in sales in the first half of 2021. I don&#8217;t know about you, but this all seems very strange to me.<\/p>\n<p><strong>What is an NFT?<\/strong><\/p>\n<p>NFTs are defined as non-fungible tokens, but are best explained as digital-only assets, and are often represented by works of digital art (images, gifs, videos, in-game assets), some of which have been sold for huge sums of money. money, such as Beeple&#8217;s &#8216;Opus&#8217;, which recently sold at Christie&#8217;s auction for an impressive $69 million.<\/p>\n<p>NFTs have been around since 2014, but the recent massive rise in popularity, sales, and breadth of NFTs is new.  NFTs can be just about anything: virtual cannabis farms, art, videos, short films, gifs, movie tickets (although you can&#8217;t use them to watch a movie), or even snapshots from sports history.  But what if I want to be more interactive with my NFT?  They&#8217;ve got that covered too: horse breeding and NFT racing.  Didn&#8217;t you know this existed?  NFT racehorses are a slightly different breed as they are known as “breathing NFTs” because the owner has to actively manage the NFT as a racehorse breeder or owner.  In the case of a racehorse, the owner can make money off of it on the track every day, whereas with NFT art there isn&#8217;t much to do with it other than feel good about being the only one in the world to own it. that thing, and of course sell it for a profit later.<\/p>\n<p>How to launder money with NFTs?<\/p>\n<p>Laundering money is quite simple, just spend it.  If they give you €6,000 in black, you buy an iPhone, go to a restaurant to have a feast and leave the rest in a drawer for daily expenses.  In a few months you already have it bleached and the hacienda won&#8217;t even know about it.<\/p>\n<p>The problem is if you have hundreds of thousands of euros (which can happen to a dentist, for example) or millions of euros (here we would have to go to a builder or a mobster).  So laundering capital is already a problem, and today a “mattress bench” is not an alternative, since with inflation at 5.5% it would eat it up little by little.  In these cases, it is time to whitewash and this is where NFTs can be a good ally.<\/p>\n<p>Let&#8217;s imagine that a well-known builder has 10 million euros not declared.<\/p>\n<p>Step 1: Buy a cheap JPEG image with clean money<br \/>Step 2: Buy your own JPEG for 10 million euros, in bitcoins, with the illegal money<br \/>Step 3: Collect the 10 million euros in clean profits through a tax haven.  It&#8217;s already bleached.<\/p>\n<p>This is something that was already done with real art but here it is even easier to move black money because it is tied to a decentralized currency and the fact that there are no physical works of art that have to be transported or stored in warehouses in tax havens. abroad.<\/p>\n<p>In the case of the NFT with which we opened the article, you can see how in his transaction history the final buyer already had it on August 11 and in between he sold it to an intermediary for $346,000.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-105631 lazy\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1652958552_319_NFTs-are-an-excellent-way-to-launder-money.jpg\" alt=\"NFTs are a great way to launder capital 2\" width=\"916\" height=\"446\"  data-\/><\/p>\n<p>Let&#8217;s see, I&#8217;m not saying that NFTs are always used to launder money and surely there is someone who wants to pay a couple of million euros to have a pixelated image of a monkey, like Shalom McKenzie who, coming from the world of betting I&#8217;m sure you don&#8217;t have any money to launder.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>That image you see is CryptoPunk #9998 and It is the most expensive work of art in history. (above Da Vinci&#8217;s Salvator Mundi which cost 450 million). It sold last week for $532 million to an anonymous buyer and is currently listed for more than $1 billion. The image is part of the collection of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":678,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/677"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=677"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/677\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/678"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=677"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=677"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=677"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}