{"id":683,"date":"2022-05-19T16:23:30","date_gmt":"2022-05-19T16:23:30","guid":{"rendered":"https:\/\/infobloom.site\/nfts-and-their-applications-beyond-art-el-financiero\/"},"modified":"2022-05-19T16:23:30","modified_gmt":"2022-05-19T16:23:30","slug":"nfts-and-their-applications-beyond-art-el-financiero","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nfts-and-their-applications-beyond-art-el-financiero\/","title":{"rendered":"NFTs and their applications beyond art – El Financiero"},"content":{"rendered":"<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">The boom of the subject was when Christie&#8217;s auction house sold an NFT in JPEG format of the artist Beeple, for $69 million dollars.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">In the first days of 2022, Open Sea, the most popular marketplace for buying and selling NFTs, announced its latest round of $300 million at a valuation of $13 billion.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">However, there are many applications that have not been exploited, and go beyond art.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">Saying that NFTs are digital images is like saying that the internet is just web pages.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">Before listing some ideas, I want to clarify again, as I did in this text (I recommend you read it if you haven&#8217;t already), that NFTs are not the digital art or collectibles they represent.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">The letters NFT stand for “Non-Fungible Token”, “Non-fungible” means that they cannot be replaced by something else.  A dollar bill can be replaced by another or exchange one bitcoin for another and you will have exactly the same, in value and liquidity.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">An NFT cannot be exchanged for another, it is unique and therefore its initial application is in a market that needs to ensure the authenticity of its assets, collectibles and art.  The pieces can be in any format, JPEG, video and are “minted” or “mint” (the correct term when creating an NFT token) using a blockchain.<\/p>\n<h2 class=\"heading__StyledHeading-sc-5jxglz-0 jdeyiC\">tickets<\/h2>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">If an NFT is delivered as tickets for an event, it can be ensured that there is no counterfeiting, and in theory, all past and future transactions with prices for that ticket can be seen in the secondary market.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">Therefore, it would give security to the buyer and transparency to an industry plagued by resale and corruption.  Additionally, that NFT from the used ticket can be turned into a collectible from said concert.  Think of a front-row ticket NFT to Queen&#8217;s concert at Live Aid.<\/p>\n<h2 class=\"heading__StyledHeading-sc-5jxglz-0 jdeyiC\">Memberships<\/h2>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">One of the applications that is taking shape is linking an art NFT with club membership.  There are hundreds of organizations that mint NFTs and add value to the owners of the pieces just like a club.  Very successful examples are Bored Ape Yacht Club or Cryptopunks.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">Within the data contained in the NFT, you can put information about the owner, who and how much you bought it, in addition to paying a royalty to the original creator in each transaction using Smart Contracts.  Being a technology impossible to alter, you can ensure that members do not give their access to third parties.<\/p>\n<h2 class=\"heading__StyledHeading-sc-5jxglz-0 jdeyiC\">Political Fundraising<\/h2>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">Some Democratic candidates in the United States minted NTFs to raise funds for their campaigns.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">It is an interesting way since, connecting the previous ideas, when you buy a token you are donating to the campaign and at the same time, if the strategy is done correctly, based on how much you donated, you could have access to events and the same candidates during and after the elections.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">If you bought the token of a local candidate and over the years he becomes president, that same NFT could increase in value or give special access.<\/p>\n<h2 class=\"heading__StyledHeading-sc-5jxglz-0 jdeyiC\">Elections<\/h2>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">Goodbye to your voter card;  If NFTs are issued to replace IDs to vote and it is done in a system with total transparency, in theory, fraud and delays in the counting of votes could be avoided, in addition to the fact that you could vote remotely.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">There are several proposals on this subject since it is an industry that will benefit greatly.  At the same time, one of the most complex.  The quality of being able to see who is voting and avoiding fraud is opposed to electoral secrecy.  And a vulnerability in the system could affect the elections.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">Virtually any industry can benefit from blockchain technology;  for now, as with all early-stage technologies, it feels like the old west, little regulation, lots of bubbles, and lots of fraud.  I strongly recommend that you understand the market very well before speculating.  I look forward to the positive changes that companies created thanks to these technologies will bring to our lives.<\/p>\n<p class=\"default__StyledText-xb1qmn-0 kYamVn body-paragraph\">Until next week, Manuel.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The boom of the subject was when Christie&#8217;s auction house sold an NFT in JPEG format of the artist Beeple, for $69 million dollars. In the first days of 2022, Open Sea, the most popular marketplace for buying and selling NFTs, announced its latest round of $300 million at a valuation of $13 billion. However, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":684,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/683"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=683"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/683\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/684"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=683"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=683"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=683"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}