{"id":702,"date":"2022-05-20T07:31:09","date_gmt":"2022-05-20T07:31:09","guid":{"rendered":"https:\/\/infobloom.site\/immediate-future-of-cryptocurrencies-and-nfts\/"},"modified":"2022-05-20T13:01:59","modified_gmt":"2022-05-20T13:01:59","slug":"immediate-future-of-cryptocurrencies-and-nfts","status":"publish","type":"post","link":"https:\/\/infobloom.site\/immediate-future-of-cryptocurrencies-and-nfts\/","title":{"rendered":"Immediate future of cryptocurrencies and NFTs"},"content":{"rendered":"<p>In the last installment we investigated what the Metaverse is going to be. Today let&#8217;s explore the possible paths that cryptocurrencies and NFTs (non-fungible tokens or irreplicable symbols) can take, in other words, virtual goods and currencies.<\/p>\n<p>The origin and operation of cryptocurrencies is controversial, confusing and extensive, but suffice it to say that they are currencies that, instead of being backed by a national government, such as the peso, the euro or the dollar, are backed by the faith of the people who invest in them Why is gold valuable? Because it&#8217;s scarce, you can&#8217;t create more and people want to have it. It is the same with cryptocurrencies, their production is controlled by their creators, so there is a limited amount and people want to have them.<\/p>\n<p>If cryptos are the currencies of the digital world, NFTs are the goods of that world. For now they are art, any image, be it a photo, a digital creation or a combination that the creator encoded and sold with the promise not to sell it again. In the future it could be architectural plans of a house in the Metaverse, the design of a car or a digital plant or pet. An NFT is irreplicable not because no one else can see or even reproduce the image. In fact, the creators usually retain the rights to reproduce it and it is impossible to control other users from using it. It is irreplicable because the creator cannot sell it again as an NFT (although he can continue to sell its reproduction in different media). Let&#8217;s face it, NFTs were invented by digital artists who want to be able to sell their work and retain the right to resell it in other ways and cryptocurrencies are created by coders who at least initially manage to sell something with no intrinsic value. Yes, it&#8217;s a pyramid scheme, but art and national currencies work on the same principle, so it&#8217;s not as crazy as it might sound to a digital investment skeptic.<\/p>\n<p>Having said that, these digital investments are very high risk. Yes, they have been making astronomical returns since their inception over a decade ago (and a lot of volatility along the way), but that doesn&#8217;t mean those returns will continue. Nor are they finished. It is a divisive issue between those who invest in them who are sure they will continue their exponential growth either by conviction or convenience and those who are not convinced.<\/p>\n<p>The world economy is in a correction and the outlook for the rest of the year still does not look promising: interest rates are on the rise, there are remnants of the pandemic to be resolved, political instability in Ukraine and the maturity of a long cycle of expansion ; all contribute to a pessimistic environment.<\/p>\n<p>Out of a thousand possible scenarios, for me two stand out: that in the face of a pessimistic outlook, investors abandon riskier investments in goods with no intrinsic value or that the frustration that traditional investment instruments are depressed can reinforce faith in digital currencies and goods.<\/p>\n<p>Applause and fortune to whoever correctly forecasts the immediate future of crypto and NFTs. For now, the crypto currencies are between 50 and 80% down from their November highs and whoever presumes to know their future with certainty has a lot to lose.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the last installment we investigated what the Metaverse is going to be. Today let&#8217;s explore the possible paths that cryptocurrencies and NFTs (non-fungible tokens or irreplicable symbols) can take, in other words, virtual goods and currencies. The origin and operation of cryptocurrencies is controversial, confusing and extensive, but suffice it to say that they [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":703,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/702"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=702"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/702\/revisions"}],"predecessor-version":[{"id":712,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/702\/revisions\/712"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/703"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=702"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=702"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=702"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}