{"id":723,"date":"2022-05-21T08:53:59","date_gmt":"2022-05-21T08:53:59","guid":{"rendered":"https:\/\/infobloom.site\/?p=723"},"modified":"2022-05-21T08:54:01","modified_gmt":"2022-05-21T08:54:01","slug":"a-beginners-guide-to-nfts-linda-xie","status":"publish","type":"post","link":"https:\/\/infobloom.site\/a-beginners-guide-to-nfts-linda-xie\/","title":{"rendered":"A beginner&#8217;s guide to NFTs — Linda Xie"},"content":{"rendered":"<h3 id=\"what-are-nfts\">What are NFTs?<\/h3>\n<p>Non-fungible token (NFT) is a term used to describe a unique digital asset whose ownership is tracked on a blockchain, such as Ethereum. Assets that can be represented as NFTs range from digital goods, such as items that exist within virtual worlds, to claims on physical assets such as clothing items or real estate. In the coming years, we will see NFTs used to unlock entirely new use cases that are only made possible by crypto.<\/p>\n<p>Tokens redeemable for real world goods on Zora<\/p>\n<p>While the Ethereum ecosystem is where most NFT activity has taken place to date, NFTs can exist on other smart contract platforms too. This is because, at their core, NFTs are just digital abstractions used to represent assets that are one of a kind. Non-fungible token isn’t the most intuitive term since we don’t commonly refer to the fungibility of objects in the physical world, but this is an important technical distinction when it comes to how an asset is represented on a blockchain. The goal for this post is not to detail every project within the NFT space, but to give a high level overview of what NFTs are, why they are interesting, and showcase some of their potential use cases.<\/p>\n<h3 id=\"why-are-nfts-interesting\">Why are NFTs interesting?<\/h3>\n<p>NFTs are powerful because, when combined with other financial building blocks on Ethereum, they allow anyone to issue, own, and trade them. This makes interacting with NFTs significantly more efficient than in traditional platforms. The same reason why cryptocurrency used in payments is more efficient than traditional payments, that it is borderless and significantly easier to transfer, applies to NFTs. For example, if you want to create tradable in-game items as a game developer, then you can instantly have them be tradable through protocols that allow for decentralized exchange of NFTs. You don’t have to create your own marketplace or go through the onboarding process of a centralized platform in order to have the items be tradable.<\/p>\n<p>NFT activity can go well past trading and include actions like being able to borrow and lend, support fractional ownership (e.g. NIFTEX), or use it as collateral in taking out a loan (e.g. NFTfi). The possibilities are endless when you have the ability to combine NFTs with DeFi building blocks. For example, the game Aavegotchi combines DeFi and NFT gaming where each Aavegotchi character represents a user’s collateral that is deposited within the lending platform Aave, but you can also battle the characters, level them up, and equip wearables that change their traits.<\/p>\n<p><img alt=\"Aavegotchi gaming attributes change based on actions taken in DeFi\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653081064_417_A-beginners-guide-to-NFTs-—-Linda-Xie.jpeg\" class=\"css-r0ukz2\">Aavegotchi gaming attributes change based on actions taken in DeFi<\/p>\n<p>NFTs can cover an extremely wide variety of areas given they are simply digital representations of ownership but there has been significant growth within art and gaming in particular. Note that many digital works of art and gaming items are a subset of a larger category of NFT collectibles. There is also the emerging space of social tokens, which sometimes falls into the NFT category or that is closely related to it.<\/p>\n<h3 id=\"art\">Art<\/h3>\n<p>NFTs can make fractionalized ownership more accessible, so if there is a valuable item that otherwise wouldn’t have been accessible for someone to own, now they can own a piece of it. Custody of a physical item still requires a trustworthy custodian, but being able to issue, hold, and trade it as a cryptoasset unlocks more use cases. One can also craft an NFT such that the creator receives a percentage of all secondary sales in a completely automated way. Artists typically don’t receive a cut of secondary sales in the traditional art world.<\/p>\n<p>Programmable art is another interesting concept where a piece of artwork can incorporate on-chain data to dynamically update certain features or characteristics of the work. For example, one could create a piece of programmable art whose background changes if the price of ether goes above a certain dollar-value. There are countless creative possibilities.<\/p>\n<p><img alt=\"Rutger van der Tas artwork that changes based on if it’s day or night\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653081065_54_A-beginners-guide-to-NFTs-—-Linda-Xie.jpeg\" class=\"css-r0ukz2\">Rutger van der Tas artwork that changes based on if it’s day or night<\/p>\n<p>Async Art is a digital art marketplace known for programmable art. Many artists on Async sell artwork where someone is able to own the “master” copy which consists of a number of individual layers, but other people can own the individual layers and adjust their attributes over time. Imagine groups of people being able to own art collectively, where members of the group manage attributes of the work.<\/p>\n<p><img alt=\"Osinachi artwork that includes a master and layers that can be individually adjusted\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653081065_293_A-beginners-guide-to-NFTs-—-Linda-Xie.jpeg\" class=\"css-r0ukz2\">Osinachi artwork that includes a master and layers that can be individually adjusted<\/p>\n<p>A common question about digital artwork is what can you do with it? These works can be displayed in digital frames in a physical setting for people to enjoy. The digital artist Beeple sold physical tokens along with his digital NFTs and made $3.5 million from sales in an auction on the Nifty Gateway marketplace.<\/p>\n<p><img alt=\"Artist Beeple’s physical token that came with the NFT sale\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653081066_637_A-beginners-guide-to-NFTs-—-Linda-Xie.jpeg\" class=\"css-r0ukz2\">Artist Beeple’s physical token that came with the NFT sale<\/p>\n<p>Digital artwork can also be displayed in online collections like a SuperRare profile as well as in virtual worlds. There are a number of art galleries within Cryptovoxels, a virtual world where users can buy and sell land parcels as NFTs. As virtual reality spaces become more popular, having digital art to display will become more common. This wouldn’t be much different than someone spending money on video game items to customize a character’s appearance, already a multi-billion dollar industry.<\/p>\n<p><img alt=\"Digital art gallery in Cryptovoxels\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653081067_305_A-beginners-guide-to-NFTs-—-Linda-Xie.jpeg\" class=\"css-r0ukz2\">Digital art gallery in Cryptovoxels<\/p>\n<p>A common skepticism is that someone can just take a screenshot of the image or get a digital file so it’s not really scarce. However, the same argument could apply to physical items as well. Anyone can take a photo of the Mona Lisa or create a replica of it, but it isn’t the real item from the artist. People are willing to pay a premium for the original work. Another interesting aspect of digital art or collectibles is that you can easily verify the item’s ownership history. Some digital items might be worth more depending on who owned it in the past.<\/p>\n<p>With NFTs, you can also prove that the item is real and tamper proof. This is an issue in the physical collectibles space. For example, a T206 Honus Wagner baseball card was sold to Wayne Gretzky for $451k and sold again for several million dollars. One of the sellers of the card later admitted in court to trimming the card’s edges to make it look better. You can ensure NFT supply doesn’t change and there’s no counterfeit or continued printing. For example, there are many counterfeit Black Lotus cards in the popular game Magic: The Gathering. Common verification methods include bending the card to make sure it doesn’t crease or going through centralized grading services whose rating significantly affects the card&#8217;s value.<\/p>\n<h3 id=\"gaming\">Gaming<\/h3>\n<p>Steam, a popular video game platform, has a Community Market where in-game items can be bought and sold. Steam’s marketplace is centralized and collects a transaction fee of 5% for each item from the buyer. Games like Team Fortress 2 and Dota 2 take an additional fee of 10% for their items sold.<\/p>\n<p><img alt=\"Steam Community Market\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653081067_583_A-beginners-guide-to-NFTs-—-Linda-Xie.jpeg\" class=\"css-r0ukz2\">Steam Community Market<\/p>\n<p>Steam also restricts user wallet balances to $2,000 and the price of a single item to $1,800. While these cases are outliers, many in-game items can actually sell for significantly larger amounts such as the DotA 2 pink war dog courier for $38,000. Within the crypto space there have also been high priced sales such as the $170,000 CryptoKitty. Similarly Magic: The Gathering’s coveted Black Lotus card sold for $166,100. There is certainly demand for valuable in-game items. In decentralized marketplaces, there isn’t a limit imposed on what game items can be sold and for what amount.<\/p>\n<p>Decentralized marketplaces can significantly reduce transaction fees due to the improved efficiency of starting up and operating a marketplace. Marketplaces can also improve overall user experience and increase interest in the game. Hearthstone is a wildly popular digital collectible card game created by Blizzard Entertainment that had over 100 million players in 2018. Hearthstone opted to not have a marketplace for their cards which leaves opportunity for other digital collectible card games that allow for an open marketplace. Gods Unchained and SkyWeaver are two trading card games (TCGs) that have cards that are freely tradable. You are also able to earn cards as you level up in the game. Players that did not purchase packs of cards will still be able to improve upon the game’s default decks. It’s an exciting feeling knowing that the earned cards have real world value and can be sold or traded for other cards. Gods Unchained also lets users earn tokens for when they win a match or refer their friend. The tokens themselves unlock rare in-game items and are also freely tradable.<\/p>\n<p><img alt=\"Gods Unchained\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653081068_671_A-beginners-guide-to-NFTs-—-Linda-Xie.jpeg\" class=\"css-r0ukz2\">Gods Unchained<\/p>\n<p>One of the most popular games in crypto is Axie Infinity. You battle with a team of pet Axies and level them up. There&#8217;s no aspect of the gameplay that feels like a blockchain game but there is the added benefit of being able to openly trade the Axies on NFT marketplaces such as OpenSea. The game has become popular in the Philippines and earning tokens from the game has become a viable source of income for players even beating minimum wage in many countries. There is also a decentralized autonomous organization (DAO) called Yield Guild Games which leases Axies to players that want to get started with the game but don’t have the funds to purchase them. Several rare Axies were even purchased for $159,000 total.<\/p>\n<p><img alt=\"Axie Infinity battle\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653081069_575_A-beginners-guide-to-NFTs-—-Linda-Xie.jpeg\" class=\"css-r0ukz2\">Axie Infinity battle<\/p>\n<p>There’s another popular game Dark Forest where you can explore different planets and collect Artifact NFTs on new planets, which give bonuses when attached to the planet. Being able to discover and collect these items or even win them in a battle and then trade them in decentralized marketplaces can make the game even more fun.<\/p>\n<p><img alt=\"Planet in Dark Forest which has an Artifact NFT\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653081069_775_A-beginners-guide-to-NFTs-—-Linda-Xie.jpeg\" class=\"css-r0ukz2\">Planet in Dark Forest which has an Artifact NFT<\/p>\n<p>One concern with making in-game items tradable is that the ability to trade items can negatively affect the gameplay as people are focused on extracting value from the system or only the players that are willing to pay a lot of money for items can enjoy the game. Diablo III had an auction house where users could trade in-game items for in-game currency and cash. It was shut down because of how it affected the game. It was no longer fun and rewarding since players would just buy the best loot. In Diablo III, having the best loot was essentially the goal of the game so having an auction house severely affected gameplay whereas other games are not set up this way. It’s important for game developers to find a balance on what should be freely traded for their game (e.g. skins rather than weapons, game time itself can be traded, etc).<\/p>\n<h3 id=\"social-tokens\">Social tokens<\/h3>\n<p>The emerging area of social tokens grew significantly in 2020. Social tokens are a broad category of tokens issued by individuals and communities. This term encompasses other similar terms like personal token, community token, and creator token. So far there hasn’t been a standardized term but I will use social tokens to refer to the broader category. Social tokens enable creators and communities to have more ownership in what they are building which is extremely exciting.<\/p>\n<p><img alt=\"Social tokens map created by Forefront and Seedclub in Social Tokens Year in Review\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653081070_709_A-beginners-guide-to-NFTs-—-Linda-Xie.jpeg\" class=\"css-r0ukz2\">Social tokens map created by Forefront and Seedclub in Social Tokens Year in Review<\/p>\n<p>Early experiments of social tokens involved people tokenizing their time. For example Reuben Bramanathan, who previously worked on legal and product at Coinbase, tokenized his time where 1 $CSNL token equaled 1 hour of his time and was freely traded. We also saw people attempting to tokenize part of their future income. Platforms like Roll and Coinvise make it easier for people to issue their own token.<\/p>\n<p>One prominent example of a social token is $RAC, a community token by the Grammy award winning recording artist RAC, issued through Zora. Token holders get access to a private Discord group and receive early access to merch drops with more perks to be added in the future. The token was retroactively distributed to his supporters including Bandcamp and Patreon supporters, people who had bought merch, and will eventually be distributed to all Twitch supporters. This allows creators to directly interact with and reward their early supporters.<\/p>\n<p>One of the tools that enabled a new wave of social tokens was Collab.Land, which built a Telegram and Discord bot that connects to an Ethereum wallet to verify token balance before joining a chat group. This allowed for the creation of token permissioned groups, such as $JAMM and $KARMA with their native tokens, which helped make sure that those joining the group had a certain level of skin in the game. Another feature of Collab.Land is a leaderboard that keeps track of who has contributed the most to the chat group. You could imagine token rewards distributed to those with the highest amounts of participation to reward engagement.<\/p>\n<p>Another useful social token tool is Unite Community which allows for creators to easily distribute their tokens to followers through their social media channels and reward engagement.<\/p>\n<p><img alt=\"Unite.community distribution\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653081071_216_A-beginners-guide-to-NFTs-—-Linda-Xie.jpeg\" class=\"css-r0ukz2\">Unite.community distribution<\/p>\n<p>The interesting part about social tokens is that it can represent anything from a person’s time to specialized access to collective ownership of a community. There is a lot of potential for social tokens and I expect many more creators to issue them in the future.<\/p>\n<h3 id=\"future\">Future<\/h3>\n<p>These are just a few of the many use cases that are possible and have gotten some traction. There will likely be a significant increase in NFT adoption over the next several years. Traditional assets like equity getting tokenized seems like a clear progression in the future as it would make transferring them far more efficient. Then we’ll see tokenization that bridges the traditional world but adds new possibilities such as advertising space represented as an NFT where you could sell advertising rights to a site and have that be freely tradable. This would be a form of digital real estate. These NFTs would allow people to bet that a website will get a lot of traction and that the advertising space will become more valuable. Then we’ll start seeing more tokens with brand new concepts that are only made possible because of crypto which is what I’m most excited about.<\/p>\n<p><img alt=\"Table from Will Warren’s presentation at 0xpo\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653081071_29_A-beginners-guide-to-NFTs-—-Linda-Xie.jpeg\" class=\"css-r0ukz2\">Table from Will Warren’s presentation at 0xpo<\/p>\n<p>There are a few aspects of the user experience that need to be improved in order for NFTs to become more accessible. We need to have improvements to scaling since transaction fees can make some transactions very expensive or infeasible. Scaling research is already in the works with many different teams in Ethereum working on scaling solutions and we also are seeing other blockchains being built that are catered specifically for this use case. Another point of friction with NFTs is that holders will need to self-custody them. However this complexity can be abstracted away with user friendly wallets that make it easy to onboard and support features such as a PIN, biometrics, and social account recovery. I’m optimistic that these will get built out over time and we will see a huge wave of creativity and experimentation in the NFT space.<\/p>\n<h3 id=\"resources\">Resources<\/h3>\n<p>Here are some additional resources to understand NFTs further and keep up with developments.<\/p>\n<h4 id=\"understanding-nfts\">Understanding NFTs<\/h4>\n<h4 id=\"keeping-up-with-nfts\">Keeping up with NFTs<\/h4>\n<p>If you want to get in touch about interesting NFT ideas or projects, I’m @ljxie on Twitter.<\/p>\n<p>Thanks to Will Warren and Jordan Clifford for reviewing this post.<\/p>\n<p>Disclaimer: Linda Xie is a Managing Director of Scalar Capital Management, LLC, an investment manager focused on cryptoassets which holds ETH and Ethereum tokens. This post is not investment advice.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What are NFTs? Non-fungible token (NFT) is a term used to describe a unique digital asset whose ownership is tracked on a blockchain, such as Ethereum. Assets that can be represented as NFTs range from digital goods, such as items that exist within virtual worlds, to claims on physical assets such as clothing items or [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":737,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/723"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=723"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/723\/revisions"}],"predecessor-version":[{"id":750,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/723\/revisions\/750"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/737"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=723"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=723"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=723"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}