{"id":73,"date":"2022-05-03T10:18:05","date_gmt":"2022-05-03T10:18:05","guid":{"rendered":"https:\/\/infobloom.site\/nft-scams-how-to-identify-them-so-you-dont-be-just-another-victim\/"},"modified":"2022-05-18T11:37:21","modified_gmt":"2022-05-18T11:37:21","slug":"nft-scams-how-to-identify-them-so-you-dont-be-just-another-victim","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nft-scams-how-to-identify-them-so-you-dont-be-just-another-victim\/","title":{"rendered":"NFT Scams: How to Identify Them So You Don&#8217;t Be Just Another Victim"},"content":{"rendered":"<p>NFT scams<\/p>\n<p>The great popularity of NFTs in recent times has brought with it that lovers of alien things do their thing in this vast world. The <strong>NFT scams<\/strong> they are a reality, despite the fact that in theory the blockchain system on which they are based is one of the safest in the digital field.<\/p>\n<p>The figures are compelling: In 2021, NFTs illicitly moved a total of approximately more than 2,948 million euros and NFT copy fraud has reached 300% at the beginning of 2022. However, luckily, there are ways to identify all these dirty plays.<\/p>\n<p>The recent interest in the world of art has been a great impetus for this growth of non-tangible assets, since, until now,<strong> the concept of the digital good is widely associated with being completely replicable <\/strong>without the need for financial transactions.<\/p>\n<p>In this sense, it is the blockchain technology that changes everything: The act of selling something through this technology implies that the transaction is recognized and that what is purchased is not a copy, but an original good.<\/p>\n<p>“NFTs offer a solution to some issues that have not been resolved since the birth of the web, such as the authorship, uniqueness, ownership and monetization of a digital asset. Its application to all contexts where digital assets are created and exchanged, such as art, collecting, video games or the anticipated Metaverse, together with the idea of ​​rapid economic revaluation, have aroused the interest of small investors. Ironhack&#8217;s commitment to digital skills training makes us always recommend the same approach to technology: understand its principles, purpose and operation before making decisions. Especially if we are talking about investment decisions by individuals in highly volatile markets”, says Carlos Guardiola, Director of New Business at Ironhack.<\/p>\n<p>Therefore, they explain from IronHack, ownership of the digital asset becomes permanent and that is the main contribution of NFTs: <strong>each NFT is unique, cannot be replicated or erased, and is associated with a token that can only be held by one person<\/strong>namely, <strong>you do not buy a license or a reproduction, you buy the intangible good itself<\/strong>. What can be transferred is, that is, the owner of an NFT can, in turn, <strong>resell it<\/strong>allowing you to make a profit on the revaluation.<\/p>\n<h2><strong>NFT Scams: Learn to Recognize Them<\/strong><\/h2>\n<p>Until now, reproductions of a digital good were indistinguishable from each other and from the original. Thanks to NFT technology, you can create <strong>unique digital assets<\/strong>, <strong>you can digitize the value of a good<\/strong> and, since there is a market where that good can be bought and sold, in addition to digitizing it, it gives <strong>liquidity<\/strong>.<\/p>\n<p>NFTs were created with the aim of giving property to intangible art and digital artists have found in it a great platform for market and visibility. Creating, selling, and buying NFTs are relatively straightforward tasks, as <strong>there are different platforms that allow any digital artist to put their tokens up for sale<\/strong>in addition to offering buyers permanent registration of the property of the work they acquire through a digital signature.<\/p>\n<p>Not only that, but blockchain technology and smart-contracts allow, for example, that a <strong>digital artist earn a monetary income every time there is a change in ownership of your property<\/strong>, something that does not happen outside of digital. The world of art is changing and this type of work can cost millions. An example of this is the digital work <strong>Artist Pak&#8217;s &#8216;The Merge&#8217; sold for the highest amount in NFT history: $91.8 million.<\/strong><\/p>\n<p>The <strong>NFT scammers<\/strong> They have managed to supplant the identity of artists, or to deceive users through false web portals, suspiciously attractive promotions and emails of dubious origin, to say the least.<\/p>\n<p>The NFT boom has also given way to speculation and different types of crimes, illicit activities and scams. In fact, according to Chainalysis, <strong>in 2021 NFTs were found to have illicitly moved an approximate total of more than 2,948 million euros<\/strong>. Here are the most common NFT scams.<\/p>\n<h3 id=\"phishing\"><strong>phishing<\/strong><\/h3>\n<p>It is one of the techniques most used by hackers or scammers, and unfortunately, it still continues to attract unwary people to their networks. Basically, it consists of a <strong>email messaging system<\/strong>which sends random emails to people, offering gifts and promotions, or notifying them of a problem they have to solve.<\/p>\n<p><img class=\"wp-image-102161\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1651573084_768_NFT-Scams-How-to-Identify-Them-So-You-Dont-Be.jpg\" alt=\"\" width=\"1024\" height=\"576\" \/><\/p>\n<p>Sometimes it is easy to identify this type of scam, since they usually stay in the spam folder, although this is not always the case.<\/p>\n<p>The purpose of this type of scam is that you enter a link that they offer you, where <strong>you will be asked for some personal information<\/strong>, such as the data in your digital wallet where you store your NFTs. In this way they manage to keep your account, and, therefore, with all its content.<\/p>\n<p>The best thing you can do to try to identify if the message you have received is a scam or not, is to carefully review the sender and the website they intend to enter. At the first inconsistency, you should distrust.<\/p>\n<h3 id=\"regalos-y-promociones\"><strong>Gifts and promotions<\/strong><\/h3>\n<p>This is another of the most used NTF scam modalities, due to how attractive they tend to be. Here the user is often tempted to<strong> all kinds of free gifts and promotions<\/strong>which lead you to put your personal data at risk.<\/p>\n<p>In these cases, scammers usually launch these campaigns through Twitter, Facebook, Telegram and Discord, in order to attract as many people as possible.<\/p>\n<p>In this case, as in the previous one, what <strong>scammers are trying to do is keep your digital wallet<\/strong> and with all its content, making you believe that with its strategies you can get more cryptocurrencies for free and quickly.<\/p>\n<p>The best thing you can do to avoid this type of scam is to try not to accept any proposal that may seem suspicious. Even less if it comes from unauthorized entities or without any reputation.<\/p>\n<h3 id=\"suplantacion-de-artistas\"><strong>impersonation of artists<\/strong><\/h3>\n<p>What used to happen to in-person art like paintings, paintings, or sculptures has now been taken digitally by fraudsters. we can see how <strong>some scammers pose as known NFT artists<\/strong>in order to deceive buyers and make large profits at the expense of plagiarism, just by changing their name to someone famous in the sector.<\/p>\n<p><img class=\"wp-image-102162\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/NFT-Scams-How-to-Identify-Them-So-You-Dont-Be.jpeg\" alt=\"\" width=\"1024\" height=\"576\" \/><\/p>\n<p>Taking this into account, if you like art and want to buy, it is best to only buy material from verified accounts and trusted web portals.<\/p>\n<h3 id=\"webs-falsas\"><strong>fake websites<\/strong><\/h3>\n<p>The fake websites are also very much in tune with the cases of phishing that we have already mentioned. Its intention is to make you believe that you are entering a totally professional and verified web page, so that <strong>hijack your data and appropriate the contents of your digital wallet<\/strong>.<\/p>\n<p>To avoid falling for this type of scam, you should only avoid going to web portals that you do not know. That is, in this sense, it is worth looking at the reputation of a website before visiting it, making sure that the web address is appropriate and that it is not altered to make you believe that you are accessing the original.<\/p>\n<h3><strong>Copies of works<\/strong><\/h3>\n<p>As for the copies, the company Opensea made public on January 28 of this year, through a tweet, that around <strong>8 out of 10 articles created with their tool were plagiarized works, fake collections, and spam. <\/strong>For its part, the DeviantArt platform implemented a fraud alert system in search of NFT copies and has already <strong>have issued around 80,000 scam alerts, rising 300% by early 2022<\/strong>.<\/p>\n<p>Another negative point is the high contamination capacity that hides behind NFTs. The digital transactions required to carry out a single NFT <strong>consume a total of<\/strong> <strong>340 kWh of energy and produce about 211 kg of CO2 and multiplies as many times as it is sold, <\/strong>according to data from Memo Atken.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>NFT scams The great popularity of NFTs in recent times has brought with it that lovers of alien things do their thing in this vast world. The NFT scams they are a reality, despite the fact that in theory the blockchain system on which they are based is one of the safest in the digital [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":78,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/73"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=73"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/73\/revisions"}],"predecessor-version":[{"id":583,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/73\/revisions\/583"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/78"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=73"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=73"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=73"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}