{"id":738,"date":"2022-05-20T21:57:40","date_gmt":"2022-05-20T21:57:40","guid":{"rendered":"https:\/\/infobloom.site\/avoid-immigration-scams\/"},"modified":"2022-05-20T21:57:40","modified_gmt":"2022-05-20T21:57:40","slug":"avoid-immigration-scams","status":"publish","type":"post","link":"https:\/\/infobloom.site\/avoid-immigration-scams\/","title":{"rendered":"Avoid immigration scams"},"content":{"rendered":"<p>We do not want you to become a victim of an immigration scam.  If you need legal help on immigration matters, make sure the person helping you is authorized to give you legal advice.  Only an attorney or authorized representative working for an organization recognized by the Department of Justice (DOJ) can give you legal advice.<\/p>\n<p>When someone applies for immigration benefits, they may have many questions such as:<\/p>\n<ul>\n<li>Where do I start the process of filing an application or petition?<\/li>\n<li>Will I have to hire an attorney when I apply?<\/li>\n<li>Who can I trust to help me?<\/li>\n<\/ul>\n<p><strong>Get Started on Our Resources Page<\/strong><\/p>\n<p><strong>Check your Case<\/strong><\/p>\n<p>Our case status webpage gives you the same information you would get from speaking with a representative, and is available 24\/7 from your cell phone, tablet, or computer. <\/p>\n<p><strong>Ask Emma<\/strong><\/p>\n<p>In the upper right corner of our website, you will see a link with the message “Need help?  Ask Emma.&#8221;  Click this link and you can chat with Emma, ​​our virtual assistant, in English or Spanish, about her questions about immigration benefits.  Emma can also help you navigate our website. <\/p>\n<p><strong>Another resources<\/strong><\/p>\n<p>Two resources you may find helpful are the Form Filing Tips web page and our Public Liaison page, where you&#8217;ll find a list of our upcoming events locally, nationally, and in other languages.  <\/p>\n<p><strong>Still Have Questions?<\/strong><\/p>\n<p>If you can&#8217;t find the answer after visiting our online resource page, call the USCIS Contact Center.  (For people with disabilities, please use our TTY number: 800-767-1833).<\/p>\n<p>We combat immigration scams by providing knowledge and tools to applicants, legal service providers, and community-based organizations.<\/p>\n<p><strong>Received a Suspicious Email Message? <\/strong><\/p>\n<p>Forward it to the USCIS Webmaster mailbox.<\/p>\n<p>do<strong>Have you been a Witness to an Immigration Scam?<\/strong><\/p>\n<p>Report it to the Federal Trade Commission (FTC) by calling 877-FTC-HELP, or you can file a complaint online, and report it to state or local authorities.<\/p>\n<p><strong>Use These Non-USCIS Links for Additional Information About Immigration Scams<\/strong><\/p>\n<p>Report Fraud Protecting the integrity of the immigration process is a USCIS priority.  One way to protect the immigration system is to simplify the way you can report immigration fraud and abuse. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>We do not want you to become a victim of an immigration scam. If you need legal help on immigration matters, make sure the person helping you is authorized to give you legal advice. Only an attorney or authorized representative working for an organization recognized by the Department of Justice (DOJ) can give you legal [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":739,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/738"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=738"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/738\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/739"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=738"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=738"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=738"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}