{"id":740,"date":"2022-05-21T00:08:33","date_gmt":"2022-05-21T00:08:33","guid":{"rendered":"https:\/\/infobloom.site\/legal-implications-of-nfts\/"},"modified":"2022-05-21T00:08:33","modified_gmt":"2022-05-21T00:08:33","slug":"legal-implications-of-nfts","status":"publish","type":"post","link":"https:\/\/infobloom.site\/legal-implications-of-nfts\/","title":{"rendered":"Legal implications of NFTs"},"content":{"rendered":"<p><\/p>\n<p>Crypto assets have become an impressive industry that has already moved billions of euros in its short history, and they are becoming more and more popular.  Within this category we find the famous NFTs, but do we know what they are and the legal implications they imply?<\/p>\n<p>The NFT (or Non fungible token) refer to a part of these cryptoactives, non-fungible or non-exchangeable tokens, based on the blockchain or block chain, and that represent any digital or physical element, being its maximum exponent works of art. .  It is a chain of code that grants ownership of the digital property of a work, whether it be books, music, photographs, designs, plays, drawings, software, video games, choreographies or any work that can be digitized.<\/p>\n<p>NFTs refer to a type of token developed under the ERC-721 standard for the Ethereum network.  Its beginnings date back to the end of 2017, and what makes this technology so special is that it represents unique values ​​and that they are not consumed with their use, which differentiates them from bitcoins and other cryptocurrencies.  In a simplistic way: they are equivalent to physical trading cards or collectible stamps, but digitized.  With the difference that now its authenticity, exclusivity and, above all, its property is demonstrable.<\/p>\n<p>Science and technology advance faster than the legislation that regulates them, and it can sometimes give the impression that there are legal loopholes in their regulation.  Despite the amount of available information that exists in this regard, the questions are even greater.<\/p>\n<p>And it is not for less, because depending on the value that the NFT represents, different legal issues may be involved, both intellectual property and copyright.  If we speak, for example, of a digital work of art, it will be an intangible asset subject to protection of intellectual property rights.  But the fact that an NFT allows ownership to be transferred to third parties does not mean that the copyright over the original work itself is transferred, since it does not grant the owner the intellectual property of the asset it represents (unless it has been established that way).<\/p>\n<p>Among some of the advantages offered by this type of technology for works of art in NFT format is that they materialize through Smartcontracts and thus facilitate asset management and control over royalty payments, since they can be collected automatically by the author at the time of the transaction without taking any other action.  It is its very nature that guarantees the validity, authenticity or exclusivity of the acquired digital object or work.<\/p>\n<p>But this easy management also involves risks and many other disadvantages, because it also leaves room for copyright infringement.  Copyright is a set of rights granted to the author of an original work.  These rights protect the personal interests of the authors and give them the opportunity to obtain an economic benefit from the exploitation of the work.<\/p>\n<p>And it is because of their characteristics that we could think that the main virtue of NFTs is to facilitate the commercialization of works whose property transactions are more difficult to trace traditionally.  But this only happens at the time of sale, and is not the case in other aspects such as the fight against copyright infringement.  Although they facilitate their sale, they are not equivalent to the generation of proof of authorship, since the work is carried out before the NFT itself.  That is why the generation of author proofs needs to be prior to the sale.  In fact, one of the biggest problems that has been found so far is precisely this: there are many cases of people who have created NFTs of works for which they do not have any type of authorization, either by copying the work itself, modifying it slightly, and even supplanting the identity of the author.<\/p>\n<p>To issue an NFT of a work, the author&#8217;s permission is not necessary, nor is it necessary to prove that it is;  Even today, authors continue to struggle to have their works recognized in NFT format.  This technology also opens the door to other infringements, such as violating the terms of the license granted by the NFT, or breaching the established terms and conditions.<\/p>\n<p>Logically, and in these situations, the copyright laws protect the creators of the works and give them the legal capacity to initiate the corresponding actions if their rights are violated, as could occur in the case of plagiarism or falsification.  Despite the novelty that NFTs represent, it is not very different from other forms of buying and selling art.  The difficulty lies precisely in the fact that, since it is such a new and specialized issue, it can become difficult to defend it in a current legal process due to the ignorance of the magistrates themselves.  It is not easy to explain what this note book called blockchain consists of to those who are not familiar with it.<\/p>\n<p>For this reason, the use of intellectual property registries before the creation of NFTs is very important, precisely to prove their authorship if necessary.  And in the event that your rights are violated and the information recorded in that block chain proves to be false, despite the immutability of the nature of the tokens, you can always modify said information and correct the situation if, within the framework of a legal process it is estimated that this element has been plagiarized.  Therefore, we could link this information to the rest of the information on the block chains since its veracity has been proven, and it is a point in favor of this technology.<\/p>\n<p>Another more delicate aspect and that is assuming a real headache in the doctrine, are the exploitation rights of these NFTs, since they determine all the information that refers to the transaction of that NFT such as the date, how much it has cost , who has sold it and who has bought it, although they do not say &#8220;what&#8221; has been bought.  Issue that could be solved, for example, by linking the copyright information through its own link, thus making the information unalterable.  Although, as we have already said, these questions are still being raised.<\/p>\n<p>Faced with this technological revolution of crypto assets, the European Commission has decided to take action on the matter before the numerous financial entities that have warned about investments in cryptocurrencies.  Thus, they have adopted a new and expansive Digital Financing Package that aims to improve the competitiveness of the sector and Fintech technologies, while reducing risk and guaranteeing the financial stability of the European economy.<\/p>\n<p>This new regulatory framework also includes a new comprehensive legislative proposal on crypto assets, called the MICA Reglmaneto (Markets In Crypto Assets or Crypto Assets Market), which regulates the issuance of crypto assets that do not have the nature of a financial instrument.  It aims to regulate and set standards in the cryptoactive market at a European level, as well as clarify the very nature of the token and provide a single licensing regime in all member states.  In short, harmonize the European framework for the issuance and marketing of the different types of cryptographic tokens.<\/p>\n<p>The draft divides the tokens into three types or &#8220;tokens&#8221;, depending on whether it is used as a means of payment or not:<\/p>\n<ol type=\"1\">\n<li>Tokens or service or utility tokens: type of crypto asset that provides digital access to a good or service, available in DLT (distributed ledger technology), and that is only accepted by the issuer of that token<\/li>\n<li>Asset-Related Tokens (ART): A type of crypto-asset intended to maintain a stable value by referring to the value of various national legal tender fiat currencies, commodities or crypto-assets, or a combination of the various assets.<\/li>\n<li>Electronic money tokens or tokens (EMT): similar to the previous one, a type of cryptoactive that is used as a means of exchange and that seeks to maintain its stable value, referring to the value of a legal tender fiduciary currency.<\/li>\n<\/ol>\n<p>Although it is not definitive and may be subject to modifications, this draft seeks to define a common legal margin to develop the cryptoactive market with all the guarantees.  As extracted from the draft itself, there are four interrelated objectives to be fulfilled:<\/p>\n<p>First: legal certainty.  To favor the development of crypto asset markets in the EU, a solid legal framework is needed that clearly defines the regulatory treatment of all crypto assets not covered by current legislation on financial services.<\/p>\n<p>Second: support innovation.  In order to promote the development of crypto assets and the more widespread use of TRD, a safe and proportionate framework that upholds innovation and fair competition needs to be established.<\/p>\n<p>Third: establish adequate levels of consumer and investor protection and market integrity, given that crypto assets not covered by current legislation on financial services present many of the risks that other more well-known financial instruments already pose.<\/p>\n<p>Fourth: ensure financial stability.  Crypto assets are constantly evolving.  Some are quite limited in scope and use, while others, such as the emerging category of “crypto stablecoins”, could become widely accepted and gain systemic importance.<\/p>\n<p>This proposal includes safeguards to deal with risks that could arise from &#8216;stable cryptocurrencies&#8217; for financial stability and an orderly monetary policy.<\/p>\n<p>There is no specific deadline for the implementation of MICA, but it is expected to be ready by 2024. It will be applicable to all EU member states if adopted, and will not require its implementation in national legislation.<\/p>\n<p>As a conclusion, blockchain technology is here to stay.  The number of applications it will have in the future is still unknown.  What we do know is that regulation is necessary within the European framework, and in terms of its application to art, a package of guarantees to prevent the commission of intellectual property and copyright crimes, which, as we know, are many and numerous .<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Crypto assets have become an impressive industry that has already moved billions of euros in its short history, and they are becoming more and more popular. Within this category we find the famous NFTs, but do we know what they are and the legal implications they imply? The NFT (or Non fungible token) refer to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":741,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/740"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=740"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/740\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/741"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=740"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=740"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=740"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}