{"id":742,"date":"2022-05-21T08:31:58","date_gmt":"2022-05-21T08:31:58","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-the-last-attempt-to-open-doors-to-the-internet-field\/"},"modified":"2022-05-21T08:53:29","modified_gmt":"2022-05-21T08:53:29","slug":"what-are-nfts-the-last-attempt-to-open-doors-to-the-internet-field","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-the-last-attempt-to-open-doors-to-the-internet-field\/","title":{"rendered":"What are NFTs?  The last attempt to open doors to the Internet field"},"content":{"rendered":"<p>Near the end of 2021, the Collins Dictionary has already determined the word of the year: “NFT”.  Behind were other buzzwords like “Metaverse”, “climate anxiety” and “crypto”.<\/p>\n<p>This award is due, according to the publication, to the enormous number of searches and content created around its meaning, creation and applicability.<\/p>\n<h2>What are NFTs?<\/h2>\n<p>This dictionary defines NFT as a &#8220;unique digital certificate, registered on a blockchain, used to record ownership of an asset such as a work of art or a collectible&#8221;.<\/p>\n<p>With &#8220;block chain&#8221; he refers to a blockchain, that is, to a technology that allows the transfer of digital data in an encrypted and decentralized way, which gives it absolute security.<\/p>\n<p>For this reason, the term blockchain has always been related to the field of cryptocurrencies and now with this type of digital goods.<\/p>\n<p>The acronym “NFT” refers to a non-fungible token, which refers to a digital asset that cannot be consumed or replaced.<\/p>\n<p>They are registered through a smart contract that assigns them a unique number, which gives their owner peace of mind against possible replicas.<\/p>\n<p>This registry contains the data of the owner and the creator, which allows the copyright to be preserved equally.<\/p>\n<p>In short, an NFT can be an image, a graphic, a video, music or any other digital content that someone wants to have possession of.<\/p>\n<h2>Everything can be an NFT<\/h2>\n<p>The founder of Twitter, Jack Dorsey, sold the first tweet on the platform (of his authorship) at the beginning of 2021 as an NFT for almost 3 million dollars.<\/p>\n<p>The famous Nyan Cat in GIF version was traded for $600,000 and even NBA highlights videos have fetched prices over $100,000.<\/p>\n<p>In fact, this sports franchise already has a platform to trade its own NFTs: NBA Top Shot, as is also the case with the European American Football League.<\/p>\n<p>Perhaps where the greatest emphasis has been placed on the development of NFTs is around the purchase and sale of digital works.<\/p>\n<p>The first reference is attributed to the artist Kevin McCoy with his work Quantum, although perhaps the most outstanding example corresponds, at the moment, to the artist Beeple, whose digital collage was auctioned on March 11, 2021 for 69 million dollars.<\/p>\n<p>Although there are copies and versions on the internet, the NFT will correspond to the original content.  The creator will be guaranteed 10% of future transactions.  Thus, while the buyer owns the property rights, the authorship rights are also preserved.<\/p>\n<h2>Is there any impact on digital communication?<\/h2>\n<p>The Internet and the evolution of mobile technologies have caused individuals to establish daily dialogues through digital resources such as emojis, stickers, memes, GIFs, videos, etc.<\/p>\n<p>Apart from the cases already mentioned, the conversion to NFT of one of the most famous internet video memes recently emerged: “Charlie bit my finger”.<\/p>\n<p>This video, one of the most viral on YouTube, was sold as an NFT for $650,000 in May 2021. It shows a one-year-old boy biting the finger of his three-year-old brother, who complains loudly.<\/p>\n<p>A scene that was funny to his father, who posted it on the online video repository with the intention that the family could see it in 2007, is one of the first memes on the platform.<\/p>\n<p>There is also the case of the photo of the iconic girl who smiles in the foreground while a house burns in the background.<\/p>\n<p><\/p>\n<p>The Disaster girl meme is an NFT.  Wikimedia Commons<\/p>\n<p>Better known as Disaster girl, this meme has recently been sold for almost half a million dollars.<\/p>\n<p>Memes are a fundamental element in today&#8217;s digital pop culture and a means of communication that even brands and companies exploit more frequently in marketing strategies.<\/p>\n<h2>Criticism of NFTs<\/h2>\n<p>There is concern within the community of internet users that something that seems to be the maximum expression of free communication (due to its ability to replicate and attach to any message) is affected by this recent &#8220;culture&#8221; of hoarding publications and digital content.<\/p>\n<p>As has already been specified, replicas and versions will continue to exist because the internet is like that.  However, the original content, apart from having &#8220;owners&#8221;, will also provide rewards based on authorship.<\/p>\n<p>In other words, in any home or office there may be a replica of the Mona Lisa framed and displayed, but the original is in Paris in the Louvre Museum and its reproduction is copyrighted.<\/p>\n<p>The NFT phenomenon is in its infancy and there is still a lot of development to be done, such as its technology becoming massive and users fully aware of its capabilities.<\/p>\n<p>As part of a digital architecture, the NFT phenomenon is recently being related to the development of the Metaverse at its different levels.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Near the end of 2021, the Collins Dictionary has already determined the word of the year: “NFT”. Behind were other buzzwords like “Metaverse”, “climate anxiety” and “crypto”. This award is due, according to the publication, to the enormous number of searches and content created around its meaning, creation and applicability. What are NFTs? This dictionary [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":744,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/742"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=742"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/742\/revisions"}],"predecessor-version":[{"id":749,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/742\/revisions\/749"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/744"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=742"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=742"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=742"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}