{"id":751,"date":"2022-05-21T09:04:16","date_gmt":"2022-05-21T09:04:16","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-and-how-are-they-taxed\/"},"modified":"2022-05-21T09:04:16","modified_gmt":"2022-05-21T09:04:16","slug":"what-are-nfts-and-how-are-they-taxed","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-and-how-are-they-taxed\/","title":{"rendered":"What are NFTs and how are they taxed?"},"content":{"rendered":"<p>Last year, digital artist Beeple sold his digital work &#8220;Everydays: The First 500 Days&#8221; as an NFT at a Christie&#8217;s auction for a staggering $69,346,250.  It was the first time a major auction house had sold an NFT.  Although NFTs are still fairly new to most people, they have quickly become a multi-trillion dollar market.  However, before you consider creating, selling, or buying NFTs, make sure you understand what they are, how they are taxed, and what taxes are involved.<\/p>\n<h2 id=\"h-what-is-an-nft\">What is an NFT?<\/h2>\n<p>Non-fungible tokens are unique digital assets created in limited quantities.  They are bought and sold as tangible collectibles.  These include art, memes, sports cards, music, games, and even tweets.  Unlike cryptocurrencies, they are one of a kind and are not tradable.<\/p>\n<p>The main attraction for this type of digital investment is the possibility of verifying their authenticity, registering their ownership, and tracking them in transactions.  Artists can even earn royalties on subsequent sales.  There are various platforms where NFTs can be bought or sold, such as OpenSea and Mintable, which is backed by billionaire Mark Cuban.<\/p>\n<h2 id=\"h-nfts-and-taxes\">NFTs and Taxes<\/h2>\n<p>Although the IRS has not formally communicated its position regarding the tax treatment of NFTs, it is possible that some are considered as collectible items and are subject to a higher tax rate.  However, they will most likely receive the same tax treatment as cryptocurrencies as they are used in most NFT transactions.  When someone buys an NFT using cryptocurrencies, both the buyer and the seller carry out a taxable transaction.  Depending on whether you are a creator, trader, or investor, there are various tax consequences to consider.<\/p>\n<h3 id=\"h-creators\">creators<\/h3>\n<p>As the creator of an NFT, you are not subject to tax until you sell your work.  Once sold, any income is taxed at your regular tax rate and is subject to self-employment taxes.  If royalties are paid to you in cryptocurrency for subsequent sales, they will also be taxed at the time you receive them.<\/p>\n<h3 id=\"h-buyers-investors\">Buyers\/Investors<\/h3>\n<p>If you buy an NFT using cryptocurrencies, you will be subject to short or long-term capital gains or losses.  For example, if you buy a piece of digital art valued at $10,000 using Ethereum (ETH) that you originally bought for $1,000 two years ago, you would have long-term capital gains of $9,000 ($10,000 — $1,000).  NFTs classified as collectibles may be subject to the 28% long-term capital gains tax rate for high-income taxpayers.<\/p>\n<p>If the same situation occurred but the purchase of the NFT was less than 12 months after you purchased your ETH, you would have to pay higher tax rates corresponding to the short-term gains.  Depending on your income tax bracket, these could be as high as 37%.<\/p>\n<p>On the contrary, if you had bought your ETH for $15,000, you would have a loss of $5,000 ($15,000 — $10,000).  You are also subject to possible gains and losses when you exchange one NFT for another or when you sell it outright.<\/p>\n<p>Please note that you will need to keep a detailed record of your transactions in order to calculate your cost basis and market value as most NFT trading platforms do not provide any documentation.<\/p>\n<h2 id=\"h-non-taxable-nft-transactions\">Non-taxable NFT transactions<\/h2>\n<p>There are certain instances in which purchasing an NFT may not trigger a taxable event.  These include:<\/p>\n<ul>\n<li>Make the purchase with US dollars or credit card instead of cryptocurrencies.<\/li>\n<li>Buy cryptocurrencies exclusively for the purchase of the NFT instead of using the cryptocurrencies in an existing account.<\/li>\n<\/ul>\n<p>However, once you sell or trade the NFT, you will need to determine whether you have a capital gain or loss.<\/p>\n<h2 id=\"h-don-t-forget-state-taxes-penalties\">Don&#8217;t forget state taxes and penalties<\/h2>\n<p>In addition to federal taxes, buyers and sellers of NFTs are also responsible for paying state income, sales, and\/or use taxes.  It&#8217;s important to check your state&#8217;s rules on capital transactions.  Depending on where you live, your capital gains may be taxed as ordinary income.<\/p>\n<p>It&#8217;s also important to talk to a tax professional about paying your taxes quarterly.  If you generated strong income from the sale of NFTs but don&#8217;t pay enough taxes in the year, you could receive an underpayment penalty.  By making quarterly payments, you avoid being sanctioned<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last year, digital artist Beeple sold his digital work &#8220;Everydays: The First 500 Days&#8221; as an NFT at a Christie&#8217;s auction for a staggering $69,346,250. It was the first time a major auction house had sold an NFT. Although NFTs are still fairly new to most people, they have quickly become a multi-trillion dollar market. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":752,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/751"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=751"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/751\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/752"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=751"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=751"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=751"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}