{"id":753,"date":"2022-05-21T09:35:46","date_gmt":"2022-05-21T09:35:46","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-and-why-have-they-become-so-relevant\/"},"modified":"2022-05-21T09:35:46","modified_gmt":"2022-05-21T09:35:46","slug":"what-are-nfts-and-why-have-they-become-so-relevant","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-and-why-have-they-become-so-relevant\/","title":{"rendered":"What are NFTS and why have they become so relevant?"},"content":{"rendered":"<h2>6. Industrial sectors that could be transformed by NFTS<\/h2>\n<p>But… what are NFTS in each industrial sector?  NFTS are different in each sector and in some they can be a revolution.  Among those that experts have pointed out as the most important, are:<\/p>\n<p><u>Gaming Sector <\/u><\/p>\n<p>One of the biggest problems in the gaming industry is that when players buy in-game assets, game developers could remove them at any time if they wanted to.  People are spending fortunes on games like Fortnite, but these assets are often owned by the company that created the video game and are stored on their systems.  If the company were to go out of business or go bankrupt, users would risk losing the virtual assets they have already paid for.<\/p>\n<p>If the assets of these video games were created on NFTS, users would be guaranteed that their assets would not be subject to the decisions of the video game creators, but that the property would belong to them, creating opportunities for second-hand markets.<\/p>\n<p><u>Fashion Sector<\/u><\/p>\n<p>Could the NFTS be key in the digitization of fashion?  It seems closer than ever that NFT fashion items are going to be more important than the ones we have now in real life, especially under the push of augmented reality.  Some companies already sell digital clothing as NFTs, which ensures clothing cannot be duplicated and also allows brands to create scarcity and exclusivity with their products.<\/p>\n<p><u>Music Industry<\/u><\/p>\n<p>The music industry is one of those that will inevitably be revolutionized by the NFTS, ceasing to be controlled by record labels, radio stations, etc.  and becoming controlled by its true creator.  An example is “Kings of Lion” that apart from releasing their new album in NFT format, put “Golden Tickets” on sale as NFTS that contain benefits for life, such as front row seats for any “Kings of Lion” concert. and exclusive visual art pieces representing the band and its legacy.<\/p>\n<p>Non-fungible tokens could bring many advantages to artists.  A photo or a song digitally signed with a digital certificate by its author could confer authenticity to that digital asset and would allow the artist to know who owns his works and control where they are published.  This could solve many of the current problems with intellectual property.<\/p>\n<p><u>Digital art in NFT format<\/u><\/p>\n<p>Three-dimensional metaverses are a great opportunity to turn the display and sale of crypto art into an even more immersive experience.  On many occasions, artists grant a license to exploit a work to the holder of the NFT that represents it.  However, most buyers hope that the works and their authors will become famous and increase their price in the market.  Like traditional art collectors, they make collections hoping that one of the works will multiply its value in the future.<\/p>\n<p>It is still early to know to what extent NFTS will become a mass phenomenon and not a passing fad.  The uses that last will be the ones that really make sense.  We hope we have clarified what NFTS are and whether or not you can jump on the bandwagon of this new virtual asset.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>6. Industrial sectors that could be transformed by NFTS But… what are NFTS in each industrial sector? NFTS are different in each sector and in some they can be a revolution. Among those that experts have pointed out as the most important, are: Gaming Sector One of the biggest problems in the gaming industry is [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":754,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/753"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=753"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/753\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/754"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=753"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=753"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=753"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}