{"id":756,"date":"2022-05-21T11:24:41","date_gmt":"2022-05-21T11:24:41","guid":{"rendered":"https:\/\/infobloom.site\/common-scams-uscis\/"},"modified":"2022-05-21T11:24:41","modified_gmt":"2022-05-21T11:24:41","slug":"common-scams-uscis","status":"publish","type":"post","link":"https:\/\/infobloom.site\/common-scams-uscis\/","title":{"rendered":"Common Scams |  USCIS"},"content":{"rendered":"<p>The wrong help can harm you.  Use this information to avoid immigration scams.<\/p>\n<p>Please do not pay or file any forms until USCIS updates the official re-registration information for your country.  Stay up to date at uscis.gov\/TPS.<\/p>\n<p>Beware of emails that appear to be from the USCIS New Delhi Field Office or the Department of State in India.  These messages contain attachments, indicate that you have been approved for a visa to come to the United States, or request money in exchange for processing your visa.  Messages like these could be scams, since: <\/p>\n<ul>\n<li>US government email addresses always end in &#8220;.gov&#8221;;<\/li>\n<li>USCIS will never send you an email stating that you have been approved for a diversity visa, immigrant visa, nonimmigrant visa, or any other type of immigration benefit;  Y <\/li>\n<li>USCIS will never ask you to wire money to a person (see Telephone and Email Payments section). <\/li>\n<\/ul>\n<p>Please visit the Department of State&#8217;s Fraud Warning website for additional information.<\/p>\n<p>The United States Citizenship and Immigration Services (USCIS) has received information that employers have received emails that appear to be from USCIS.  Employers must have a Form I-9, Employment Eligibility Verification, for each person on their payroll who is required to complete it.  All of these forms must be retained for a period of time.  Visit I-9 Central to learn more about Form I-9 retention, storage, and inspection.<\/p>\n<p>These emails contain the fraudulent email address news@uscis.gov.  The text of the email could contain the seals of USCIS and the Office of the Inspector General, your address, and a scam link button that will take you to uscis-online.org, a non-government email address.  You should never reply to those emails or click on the links.<\/p>\n<p>If you receive a fraudulent email requesting Form I-9 information from USCIS, report it to the Federal Trade Commission.  If you are not sure if it is fraudulent, forward the suspicious email to the USCIS webmaster.  USCIS will review the emails received and share them with the appropriate law enforcement agencies, as necessary.<\/p>\n<p>In many Latin American countries, the term &#8220;notary public&#8221; refers to something very different than what it means in the United States.  In various Spanish-speaking nations, &#8220;notarios&#8221; are attorneys with special legal credentials.  However, in the United States, notaries public are people appointed by state governments to witness the signing of important documents and administer oaths.  Being a “notary public” does not authorize a person to provide you with any immigration-related legal services.  Only an attorney or accredited representative working for an organization recognized by the Department of Justice (DOJ) can give you legal advice.  For more information, visit the DOJ Accreditation and Recognition Program webpage.<\/p>\n<\/p>\n<p>USCIS will never ask you to wire money to a person.  We do not accept Western Union, MoneyGram, Paypal, or gift cards as payment for immigration fees.  Also, we will never ask you to pay fees to someone over the phone or email.  You can pay some immigration fees online, but only if you pay through your USCIS online account and Pay.gov.<\/p>\n<p>Remember, you can find more information about online payments on our webpage on Paying USCIS Fees.<\/p>\n<p>USCIS does not administer the Diversity Immigrant Visa (DV) Program.  This program is administered by the Department of State.  The DV Program is also known as the visa lottery.<\/p>\n<p>Visit the Department of State&#8217;s website to learn more about the program, the requirements to participate, and how they notify those selected.  Remember that the DV program is free and the Department of State will never send you an email notifying you of your selection.<\/p>\n<p>Some websites claim to be affiliated with USCIS and offer step-by-step instructions on how to complete an immigration application or petition.  Make sure your information comes from USCIS.gov or another legitimate source affiliated with USCIS.  Make sure the address ends in .gov.<\/p>\n<p>Please remember that we will never ask you to pay to download USCIS forms.  Our forms are always free on our website.  You can also call 800-870-3676 to request copies of forms over the phone.  To request forms by mail, follow these instructions in English or Spanish.<\/p>\n<p>Beware of job offers offered by companies abroad or by mail.  If you receive a job offer by email before you leave your country and come to the United States, it could be a scam, particularly if you are asked for money in exchange for a job offer.<\/p>\n<p>Even if a job offer is legitimate, you are not allowed to work in the United States unless you have a Permanent Resident Card (Green Card) or an Employment Authorization Document (EAD) (legal permit). visa) or an employment-related visa that allows you to work for a particular employer.  Read the “Working in the United States” page.<\/p>\n<p>If you are currently in the United States on a student visa, contact your foreign student advisor (designated school official) at your school before accepting any employment.  If you are close to your graduation date and are applying for Optional Practical Training (OPT), read the instructions on the “Work in the United States” webpage.<\/p>\n<p>If you are an international student outside the United States and want to come to the country to study, make sure you apply to an accredited college or university.  Look on the Committee for Advanced Education website to see if your school is accredited.<\/p>\n<p>You must have a Form I-20, Certificate of Eligibility for Nonimmigrant Student Status, in order to travel.  Upon acceptance to a Student Exchange Visitor Program (SEVP) &#8211; by a certified school, a school official will give you one of the following:<\/p>\n<ul>\n<li>A Form I-20, Certificate of Eligibility for Nonimmigrant Student Status (F-1)<br \/>– for academic students and language students, or<\/li>\n<li>A Certified Form of Eligibility for Nonimmigrant Student Status (M-1)<br \/>– for vocational students.<\/li>\n<\/ul>\n<p>Schools that are not accredited cannot sponsor you for an F-1 student visa.<\/p>\n<p>Additional information about Form I-20 is available on the DHS website studyinthestates.dhs.gov or on our “Students and Employment” page.<\/p>\n<p>Sometimes, some companies and websites claim to be immigration experts or have special connections to the government.  They can also &#8220;guarantee&#8221; getting a visa, Permanent Resident Card, or work permit more quickly if you pay a fee.  Remember, USCIS does not make exceptions to normal processing times, and no one can obtain these services faster than the usual process.  Check case processing times online here.<\/p>\n<p style=\"margin-bottom:11px\">If you are a national of Afghanistan on a parolee in the United States, beware of people asking for personal information.  Our Information for Afghan Nationals page provides comprehensive information about what you need to do as an Afghan with a temporary stay permit.  When reviewing an email, always remember that:<\/p>\n<ul>\n<li>USCIS does not routinely send emails to inform you that you have been approved for a diversity visa, immigrant visa, nonimmigrant visa, or any other immigration benefit, except in certain situations.<\/li>\n<li>Emails from the US government always end with (.gov).<\/li>\n<li>If you don&#8217;t enter a physical address because you don&#8217;t think it&#8217;s safe to disclose it, you may receive emails from uscis.gov.  Please check the sender information to make sure it ends in .gov.<\/li>\n<li>USCIS will never ask you to transfer money to someone or pay fees other than through your myUSCIS account.  Please read the section on Payments by Phone or Email below.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>The wrong help can harm you. Use this information to avoid immigration scams. Please do not pay or file any forms until USCIS updates the official re-registration information for your country. Stay up to date at uscis.gov\/TPS. Beware of emails that appear to be from the USCIS New Delhi Field Office or the Department of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":757,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/756"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=756"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/756\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/757"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=756"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=756"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=756"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}