{"id":784,"date":"2022-05-22T02:06:27","date_gmt":"2022-05-22T02:06:27","guid":{"rendered":"https:\/\/infobloom.site\/is-this-how-the-open-english-scam-works\/"},"modified":"2022-05-22T02:06:27","modified_gmt":"2022-05-22T02:06:27","slug":"is-this-how-the-open-english-scam-works","status":"publish","type":"post","link":"https:\/\/infobloom.site\/is-this-how-the-open-english-scam-works\/","title":{"rendered":"Is this how the Open English scam works?"},"content":{"rendered":"<p>A Venezuelan woman feels cheated by this language company, which turned out to be a money-making machine for her at the tip of the unwary<\/p>\n<p>This is a space for free and independent expression that exclusively reflects the authors&#8217; points of view and does not compromise the thinking or opinion of Las2orillas.\n<\/p>\n<p>On September 15, 2014, very interested in improving my level of English, I made my enrollment in the famous online language school Open English.  Since I&#8217;m kind of clueless about the dates, I decided to domicile the payment of the installments to a credit card.  First error!<\/p>\n<p>The executive who sold me the subscription informed me that it was a one-year course (12 months).  That day the charge of the first installment and the first of the remaining 11 in 30 days was made.  Up to there everything ok.<\/p>\n<p style=\"padding-left: 30px;\"><strong>SECOND: DURATION<\/strong>.  This contract has a duration of 12 consecutive months counted from the date of subscription of this contract, which signed electronically will have full value between the parties.  This contract may be extended in accordance with the provisions of CLAUSE FOUR of this contract.<\/p>\n<p>Since my job required me to travel quite frequently at the time, I asked him if the course was activated immediately, to which the young man replied that it was activated when I first joined.  He also told me that once activated, I could put it on hold in case of vacation or trouble logging in.  That was perfect for me.<\/p>\n<p>After 3 months I made my first income.  However, I couldn&#8217;t as the key they sent me had expired by the time elapsed.  I called to have the problem solved and oh surprise, despite never having entered, I only had 9 months left of the course.  As much as I complained, it was not possible for them to recognize the 3 months that I had not used it.<\/p>\n<p>From there I dedicated myself to enter all the time I had available.  However, the platform is not as friendly as they say.  The private classes do not work as the commercial says, the teachers are not as attentive, the classes are not individual and the signal is not as good.<\/p>\n<p>When there were 4 months left before the contract ended, I called to cancel the course and they told me that I had to pay an additional 2 months as a penalty.  I decided not to cancel since in the end I was going to pay the same.<\/p>\n<p>The month of September 2015 arrives and I terminated the contract.  On March 15, 2016 I realize that they continue to charge me the monthly fees for the course.  I send messages on Twitter to @openenglishhep and they tell me that THE CONTRACT IS AUTOMATIC RENEWAL. This is the trap!<\/p>\n<p>1. When the purchase is made, they send an email with the terms and conditions.<br \/>2. The GUARANTEE period is only 7 days.  If you do not notify in that time there is no right to claims.<br \/>3. They never send a CONTRACT.  They sent it to me 18 months later and because I am claiming.<br \/>4. The contract in its fourth clause does mention automatic renewal.  It is the subscriber&#8217;s duty to call OPEN ENGLISH to say that they DO NOT WISH TO RENEW.  In case of not receiving this notification they will continue charging until the subscriber REALIZES and claims.<\/p>\n<p style=\"padding-left: 30px;\"><strong>FOURTH: AUTOMATIC EXTENSION OF THE SERVICE<\/strong>.  After completing the period of 12 month(s) -the &#8220;initial period&#8221;-, THE SUBSCRIBER may continue to enjoy the service on a monthly basis of automatic renewals, paying the monthly fraction equivalent to the amount indicated as &#8220;fee&#8221; in the Ninth Clause of this document -the &#8220;Renewal Price&#8221;- for each month whose price will remain stable and will not be modified.  To this end, THE SUBSCRIBER accepts that this contract will be renewed automatically, and that OPENENGLISH.COM is authorized to make the corresponding payments to the payment instrument that THE SUBSCRIBER has provided with the Renewal Price on the monthly anniversary date of your service, that is, thirty (30) days after the date of the last renewal -the &#8220;Renewal Date&#8221;-.  The renewal payment will be due on the Renewal Date.  In the event that THE SUBSCRIBER decides to terminate this contract after the initial period, he may do so at any time and during any renewal period by contacting an advisor of the Company through a telephone call to the number (0800) INGLES-2.  Once the Company receives your request to terminate the Service, the Company will cancel this Purchase Agreement associated with your Open English account.<\/p>\n<p>5. This clause also says that they will notify the subscriber before the end of the initial period and remind them of the automatic renewal of the contract.  In my case this call was never received.<\/p>\n<p style=\"padding-left: 30px;\">Before the end of the initial period, you will receive an electronic notification from OPENENGLISH.COM with a reminder of this automatic renewal facility.<\/p>\n<p>6. They also have a clause that says that they file the credit card data to be able to make any necessary charges.  The subscriber must call to request that they be deleted.  The question is: Who guarantees us that they really delete them?<\/p>\n<p style=\"padding-left: 30px;\">By providing your credit card, bank account or other payment information to the company, you acknowledge and agree that we may store your payment instrument information until you close your Open English Account and as set forth in the Privacy Policy, unless you request Open English Customer Service to delete your credit card and\/or bank account information, in which case it will not be deleted as stipulated in the Privacy Policy. <\/p>\n<p>7. They do not handle REFUNDS or protection against price increases during the term of the contract:<\/p>\n<p style=\"padding-left: 30px;\"><strong>6.6 Right to change prices.<\/strong> All prices related to the service are subject to change by the Company at any time, without notice and without any liability to you.  The Company does not offer price protection or refunds in the event of a price drop or promotional offer.<\/p>\n<p>8. And finally, they can change the terms and conditions without prior notice and they are effective immediately.  The subscriber must log in periodically to see if anything has changed:<\/p>\n<p style=\"padding-left: 30px;\"><strong>7.7 The Company&#8217;s right to change these Terms of Service<\/strong>.  The Company reserves the right, at its discretion, to change, modify, add or remove portions of these Terms of Service at any time, without notice to you.  All changes will take effect immediately.  In the event of any material changes, we will use commercially reasonable efforts to notify you and obtain your consent before implementing such changes.  We recommend that you check these Terms of Service periodically to see if there have been any changes.  Your continued use of the Service after such changes are posted constitutes your acceptance of those changes.<\/p>\n<p>My contact with Customer Service was in these terms:<\/p>\n<p>&#8216;You.  You are responsible for the charges since you did not call to cancel the renewal.  There is NO refund, if you don&#8217;t agree, then sue the company&#8217;.<\/p>\n<p>As you can see, you don&#8217;t win with these people.  In the end, I bought a 12-month course, used 2 months, and paid for 18.<\/p>\n<p>So any company makes money.  I hope this information helps others not to fall for this scam and lose their money.<\/p>\n<p>* The article was originally published in March 2016 at this link<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A Venezuelan woman feels cheated by this language company, which turned out to be a money-making machine for her at the tip of the unwary This is a space for free and independent expression that exclusively reflects the authors&#8217; points of view and does not compromise the thinking or opinion of Las2orillas. On September 15, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":785,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/784"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=784"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/784\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/785"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=784"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=784"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=784"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}