{"id":791,"date":"2022-05-22T07:47:23","date_gmt":"2022-05-22T07:47:23","guid":{"rendered":"https:\/\/infobloom.site\/do-not-fall-this-is-the-telephone-scam-that-has-ecuador-on-alert\/"},"modified":"2022-05-22T07:47:23","modified_gmt":"2022-05-22T07:47:23","slug":"do-not-fall-this-is-the-telephone-scam-that-has-ecuador-on-alert","status":"publish","type":"post","link":"https:\/\/infobloom.site\/do-not-fall-this-is-the-telephone-scam-that-has-ecuador-on-alert\/","title":{"rendered":"Do not fall!  This is the telephone scam that has Ecuador on alert"},"content":{"rendered":"<p><strong>(CNN Spanish) –<\/strong> Returning a missed call from an unknown and international number could be very expensive, literally: you are at risk of being the next victim of a phone scam that has been alerted in Ecuador since this week.<\/p>\n<p>Users, authorities and cell phone companies have warned about calls from Papua New Guinea (with the prefix 00675), which let the mobile ring just long enough for it to be recorded in the history, with the intention that the receiving person return the call.  The problem?  The costs generated by international communication.<\/p>\n<p>The Ecuadorian Telecommunications Regulation and Control Agency (Arcotel) issued a statement explaining what these phone calls consist of.  According to the entity, when the user returns the call, it causes an &#8220;economic amount that is charged to his mobile telephony plan or deducted from the balance that he maintains in his telephone plan.&#8221;<\/p>\n<p>Arcotel also explained that this fraud practice, which is known as &#8220;wangiri&#8221;, &#8220;is carried out with the use of telecommunications infrastructure located abroad and can cause considerable economic damage to those users who return the international call.&#8221;  Hence, he has insisted on the need for &#8220;for no reason&#8221; to return the call.<\/p>\n<p>For its part, the Movistar company also warned that the numbers from which the calls come have a special rate, so when they return it “an answering machine will prolong (the communication) as long as possible, the more minutes, the more dollars lost per victim. ”.<\/p>\n<p>Since the end of last May, the Federal Communications Commission of the United States had already warned about this type of scam, reporting on calls that people in that country received calls &#8220;from telephone numbers with three-digit area codes that appear to be national, but that are actually associated with international pay-per-call numbers.”  Although it appears in the statement that the communications generally come from Canada or the Caribbean, the method of deception appears to be the same.<\/p>\n<p>The entity also indicated that the charges may be for &#8220;connection&#8221; to an international line and high prices for each minute of call, which would appear in the telephone bill as a &#8220;premium service&#8221;.  In addition, he noted that &#8220;this scam appears to be a variation of another that involves fraudulent messages on telephone answering machines, in which the consumer is urged to call an unknown area code number to collect a prize or receive news of a sick relative &#8221; .<\/p>\n<p>However, since 2014, several international media reported on this deception strategy, called the missed call scam, and at that time it mainly affected the United States.<\/p>\n<p>These were the reports made by some users on social networks.<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"es\" dir=\"ltr\">I also received a missed call from Papua New Guinea, here I share the number for you to take into account.<br \/>It is a form of scam.  pic.twitter.com\/PwP7xAHYKP<\/p>\n<p>– Diego PT (@iDieG0L) July 18, 2017<\/p>\n<\/blockquote>\n<p>And others, once the news of the scam was known, opted for a dose of humor.<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"es\" dir=\"ltr\">They don&#8217;t even call you from New Guinea and you swear I&#8217;m going to call you.<\/p>\n<p>– Double V (@ValeriaVallejoZ) July 19, 2017<\/p>\n<\/blockquote>\n<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"es\" dir=\"ltr\">I&#8217;m the one who calls New Guinea back, and they hang up.<\/p>\n<p>&#8211; The A!  (@elaminiature) July 19, 2017<\/p>\n<\/blockquote>\n<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"es\" dir=\"ltr\">Now I realize the kind of friends and family I have, one can be dying in New Guinea and they don&#8217;t answer me 🙁<\/p>\n<p>— Frank (@cyberjoda) July 19, 2017<\/p>\n<\/blockquote>\n<p>\t\t\t\t\t\t\t\t<script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<p>(CNN Spanish) – Returning a missed call from an unknown and international number could be very expensive, literally: you are at risk of being the next victim of a phone scam that has been alerted in Ecuador since this week. Users, authorities and cell phone companies have warned about calls from Papua New Guinea (with [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":792,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/791"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=791"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/791\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/792"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=791"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=791"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=791"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}