{"id":798,"date":"2022-05-22T10:33:19","date_gmt":"2022-05-22T10:33:19","guid":{"rendered":"https:\/\/infobloom.site\/are-you-a-bbva-customer-beware-of-these-messages-because-they-are-a-scam-to-get-hold-of-your-account-present\/"},"modified":"2022-05-22T10:33:19","modified_gmt":"2022-05-22T10:33:19","slug":"are-you-a-bbva-customer-beware-of-these-messages-because-they-are-a-scam-to-get-hold-of-your-account-present","status":"publish","type":"post","link":"https:\/\/infobloom.site\/are-you-a-bbva-customer-beware-of-these-messages-because-they-are-a-scam-to-get-hold-of-your-account-present\/","title":{"rendered":"Are you a BBVA customer?  Beware of these messages because they are a scam to get hold of your account |  Present"},"content":{"rendered":"<p class=\"loc\">Madrid<\/p>\n<p>No, your account has not been deactivated or suffers from an anomaly that prevents you from accessing it.  It is just one more scam through which a group of cybercriminals tries to get hold of your BBVA bank account.  A new case of phishing through which attackers impersonate a renowned company or an official body with the aim of gaining our trust and being able to obtain our data in a much simpler way.<\/p>\n<p>This has been announced by the bank itself through its website, in which it warns about a fraudulent SMS campaign that tries to impersonate BBVA.  According to the company itself, cybercriminals pose as the bank to notify their recipients that unusual activity has been detected in their account.  As usual, and in order to fix the problem, the victim must verify her data on the bank&#8217;s website.<\/p>\n<h3>The new scams that threaten BBVA customers: this is how they try to trick you<\/h3>\n<p>However, the links embedded in these types of communications redirect to web pages that request personal and banking information.  From the full name or mobile phone number to the national identity document.  Also the access key to your account, with which those responsible for the attack obtain the key to gain control of it.  If you follow the instructions on this website, cybercriminals will be able to withdraw money from your account and even make purchases in your name without raising suspicion.<\/p><source  media=\"(max-width: 768px)\"\/><source  media=\"(max-width: 414px)\"\/><source  media=\"(max-width: 375px)\"\/><source  media=\"(max-width: 320px)\"\/><\/p>\n<p>This is how cybercriminals act.  \/BBVA<\/p>\n<p>Enlarge<\/p>\n<p>But this is not the only type of scam that has affected BBVA customers in recent days.  Just a few hours ago, the National Institute of Cybersecurity (Incibe) has warned of a second scam in which they ask you to update your data because your account has been deactivated.  As in the first case, it is just a strategy to redirect you to a fake web page from which they aspire to steal your data. <\/p><source  media=\"(max-width: 768px)\"\/><source  media=\"(max-width: 414px)\"\/><source  media=\"(max-width: 375px)\"\/><source  media=\"(max-width: 320px)\"\/><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653215599_701_Are-you-a-BBVA-customer-Beware-of-these-messages-because.jpg\" loading=\"lazy\" width=\"828\" height=\"621\"\/><\/p>\n<p>This is the attack in question.  \/ Incise<\/p>\n<p>Enlarge<\/p>\n<h3>Tips to avoid falling into the trap: these are the steps to follow<\/h3>\n<p>And how can we protect ourselves against this type of fraud?  BBVA recommends that we not provide personal or banking information on web pages that we have accessed from a link included in an SMS.  On the other hand, the company asks us to carefully review the links contained in the SMS in question and to observe if it includes strange words or characters.<\/p>\n<p>On the other hand, BBVA reminds its customers that the one-time codes are secret and that they will never ask for them by email, call or SMS: &#8220;These codes are only requested in the bank&#8217;s official applications and in specific processes that require it&#8221;.  For the same reason, and to avoid being the victim of any type of attack, be wary of all alarming messages or messages that have an urgent tone.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Madrid No, your account has not been deactivated or suffers from an anomaly that prevents you from accessing it. It is just one more scam through which a group of cybercriminals tries to get hold of your BBVA bank account. A new case of phishing through which attackers impersonate a renowned company or an official [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":801,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/798"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=798"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/798\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/801"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=798"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=798"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=798"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}