{"id":804,"date":"2022-05-22T11:37:19","date_gmt":"2022-05-22T11:37:19","guid":{"rendered":"https:\/\/infobloom.site\/this-person-owes-us-money-this-is-how-loan-apps-show-you-to-your-friends-and-family\/"},"modified":"2022-05-22T11:37:19","modified_gmt":"2022-05-22T11:37:19","slug":"this-person-owes-us-money-this-is-how-loan-apps-show-you-to-your-friends-and-family","status":"publish","type":"post","link":"https:\/\/infobloom.site\/this-person-owes-us-money-this-is-how-loan-apps-show-you-to-your-friends-and-family\/","title":{"rendered":"&#8220;This person owes us money.&#8221;  This is how loan apps show you to your friends and family"},"content":{"rendered":"<p>There is a huge list of instant loan apps that are committing different forms of digital extortion to force their customers to pay high interest rates.  Users who have fallen for them report that the collection methods include harassment, annoying calls and even memes with their photos that are sent to all the contacts saved on the device.<\/p>\n<p>Institutions like the<strong> Condusef and state prosecutors<\/strong> They have warned users not to fall for these applications, because most are not even regulated by the Mexican financial authorities.<\/p>\n<p>Groups and pages have been created on social networks to denounce these practices.  But day after day new apps appear, mainly on Google Play, which follow the same abuse system with their users.<\/p>\n<p><strong>Read also:<\/strong><\/p>\n<p>Through WhatsApp, the apps display the debtors with their contacts.  Photo: Twitter.<\/p>\n<p>Among the apps with the most complaints on the Internet are:<\/p>\n<ul>\n<li><strong>CashBox.<\/strong><\/li>\n<li><strong>  Magic Credits.<\/strong><\/li>\n<li><strong>  Yumi Cash.<\/strong><\/li>\n<li>CashMobile.<\/li>\n<li>Credit Weight.<\/li>\n<li>Cash ready.<\/li>\n<li>Expert.<\/li>\n<li>My Portfolio.<\/li>\n<li>Isi Credit.<\/li>\n<li>Cellular Credits.<\/li>\n<li>Lemony.<\/li>\n<li>Credit.<\/li>\n<li>Ready Buy.<\/li>\n<li>Ok credit.<\/li>\n<\/ul>\n<p><img loading=\"lazy\" class=\"size-full wp-image-60299\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653219439_161_This-person-owes-us-money-This-is-how-loan-apps.jpg\" alt=\"This person owes us money.  This is how loan apps show you to your friends and family 3\" width=\"1024\" height=\"1024\"   data-pagespeed-url-hash=\"2162529851\" onload=\"pagespeed.CriticalImages.checkImageForCriticality(this);\"\/>Different prosecutors have warned about the danger of these express loan apps.<\/p>\n<h3>Express credit apps abuse the needs of their users<\/h3>\n<p>The mode of operation of the express credit apps is the same: They offer loans of between one thousand and 10 thousand pesos without the need to verify income or the Credit Bureau.  They point out handling low commissions and payments in accessible subscriptions, but in the end they never respect the agreement.<\/p>\n<p>Many of the complaints made by users and collected in the media indicate that it was in the first months of the Covid-10 pandemic that many of the victims fell for the deception.<\/p>\n<p>The need to obtain money and the inability to obtain it through banks or duly regulated financial institutions, was what led many people to install these apps of <strong>miracle loans<\/strong><\/p>\n<p>However, mobile credit applications do not respect their own terms and conditions.  The credits generate interests that double, in a short time, the total amount of the loan.  In addition, complaints have been reported for commissions in movements such as money withdrawals and even in the payment deposits themselves.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-60301\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653219439_110_This-person-owes-us-money-This-is-how-loan-apps.jpg\" alt=\"Apps have access to personal information, contacts, and photos on the device.  Photo: Facebook.\" width=\"1080\" height=\"2138\"   data-pagespeed-url-hash=\"507729405\" onload=\"pagespeed.CriticalImages.checkImageForCriticality(this);\"\/>Apps have access to personal information, contacts, and photos on the device.  Photo: Facebook.<\/p>\n<h3><strong>Apps access to photos and contacts to extort money<\/strong><\/h3>\n<p>To obtain a loan, the user must give many permissions when downloading and installing the app.  If they are not accepted, you are not allowed to proceed.<\/p>\n<p>Apps will ask for unrestricted access to media files on the device;  to the contact list and other personal data stored in the cell phone.  Once they agree to these terms, the worst begins.<\/p>\n<p>The registration to obtain a loan begins with a personal data form, later you are asked for a photograph of a proof of address, an official identification and take a selfie to corroborate the face.<\/p>\n<p>The credit is approved quickly and in the first days the amount is reflected in the bank account that the user registered.  This is where the first problem starts.<\/p>\n<p>The app will begin charging commissions for movements such as withdrawals and deposits upon credit payment.  If the user begins to be delinquent and does not pay on time, interest rises quickly.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-60302\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653219439_414_This-person-owes-us-money-This-is-how-loan-apps.jpg\" alt=\"\" width=\"1280\" height=\"721\"   data-pagespeed-url-hash=\"2457029772\" onload=\"pagespeed.CriticalImages.checkImageForCriticality(this);\"\/>Most of these apps increased the number of users with the Covid-19 pandemic.<\/p>\n<p>In a short time, the debt increases exponentially and collection calls and notifications begin to the contact numbers that the user registered.<\/p>\n<p>The apps then employ a very aggressive digital extortion method.  With the data and the selfie that the user took, they create images and even offensive memes that are sent to all the contacts on their device, with the following messages:<\/p>\n<ul>\n<li>Do you know this debtor\/debtor?  You owe us money.<\/li>\n<li>Do you know ______?  This message is being sent to you because you are leaving it as a reference, asking you to please support us with the message so that you can pay off the debt you have with us (sic).<\/li>\n<li>Wanted person for fraud.  We ask for your support in locating this person.”<\/li>\n<\/ul>\n<p>The harassment of both the debtor and his contacts is daily, especially in WhatsApp messages.  Some users have also reported that people on the apps make harassing calls, threatening to harm their families if they don&#8217;t pay on time.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-60303\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653219439_548_This-person-owes-us-money-This-is-how-loan-apps.jpg\" alt=\"\" width=\"606\" height=\"1280\"   data-pagespeed-url-hash=\"3161884376\" onload=\"pagespeed.CriticalImages.checkImageForCriticality(this);\"\/>In addition to exposing debtors, the apps also threaten them with legal action.  Photo: Google Support.<\/p>\n<h3><strong>What can be done?<\/strong><\/h3>\n<p>Report and avoid them.  If a loan has already been obtained with these applications and the extortion messages have already started, which is recommended by the <strong>Condusef<\/strong> and state prosecutors is to report the case.  More information here.<\/p>\n<p>If possible, it is best to stay away from these apps and not even install them.  There are reports in the PlayStore that some of these contain viruses that damage the device and even make automatic transactions, without even having requested the loan.<\/p>\n<p>The best option to obtain a personal loan is duly established banks or financial institutions, with trusted family or friends, and the option of going to pawnshops should not be ruled out.<\/p>\n<p>Any type of &#8220;miracle loan&#8221;, that is not clear in its terms and commissions, either digitally or with lenders, is a potential fraud that, in addition to generating more debts, will cause problems in the personal lives of users.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There is a huge list of instant loan apps that are committing different forms of digital extortion to force their customers to pay high interest rates. Users who have fallen for them report that the collection methods include harassment, annoying calls and even memes with their photos that are sent to all the contacts saved [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":810,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/804"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=804"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/804\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/810"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=804"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=804"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=804"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}