{"id":811,"date":"2022-05-22T12:09:34","date_gmt":"2022-05-22T12:09:34","guid":{"rendered":"https:\/\/infobloom.site\/6-tips-against-scams-dont-fall-for-health-scams\/"},"modified":"2022-05-22T12:09:34","modified_gmt":"2022-05-22T12:09:34","slug":"6-tips-against-scams-dont-fall-for-health-scams","status":"publish","type":"post","link":"https:\/\/infobloom.site\/6-tips-against-scams-dont-fall-for-health-scams\/","title":{"rendered":"6 tips against scams: Don&#8217;t fall for health scams"},"content":{"rendered":"<p><iframe title=\"Cómo evitar el fraude a la salud\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/zlSauklz1AE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n<\/p>\n<p>Español<\/p>\n<p>Fake product!  Danger!  Health fraud alert!<\/p>\n<p>You&#8217;ll never see these warnings on health products, but that&#8217;s what you should think of when you see claims like &#8220;miracle cure,&#8221; &#8220;guaranteed results,&#8221; or &#8220;a vaccine alternative.&#8221;<\/p>\n<p>Health fraud scams have been around for hundreds of years and prey on the desire for a quick or miracle cure.  The snake oil salesmen of yesteryear have morphed into today&#8217;s deceptive high-tech marketers, preying on people&#8217;s desire for easy solutions to difficult health problems like Alzheimer&#8217;s, arthritis, cancer, diabetes, memory loss, sexual performance, weight loss, coronavirus disease 2019 (COVID-19), influenza, and other infectious diseases.<\/p>\n<p>According to the Food and Drug Administration (FDA), a health product is fraudulent if it is falsely promoted as effective against a disease or health condition, but has not been scientifically proven to be safe and effective for that purpose.<\/p>\n<h2>It&#8217;s not worth the risk<\/h2>\n<p>Fraudsters promote their products with cunning marketing methods, often using tactics that target specific populations via the web and email, but also through word of mouth, newspapers, magazines, television, and direct mail.  Health fraud abounds on social media and closed messaging apps like Signal, Viber, WhatsApp and Facebook Messenger.<\/p>\n<p>Health fraud can also be found in other places, such as convenience stores, gas stations, flea markets, and non-traditional stores, targeting people with limited English proficiency and limited access to services and information. about health.  Other risks include potentially dangerous or untested products that are ordered directly from foreign sources by mail order to bypass normal customs inspections, the FDA, and other security measures.<\/p>\n<p>Consumers can increase their chances of identifying and avoiding health fraud by focusing on being smart, aware and careful when buying health products.<\/p>\n<h2>Tips<\/h2>\n<p>Here are six tips to help you identify scams.<\/p>\n<ol>\n<li><strong>One product does it all<\/strong>.  Be suspicious of products that claim to cure a wide range of illnesses.  The agency continues to send out warning letters and take appropriate enforcement action against companies that market bogus cure-all products.  These miracle cures do not exist, they are fake, and the only thing these companies sell is false hope.<\/li>\n<li><strong>Personal testimonials of &#8220;success&#8221;.<\/strong> Success stories, such as &#8220;It cured my diabetes&#8221; or &#8220;Immediately stopped my COVID-19 infection,&#8221; are easy to make up and are no substitute for scientific evidence.  Reviews found on popular online marketplaces and social media may be false. <\/li>\n<li><strong>Fast solutions<\/strong>.  Few diseases or conditions can be treated quickly, even with legitimate products.  Beware of phrases like, &#8220;Lose 30 pounds in 30 days,&#8221; &#8220;protects from viral infections,&#8221; or &#8220;eliminates skin cancer in days.&#8221;<\/li>\n<li><strong>&#8220;All natural&#8221; cure or treatment.<\/strong> Don&#8217;t be fooled by descriptions like &#8220;all natural cure&#8221;.  These phrases are often used in health fraud to draw attention and suggest that a product is safer than conventional treatments.  These terms do not necessarily mean that they are safe.  Some plants found in nature (such as poisonous mushrooms) can be harmful or even deadly when eaten.  In addition, the FDA has found numerous products promoted as &#8220;all natural&#8221; cures or treatments that contain hidden and dangerously high doses of ingredients in prescription drugs or other active pharmaceutical ingredients.<\/li>\n<li><strong>&#8220;Miracle Cure&#8221;.<\/strong> Your alarms should go off when you see this or similar claims, such as &#8220;new discovery,&#8221; &#8220;guaranteed results,&#8221; or &#8220;secret ingredient.&#8221;  If an actual cure for a serious disease were approved by the FDA, it would be widely reported through the media and prescribed by licensed health professionals;  it would not be placed in ads on social media and messaging apps, nor would it be hidden on websites, print ads, and TV infomercials.<\/li>\n<li> <strong>Conspiracy theories.<\/strong> Claims like &#8220;This is the cure our government or Big Pharma don&#8217;t want you to know about&#8221; are used to distract consumers from the obvious, common sense questions about the supposed miracle cure.<\/li>\n<\/ol>\n<h2>A widespread problem<\/h2>\n<p>Fraudulent products not only fail to deliver on their unsubstantiated promises, they can cause serious injury or even death.  In addition to wasting money and delaying life-saving diagnoses and scientifically tested and proven treatments, fraudulent products sometimes contain hidden pharmaceutical ingredients that can be harmful when unknowingly ingested by consumers.<\/p>\n<p>For example, in recent years, FDA labs have found hundreds of weight-loss products, illegally marketed as dietary supplements, that contained sibutramine, a Schedule IV controlled substance and the active ingredient in a prescription weight-loss drug.  This prescription drug was withdrawn from the US market after studies showed it was associated with an increased risk of heart attack and stroke.  In addition, fraudulent products may be manufactured in unregistered facilities under unknown, unclean, or dangerous conditions.<\/p>\n<p>Health fraud can involve a variety of FDA-regulated products.  For example, the FDA uncovered an expensive laser device being sold with fraudulent cure-all claims to treat cancer, HIV\/AIDS, and diabetes.  Three people were sentenced to prison for their role in the $16.6 million fraudulent scheme to distribute counterfeit branded devices.<\/p>\n<p>Even with these tips, fraudulent health products aren&#8217;t always easy to spot.  If consumers are tempted to purchase an unproven product or product with questionable claims, they should first consult their physician or other health care professional.<\/p>\n<h2>How to report adverse events to the FDA<\/h2>\n<p>Consumers who experience adverse reactions to a product should voluntarily submit an adverse event report to the FDA using:<\/p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Español Fake product! Danger! Health fraud alert! You&#8217;ll never see these warnings on health products, but that&#8217;s what you should think of when you see claims like &#8220;miracle cure,&#8221; &#8220;guaranteed results,&#8221; or &#8220;a vaccine alternative.&#8221; Health fraud scams have been around for hundreds of years and prey on the desire for a quick or miracle [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":812,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/811"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=811"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/811\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/812"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=811"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=811"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=811"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}