{"id":813,"date":"2022-05-22T12:41:50","date_gmt":"2022-05-22T12:41:50","guid":{"rendered":"https:\/\/infobloom.site\/what-are-non-fungible-tokens-nfts\/"},"modified":"2022-05-22T12:41:50","modified_gmt":"2022-05-22T12:41:50","slug":"what-are-non-fungible-tokens-nfts","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-non-fungible-tokens-nfts\/","title":{"rendered":"What are Non-Fungible Tokens NFT&#8217;s?"},"content":{"rendered":"<h2 class=\"elementor-heading-title elementor-size-default\">What is an NFT?<\/h2>\n<p>Although the crypto community has grown and established itself as currencies that allow us to transact and change value as a traditional currency would, <b>non-exchangeable tokens (NFT)<\/b> have been growing in popularity, slowly but surely. <b>NFTs enable digital scarcity and provable ownership of unique assets<\/b>.<\/p>\n<h4>The example<\/h4>\n<p>An easy way to understand NFTs is through the example of books;  when you buy a physical book, you can decide to keep it, lend it, or sell it, the book truly BELONGS TO YOU.  On the other hand, when it comes to a digital book, what you have is the right to use that book, but you cannot lend it, or sell it… maybe you can lend the device with which you read the book, but not the book itself same… <b>That is exactly what NFT technology is about to change.<\/b><\/p>\n<h2><strong><i>What then are Non-Fungible Tokens (NFT)<\/i>?<\/strong><\/h2>\n<h3><b>unique<\/b><\/h3>\n<p>Each NFT contains within its code information that describes the properties of each token that make them different from the others.  A digital artwork may have encoded information about individual pixels, while tokenized game items may contain details that allow the game client to understand what item the player owns and the attributes of the player.<\/p>\n<h3><b>traceable<\/b><\/h3>\n<p>Every NFT has a record of on-chain transactions, from when it was created, including every time it changed hands.  This means that each token can be verified and known to be not a fake, obviously a very important thing for owners and potential buyers!<\/p>\n<h3><b>Programmable<\/b><\/h3>\n<p>Like all traditional digital assets and tokens built on the smart contract blockchain, NFTs are fully programmable.  The advantage of being &#8216;programmable&#8217; is that they create automation.  When you own an NFT, you acquire benefits and maybe even duties, so being part of a smart and automated contract, the parties don&#8217;t have to worry about signing lengthy documents, rather the purchase of the NFT replaces those traditional contracts that demand so long.<\/p>\n<p>In other words, NFTs combine the best features of decentralized blockchain technology with non-transactional assets.  Unlike regular digital assets that are issued and regulated by centralized entities, which can be taken from you at any time, it is possible to actually own and control your own NFTs.  This is the difference between buying a digital asset in a game, or on a platform, and buying an NFT.<\/p>\n<h3><b>They are limited and scarce<\/b><\/h3>\n<p>For NFTs to be attractive to buyers, they are likely to be in short supply.  This ensures that the assets remain desirable in the long term and that supply does not outstrip demand.  However, we are just beginning to see more and more interesting projects where rarity is not necessarily the priority.<\/p>\n<h3><b>Indivisible<\/b><\/h3>\n<p>Most NFTs cannot be traded as fractions of a whole.  Just like you can&#8217;t buy half a concert ticket or trading card, NFTs can&#8217;t be broken down into smaller denominations.  However, it is possible to have NFTs that together are part of a larger asset, such as financing through different NFTs the purchase of a building, a house or other assets.<\/p>\n<p>    \t\t\t\t<\/p>\n<p>Open information resources focused on the dissemination and construction of knowledge in the different disciplines of education.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is an NFT? Although the crypto community has grown and established itself as currencies that allow us to transact and change value as a traditional currency would, non-exchangeable tokens (NFT) have been growing in popularity, slowly but surely. NFTs enable digital scarcity and provable ownership of unique assets. The example An easy way to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":815,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/813"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=813"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/813\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/815"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=813"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=813"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=813"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}