{"id":816,"date":"2022-05-22T13:14:10","date_gmt":"2022-05-22T13:14:10","guid":{"rendered":"https:\/\/infobloom.site\/nfts-grew-by-11000-in-one-year-is-it-a-good-idea-for-brands-to-consider-them-a-strategy\/"},"modified":"2022-05-22T13:14:10","modified_gmt":"2022-05-22T13:14:10","slug":"nfts-grew-by-11000-in-one-year-is-it-a-good-idea-for-brands-to-consider-them-a-strategy","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nfts-grew-by-11000-in-one-year-is-it-a-good-idea-for-brands-to-consider-them-a-strategy\/","title":{"rendered":"NFTs grew by 11,000% in one year.  Is it a good idea for brands to consider them a strategy?"},"content":{"rendered":"<p>If following the news is part of your routine, you have probably come across the word NFT several times in the last few months.<\/p>\n<p>The acronym for Non-Fungible Token was chosen as the word of the year by the Collins Dictionary, with a meteoric growth in its use of more than 11,000% in 2021.<\/p>\n<p>The reason for this increase is that last year NFTs generated $23 billion in trades according to the 2021 Dapp Industry Report. That&#8217;s why everyone wants to know how to enter this multi-billion dollar market.<\/p>\n<p>Companies from all over the world have joined the NFT race as a way to rethink their brand and be closer to markets that are still little explored.  But what are NFTs anyway?<\/p>\n<p>Keep reading to understand more about the topic!<\/p>\n<h2>About NFT and Blockchain<\/h2>\n<p>As we already said, <strong>NFT is the acronym for Non-Fungible Token.  In technology, the word Token can be defined as a digital representation of an asset.  In turn, Non-Fungible means something cannot be replaced by something else.<\/strong>.<\/p>\n<p>An easy way to exemplify what a non-expendable good is is the art market: <strong>How many Van Gogh paintings are worth a Mona Lisa?<\/strong> There is no such relationship, since they are unique, different and irreplaceable works.  Instead, you can exchange a $10 bill for 2 $5 bills because they are fungible.<\/p>\n<p>These unique, distinct and irreplaceable electronic codes are recorded by the blockchain system, which is the same technology used in cryptocurrencies such as Bitcoin.  The blockchain system records transactions in an encrypted form and, in theory, the information included in the blockchain cannot be changed.<\/p>\n<p>Thus, <strong>the unique file of the digital asset is connected to the unique certificate generated by the blockchain<\/strong>guaranteeing the authenticity and ownership of that asset.<\/p>\n<p>An NFT is a unique digital certificate, registered on a blockchain, used to record ownership of an asset, such as a piece of art or a collectible.<\/p>\n<p>Any person or company can link their assets, whether digital or physical, to an NFT, they just need to find a company that provides the service and a fee is usually paid for the creation of these digital assets.<\/p>\n<p>These assets are typically traded on marketplaces, such as OpenSea and Rarible, which act as storefronts where NFT owners can leave them exposed for bids to buy.<\/p>\n<h2>How do brands use them and what results do they get?<\/h2>\n<p>NFTs became popular due to million-dollar transactions for works of art such as Beeple&#8217;s The First 5000 Days and for celebrities who joined the movement as members of a club that has exclusive assets.<\/p>\n<p>Neymar, Jimmy Fallon, Eminem and Snoop Dogg have images of algorithmically generated monkeys, the Bored Ape Yacht Club, bought for millions of dollars.<\/p>\n<p><\/p>\n<p>Although they became famous due to these events, NFTs are an emerging technology.  There is a blue ocean of possibilities for brands and we can already see some micro-trends emerging due to new behaviors and technological innovations.<\/p>\n<p>After its popularization, it was possible to observe companies from various sectors adopting brand strategies using NFTs as a proxy to connect with customers and do new business.<\/p>\n<h2>Outfit<\/h2>\n<p>Some companies have been working with the connection between the physical and the digital.  This is the case of companies such as GAP and Adidas, which have created NFT collections that allow the buyer to access physical pieces exclusively.<\/p>\n<p>The strategy behind these initiatives is mainly aimed at <strong>maintain an active spirit of community and exclusivity behind the brands<\/strong>strengthening the idea of <strong>create fan clubs<\/strong> and build customer loyalty.<\/p>\n<p>Other clothing brands have decided to adopt collaborative strategies.  This is the case of Gucci and Nike, who invested in shares with companies and artists to create clothing collections available on NFT in exclusive alliances, expanding their visibility and reputation.<\/p>\n<blockquote class=\"instagram-media\" data-instgrm-captioned=\"\" data-instgrm-permalink=\"https:\/\/www.instagram.com\/tv\/CY3-Ic5hsD0\/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"14\" style=\" background:#FFF; border:0; border-radius:3px; box-shadow:0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width:540px; min-width:326px; padding:0; width:99.375%; width:-webkit-calc(100% - 2px); width:calc(100% - 2px);\"\/>\n<p>By the way, Adidas also jumped on this trend of collaborations and launched a collaboration collection with Bored Ape Yacht Club, the same one with celebrity jumpsuits.<\/p>\n<p>It is possible to see brand penetration in association with digital gaming markets, for example.  This guarantees brands access to customers on a platform previously little explored in terms of marketing: GAMES.<\/p>\n<h3>Food Sector<\/h3>\n<p>NFTs are not exclusive to the garment industry.  In the food sector, McDonalds adopted a visibility strategy to touch the hearts of its most loyal consumers in the United States on the occasion of the celebration of the 40th anniversary of the fast food chain&#8217;s favorite hamburger: <strong>the McRib<\/strong>.<\/p>\n<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">i present to u the most important NFT.  RT for a chance to win one of ten exclusive #McRibNFT<\/p>\n<p>don&#8217;t purch.  nec  50 US\/DC, 18+ only.  winners need crypto wallet to receive NFT.  rules: https:\/\/t.co\/2QRhsPlpur pic.twitter.com\/KYmWI67PhG<\/p>\n<p>— McDonald&#8217;s (@McDonalds) November 1, 2021<\/p><\/blockquote>\n<p>For the launch of the hamburger, a campaign was carried out where customers who retweeted an invitation would participate in the draw for the network&#8217;s first NFT, thus increasing the visibility of the brand on one of the most visited social networks in the world.<\/p>\n<h3>Entertainment<\/h3>\n<p>When it comes to entertainment, companies are already connecting familiar passions and habits with the digital world of NFTs. <strong>Have you ever gone to a concert or a game and saved your ticket?<\/strong><\/p>\n<p>In 2021, a collector paid $260,000 for the first ticket to a Michael Jordan NBA game.  The so-called &#8220;collectibles&#8221; have been part of popular culture for many years and now have new versions in the digital world.<\/p>\n<p>The NFL launched digital NFT tickets at the last Super Bowl in 2022. The strategy here is to offer a personalized product to fans of the game and enhance their game-day experience by upgrading an old habit of collectors.<\/p>\n<p>Coachella, one of the most famous music festivals in the world, has also started using NFT in its brand strategies.<\/p>\n<p>The brand has launched a collection of NFTs that guarantee advantages and benefits to token owners, such as:<\/p>\n<ul>\n<li>lifetime access to the event;<\/li>\n<li>VIP gifts;<\/li>\n<li>physical copies of event photo books;<\/li>\n<li>among others.<\/li>\n<\/ul>\n<p>In addition to strategies similar to others already presented here, such as exclusivity and community, Coachella went even further.  Part of the proceeds from the sale of NFTs will be used for actions in charities. <strong>As a result, brands are also using NFTs in social impact strategies.<\/strong>.<\/p>\n<p><img alt=\"\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653225250_691_NFTs-grew-by-11000-in-one-year-Is-it-a.png\"\/><strong>NFT tickets on the NFL website.  Source: <\/strong>NFL<\/p>\n<p>I could spend hours here writing about the most amazing ways companies have found to use NFTs to their advantage when it comes to business marketing.  But let&#8217;s get to the point.<\/p>\n<h2>The &#8220;dark side&#8221; of NFTs<\/h2>\n<p>As you already know, NFTs are linked to a digital certificate through the blockchain.  What you may not know is that the encryption process to ensure network security consumes a lot of energy and carbon emissions, which generates environmental impacts on the planet.<\/p>\n<p>Therefore, NFTs are still not well regarded due to the global concern about the ecological footprint in the world.  There are now initiatives from some blockchain companies that aim to reduce the energy consumption for the creation of NFTs to reverse this negative situation.<\/p>\n<p>In addition to environmental issues, the digital security and legality issues behind NFTs should also be highlighted. <\/p>\n<p>We are still dealing with emerging technologies and we do not have a robust enough technological, security and legal system to deal with some situations.  These are important factors to consider when adopting NFT in your branding strategy.<\/p>\n<h2>So… are NFTs a good strategy?<\/h2>\n<p>Well, that&#8217;s the million dollar question.  As a specialist in business management, what I think is that the worst thing a company can do is not position itself in the face of market opportunities.  It is not yet possible to say if NFTs are just hype or here to stay, but many brands are already using them in challenges that everyone already knows: <strong>get closer to your audience!<\/strong><\/p>\n<p>It&#8217;s like asking companies in 2010 if being on Facebook is a good branding strategy.  Realize that we are looking to solve the challenges, but through a different technology.<\/p>\n<p>In any case, it is possible to see that there is a great transformation in the way that brands communicate with their consumers, creating experiences and connecting with their public in a way never before imagined.<\/p>\n<p>With NFTs it is possible <strong>redefine the sense of community, strengthen the loyal customer base, bring authenticity and give a voice to your consumers with positive results<\/strong>.  And this can be applied not only to clothing, food or entertainment companies.<\/p>\n<p>Tech, sports, and even real estate companies are using NFT as a form of business.  It is attractive for brands to invest in NFTs as a way to expand not only sales, but also revenue through cryptocurrencies.<\/p>\n<p>According to Statista, there are around 81 million blockchain wallet users worldwide as of February 2022, up from 69 million the previous year.<\/p>\n<p>It is access to a financial market not yet explored by brands and a new way of accessing financial resources that are in the possession of consumers in the virtual environment.  However, you should be careful when deciding to use new technologies in your branding strategy.<\/p>\n<p>It is important to have people on your team who understand marketing strategies well, but this will not be enough to achieve good results with NFTs.  It is also necessary to have people who understand technology, blockchain, metaverse, etc.<\/p>\n<p>Furthermore, like any marketing strategy, <strong>it is important to understand your buyer persona so that you can achieve the best results<\/strong>.  You must be up to date on all marketing trends, but more than that, understand if your audience is interested in this trend.<\/p>\n<p>You need to charm your audience and increase awareness of your brand and your business.  So maybe NFT, metaverse, TikTok or other new trends are not for your specific audience.  Do not forget: <strong>strategy comes before tactics<\/strong>.<\/p>\n<p>The effort to reach your audience and generate a positive impact on your brand has been reduced with advances in media and easy access to new technologies.  It is necessary to think of all the possibilities of using technologies in favor of brands, thus glimpsing opportunities for those who know how to look to the future. <\/p>\n<p>We are not just talking about NFTs as an art object, but about the whole chain behind the technology, like Blockchain and other virtual experiences like the metaverse.  The future is right in front of us, companies must face it, interpret it and discover what makes sense for them.<\/p>\n<p><script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><script async defer src=\"https:\/\/platform.instagram.com\/en_US\/embeds.js\"><\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If following the news is part of your routine, you have probably come across the word NFT several times in the last few months. The acronym for Non-Fungible Token was chosen as the word of the year by the Collins Dictionary, with a meteoric growth in its use of more than 11,000% in 2021. The [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":819,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/816"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=816"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/816\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/819"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=816"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=816"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=816"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}