{"id":82,"date":"2022-05-03T10:34:11","date_gmt":"2022-05-03T10:34:11","guid":{"rendered":"https:\/\/infobloom.site\/the-dark-side-of-nfts-scams-money-laundering-and-contamination\/"},"modified":"2022-05-18T11:37:40","modified_gmt":"2022-05-18T11:37:40","slug":"the-dark-side-of-nfts-scams-money-laundering-and-contamination","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-dark-side-of-nfts-scams-money-laundering-and-contamination\/","title":{"rendered":"The dark side of NFTs: scams, money laundering and contamination"},"content":{"rendered":"<p>Non-Fungible Tokens (NFTs) are everywhere these days. You can hear about them in collections, markets, and even games. They are unique digital items with a subjective and variable price, desirable for collectors. And also desirable for criminals? <strong>Well, probably yes. It turns out that NFTs have a dark side.<\/strong><\/p>\n<p>Of course, potential contamination is probably the most discussed thing about it. But this is just the tip of the iceberg and surprisingly something that can be easily solved (in theory). Unfortunately, like most tools in this world, NFTs can also be used for evil. Let&#8217;s explore these misuses and how to combat them.<\/p>\n<h2><strong>Dark side one: NFT scams<\/strong><\/h2>\n<p>According to the Non-Fungible analytics page, more than $2.1 billion has been spent on NFT sales in total. That is the perfect figure to attract scammers of all kinds. They have already developed three main ways to steal users&#8217; funds and NFTs: impersonating support services, giving fake gifts, and even building and promoting fraudulent projects from scratch.<\/p>\n<p><\/p>\n<p>Let&#8217;s start with support services. When users of the different NFT marketplaces need some kind of help, they can contact the platform&#8217;s support. And they usually do this through discord, which has become a hub for the crypto world. Legitimate members of such platforms are there, <strong>but the scammers are there too, waiting for victims<\/strong>.<\/p>\n<p>The scammers then send them private messages and make them think they are helping. Until they ask for screen sharing to snatch the victim&#8217;s private keys from a MetaMask QR code. Many wallets have been emptied this way, including NFTs.<\/p>\n<p>This is why marketplaces like OpenSea have an SOS button in place. This allows users to lock their own account if they suspect it has been compromised. MetaMask also took action by temporarily disabling its mobile QR code sync feature (exploited by scammers).<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p dir=\"ltr\" lang=\"en\">The way this attack is happening is that people are told to go to OpenSea Discord and post their support ticket, the attackers monitor these channels and then contact people posing as OpenSea support, armed with information about your support claim. pic.twitter.com\/m4NWyU1zea<\/p>\n<p>— Sean Bonner Ⓥ (@seanbonner) August 24, 2021<\/p><\/blockquote>\n<p>Apart from these, <strong>there is some community fundraising for victims and a couple of &#8220;rescue bots&#8221; <\/strong>make automatic low offers to scammers to retrieve the parts and return them to the original owners.<\/p>\n<h3><strong>More false promises<\/strong><\/h3>\n<p>For its part, the fake gifts are classic at this point. Dark side NFT scammers offer a so-called freebie, only if participants send them &#8220;small amounts&#8221; first. Of course, they never return anything. NFT scam projects require more work as they are entire web pages and even completely new concepts. The easiest way for scammers is replicating existing marketplaces (phishing), like OpenSea or Rarible. In this way, they would steal people&#8217;s private keys.<\/p>\n<p>But there is another option. <strong>They may also promise to create new NFTs or even create a game or DeFi platform that will never come.<\/strong>. For example, we already talked about counterfeiting. NFT Marvel Marketplace that appeared in June. They promised to create Marvel-themed NFTs and launched a fundraising campaign for it. At this point, the website no longer exists and the investors did not get their money back.<\/p>\n<p><img class=\"wp-image-7541\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1651574047_623_The-dark-side-of-NFTs-scams-money-laundering-and-contamination.jpg\" alt=\"NFT-Marvel-Marketplace-Scam\" width=\"1024\" height=\"479\" \/>NFT Marvel Marketplace &#8220;incoming&#8221;. Are the links not working. Source screenshot<\/p>\n<p>Something similar happened with the “Evolved Apes” project. A developer nicknamed &#8220;Evil Ape&#8221; promised to make &#8220;a collection of 10,000 unique NFTs trapped within a lawless land&#8221; and include them in a game. Shortly after, they disappeared with over $2 million from investors. At least the community came together to create “Fight Back Apes”, a legitimate project based on the previous one.<\/p>\n<p>It is difficult to differentiate legitimate projects from scams in this case. The authors of legitimate projects in the world of cryptocurrencies are usually anonymous (such as Satoshi Nakamoto himself). <strong>Therefore, it is very important to do a thorough research of each project before investing.<\/strong>and never bet an amount you can&#8217;t afford to lose.<\/p>\n<h2><strong>Dark Side Two: NFT Money Laundering<\/strong><\/h2>\n<p>We already talked about the most expensive NFT ever sold. As you know, they sell for millions of dollars a piece. After all, art is subjective. It is likely that most buyers really appreciate the value of these pieces of digital art to that extent. But we can&#8217;t say that about everyone. Sometimes the sole purpose of buying NFTs at such high prices is none other than money laundering.<\/p>\n<p><img class=\"wp-image-8123\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1651574048_900_The-dark-side-of-NFTs-scams-money-laundering-and-contamination.jpg\" alt=\"Dark Side NFT Wash\" width=\"1024\" height=\"682\" \/><\/p>\n<p>AJ Woloszynski of the US accounting firm EisenAmper explains it clearly:<\/p>\n<blockquote class=\"wp-block-quote\"><p>“Someone looking to &#8216;clean&#8217; dirty money could, in theory, generate (or buy) an anonymous NFT; put it up for sale on the blockchain; buy it yourself from an unregulated and anonymous digital wallet with illicit funds; and then recognize the money as legitimate funds from the sale of the artwork.&#8221;<\/p><\/blockquote>\n<p>At the very least, this trick would generate about 20% in capital gains taxes in the United States. Apparently, people who use crypto to buy NFTs will still have to pay taxes in this country. <strong>However, there is another way to evade taxes using NFT<\/strong>. As described by CryptoWhale:<\/p>\n<blockquote class=\"wp-block-quote\"><p>“Tax evasion through NFTs can also be easily accomplished using the same strategies employed with physical art: mint eleven NFTs, sell one to a friend for $10,000, donate the other ten for a $100,000 loss. Easy peasy!&#8221;<\/p><\/blockquote>\n<p>This is exactly the reason why countries like Panama are already planning their own NFT regulations. Likely popular marketplaces like OpenSea, Rarible, Foundation or Nifty Gateway <strong>will start applying the same verification measures as crypto exchanges<\/strong> (KYC\/AML) eventually.<\/p>\n<h2><strong>Dark Side Three: Possible NFT Contamination<\/strong><\/h2>\n<p>The pollution that these works of art can generate is much discussed these days. Some people think that NFTs only have a dark side because they are an environmental disaster, but that is far from the truth. However, they are not perfect either. The main argument against NFTs (and some cryptocurrencies) is the high electricity usage required to issue and verify them.<\/p>\n<p><img class=\"wp-image-8124\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1651574049_120_The-dark-side-of-NFTs-scams-money-laundering-and-contamination.jpg\" alt=\"NFT contamination from the dark side\" width=\"1024\" height=\"597\" \/><\/p>\n<p>Proof-of-Work (PoW) cryptocurrency mining purposefully uses a lot of electricity to solve complex math problems before minting new coins. This offers a lot of security to blockchain networks. But the downside, again, is the high power usage. If this energy is produced with fossil fuels, that means more air pollution and more global warming.<\/p>\n<p><strong>Currently, most NFTs are issued through systems based on Ethereum, a PoW blockchain.<\/strong> (yet). According to Digiconomist, Ethereum uses 80.3 TWh per year and has a carbon footprint of 38.18 Mt (million tons) of CO2, “comparable to the carbon footprint of Slovakia”. But wait, because the comparisons go further.<\/p>\n<p>Banking consumes about 639 TWh per year. Considering that 1 KWh produces approximately 1 pound of carbon dioxide (CO2), this industry alone would release 319.5 Mt CO2 into the atmosphere. Gold mining consumes around 138.9 TWh per year, which translates into 69.4 Mt of CO2. Fossil fuel producers make no less than 923 billion tons of CO2 [Proyecto de divulgación de carbono]. In fact, just 100 of these companies emit 70% of global CO2 emissions.<\/p>\n<p><img class=\"wp-image-7315\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1651574050_703_The-dark-side-of-NFTs-scams-money-laundering-and-contamination.jpg\" alt=\"bitcoin-tesla-energy-green\" width=\"1024\" height=\"576\" \/><\/p>\n<p>Also, not all transactions on Ethereum involve NFTs. They are still a small part in comparison. Not to mention that this blockchain has plans. migrate to the Proof of Stake (PoS) system, which requires no power. And speaking of which <strong>there are (literally) hundreds of other NFT markets based on PoS systems<\/strong> [CleanNFTs].<\/p>\n<h2><strong>Are NFTs so bad?<\/strong><\/h2>\n<p>Short answer: no. NFTs are a tool that can be used by anyone around the world, just like cryptocurrencies in general (and traditional money). They can be used for bad and for good. First of all, NFTs are a very valuable tool for artists.<\/p>\n<p>Before them, digital art was a very difficult sell at the best of times. NFTs have opened the doors for talent around the world. Additionally, this technology provides an extra layer for creators: royalties. The owner may have the NFT but does not own the copyright to the work per se. So, in several cases, every time a work is sold, a percentage automatically goes into the artist&#8217;s wallet.<\/p>\n<p><img class=\"wp-image-8125\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1651574051_646_The-dark-side-of-NFTs-scams-money-laundering-and-contamination.jpg\" alt=\"Artist-NFTs-wallet-Ethereum\" width=\"1024\" height=\"682\" \/><\/p>\n<p>And yes, they have also been used for good. For example, <strong>Art Blocks, a platform for programmable works of art on Ethereum,<\/strong> <strong>raised $23.5 million for charity in August<\/strong>. Their artists are willing to donate between 10% and 25% of their profits. And that&#8217;s not all. Initiatives like NFT Forever on Binance Smart Chain (BSC) allow artists and investors to use NFTs to help others.<\/p>\n<p>NFTs have a dark side, but that&#8217;s not all they have to offer. For the most part, they are a useful tool that has allowed us to discover a whole new world of possibilities.<\/p>\n<p class=\"has-text-align-center\">Do you want to trade BTC, ETH and other tokens? You can do it safely in Alfacash! And do not forget that we are talking about this and many other things on our social networks.<\/p>\n<p><script async=\"\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Non-Fungible Tokens (NFTs) are everywhere these days. You can hear about them in collections, markets, and even games. They are unique digital items with a subjective and variable price, desirable for collectors. And also desirable for criminals? Well, probably yes. It turns out that NFTs have a dark side. Of course, potential contamination is probably [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":89,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/82"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=82"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/82\/revisions"}],"predecessor-version":[{"id":584,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/82\/revisions\/584"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/89"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=82"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=82"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=82"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}