{"id":820,"date":"2022-05-22T13:46:24","date_gmt":"2022-05-22T13:46:24","guid":{"rendered":"https:\/\/infobloom.site\/these-are-4-relevant-trends-about-cryptocurrencies-and-nfts-for-2022\/"},"modified":"2022-05-22T13:46:24","modified_gmt":"2022-05-22T13:46:24","slug":"these-are-4-relevant-trends-about-cryptocurrencies-and-nfts-for-2022","status":"publish","type":"post","link":"https:\/\/infobloom.site\/these-are-4-relevant-trends-about-cryptocurrencies-and-nfts-for-2022\/","title":{"rendered":"These are 4 relevant trends about cryptocurrencies and NFTs for 2022"},"content":{"rendered":"<ul>\n<li>Digital assets such as cryptocurrencies and NFTs have become very popular around the world in recent months.<\/li>\n<li>The constant adoption and growing interest in the crypto ecosystem by the general population will make digital assets begin to be implemented in different fields.<\/li>\n<li>These are four relevant trends regarding the crypto ecosystem for 2022, according to experts from Chainalysis.<\/li>\n<li>Do you already know our Instagram account?  Follow us.<\/li>\n<\/ul>\n<p>Digital assets have gained a lot of relevance around the world in recent months.  Concepts like cryptocurrencies, non-fungible tokens (NFTs) and Decentralized Finance (DeFi) now seep into everyday conversations more easily, showing that there is a growing interest in understanding them.<\/p>\n<p>However, the crypto field is still fluctuating and with various controversies and complexities.  In the last year alone, cryptocurrency-related crimes reached an all-time high;  in turn, the use of NFTs for scams and money laundering has increased, not to mention the problem they present for the environment.<\/p>\n<p>While the crypto ecosystem is one of constant change and trouble that indicates that strong regulation is more important than ever, there are several trends that will be relevant during 2022, according to experts at Chainalysis.<\/p>\n<h2>The NFT market will continue to grow and evolve due to increased adoption<\/h2>\n<p>One of the digital assets that has dominated the conversation in recent months has been NFTs, by proposing new ways to generate money.<\/p>\n<p>NFTs allow a certificate of authenticity to be associated with any virtual object, which makes them unique;  In addition, they do not wear out when used and are irreplaceable, characteristics that considerably increase their value.<\/p>\n<p>NFT trading is more retail oriented than cryptocurrency trading in general.  In turn, more and more people are entering this market, which, according to Chainalysis, registered transactions for more than 40,000 million dollars (mdd) in 2021.<\/p>\n<p>The popularity of NFTs has grown in such a way that today it is common for various celebrities, artists and even video game companies to launch their own collections.<\/p>\n<p>In turn, it is increasingly common to see auctions of this type of digital asset, even in Mexico.  Such is the case of an NFT painting sold for more than 90,000 pesos last year. <\/p>\n<p>In turn, companies have emerged that facilitate the buying and selling of these digital assets.  An example is OpenSea, a company founded in 2017 and considered the first and largest marketplace for NFT trading.<\/p>\n<p>As a consequence, the NFT market will continue to transform and evolve, according to Ethan McMahon, an economist at Chainalysis.<\/p>\n<p>&#8220;We anticipate that the market for NFTs will continue to evolve as more artists, creators, celebrities, and even game developers issue new collections to their fans, in addition to many other uses that have yet to be invented,&#8221; he said.<\/p>\n<h2>An all-in-one platform for digital asset transactions is just around the corner<\/h2>\n<p>Decentralized Finance or DeFi has become very popular in the world.  These are blockchain-based financial products that essentially do not require intermediaries to work.<\/p>\n<p>The concept has gained so much popularity that the World Economic Forum believes it has the potential to transform the financial system;  however, its users face a challenge: so far there is no platform where crypto investments, NFTs and DeFi solutions can interact at the same time and in a simple way.<\/p>\n<p>“In 2021, DeFi and NFTs have shown that there is more to crypto than just investing.  However, these opportunities lie outside conventional consumer channels,” says Philip Gradwell, chief economist at Chainalysis.<\/p>\n<p>“One of the main lessons of Web 2.0 was that consumers love platforms;  I don&#8217;t think that will change for Web 3.0.  Currently, there is no cryptocurrency platform that takes ownership of the customer relationship and takes vendors into account,” he adds.<\/p>\n<p>According to Chainalysis, the company that develops this all-in-one platform first will not only have an advantage over its competitors, but will also dominate the segment.<\/p>\n<h2>Cryptocurrencies will be essential for future criminal investigations<\/h2>\n<p>Although digital assets have been implicated in various scams and money laundering cases, Gurvais Grigg, director of public sector technology at Chainalysis, says that they can represent a solution to many forms of cybercrime.<\/p>\n<p>Illicit activities of this nature are here to stay.  But, if the global adoption of cryptocurrencies continues to evolve, the education of law enforcement improves and the investment in cybersecurity of companies increases,” says Grigg.<\/p>\n<p>“Soon, cryptocurrencies will no longer be seen as an obstacle.  These will start to be recognized as a valuable tool to help us take down criminals,” he adds.<\/p>\n<h2>Governments Will Adapt To Crypto…Eventually<\/h2>\n<p>The growing popularity of digital assets has taken the financial system and governments worldwide by surprise;  however, little by little, more and more laws are emerging that seek to adapt them to the general economy.<\/p>\n<p>In Mexico, the Law to Regulate Financial Technology Institutions published in 2018 partially regulates cryptocurrencies.  For its part, the Fintech Law required Banxico to publish a series of regulations on digital assets in the Mexican financial system.<\/p>\n<p>The agency defined these assets as &#8220;a unit of information that does not represent the holding of any underlying asset at par, and that is uniquely identifiable, even fractionally, stored electronically.&#8221;  In turn, it ruled that financial institutions can carry out operations with this type of assets for internal purposes only;  the foregoing subject to prior authorization by the Bank.  This means that Mexican financial institutions are not authorized to carry out or offer transactions with virtual assets to the general public.<\/p>\n<p>However, although it is perfectible, this regulation is not restrictive for the development of the crypto ecosystem in Mexico.  Banxico has even stated that the operating criteria do not prevent other types of companies, other than financial institutions, from offering services related to digital assets.<\/p>\n<p>Such is the case of digital currency exchange houses.  As long as they do not carry out activities to collect or safeguard funds in local currency, they can continue to operate;  however, they must do so with prior authorization from Banco de México, or they could be fined.<\/p>\n<p>By having this partial regulation, discussions about it have lost ground on the government agenda;  however, some legislators have shown their interest in restarting the discussions to deepen the regulation of crypto assets.<\/p>\n<p>Other markets, such as Europe and the United States, have begun to regulate the use of cryptocurrencies, and this could become a global trend.<\/p>\n<p>Despite these advances, we are still far from a solid regulatory framework around digital assets, according to Salman Banaei, director of public policy at Chainalysis.<\/p>\n<p>&#8220;While I don&#8217;t see a regulatory framework in place by the end of 2022, I do believe there will be new bills, hearings, and constructive discussions on digital assets that will pave the way for a 2023 with greater clarity within the sector around the world,&#8221; said.<\/p>\n<p><strong>NOW READ:<\/strong> More and more video game companies announce NFT projects, but gamers are not happy about it<\/p>\n<p><strong>ALSO READ:<\/strong> Tourism, consumption and fast food chains are spearheading payment with cryptocurrencies, study shows<\/p>\n<h3><strong>Discover more stories at <\/strong><strong>Business Insider Mexico<\/strong><\/h3>\n<h4><strong>Follow us on <\/strong><strong>Facebook<\/strong><strong>, <\/strong><strong>Instagram<\/strong><strong>, <\/strong><strong>LinkedIn<\/strong><strong>, <\/strong><strong>Twitter<\/strong><strong> Y <\/strong><strong>Youtube<\/strong><\/h4>\n<h4>NOW GO:<\/h4>\n<p>\n<iframe title=\"La obra de NFT que podría cambiar el mundo del arte\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/Pj9TKLNNq98?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Digital assets such as cryptocurrencies and NFTs have become very popular around the world in recent months. The constant adoption and growing interest in the crypto ecosystem by the general population will make digital assets begin to be implemented in different fields. These are four relevant trends regarding the crypto ecosystem for 2022, according to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":821,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/820"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=820"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/820\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/821"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=820"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=820"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=820"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}