{"id":822,"date":"2022-05-22T14:18:36","date_gmt":"2022-05-22T14:18:36","guid":{"rendered":"https:\/\/infobloom.site\/the-nft-bay-claims-to-share-multi-terabyte-archive-of-pirated-nfts-torrentfreak\/"},"modified":"2022-05-23T13:16:29","modified_gmt":"2022-05-23T13:16:29","slug":"the-nft-bay-claims-to-share-multi-terabyte-archive-of-pirated-nfts-torrentfreak","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-nft-bay-claims-to-share-multi-terabyte-archive-of-pirated-nfts-torrentfreak\/","title":{"rendered":"&#8220;The NFT Bay&#8221; Claims to Share Multi-Terabyte Archive of &#8216;Pirated&#8217; NFTs * TorrentFreak"},"content":{"rendered":"<p class=\"article__excerpt\">\n<p>NFTs are unique blockchain entries through which people can prove that they &#8216;own&#8217; something. However, the underlying images can be copied with a single click. This point is illustrated by The NFT Bay which links to a 19.5 Terabyte collection that supposedly includes &#8216;all NFTs&#8217; on the Ethereum and Solana blockchains. And it comes with an important warning message too.<\/p>\n<p><\/p>\n<p>NFTs have been booming over the past year. People are willing to pay millions of dollars just to prove that they “own” a digital item that was worthless before.<\/p>\n<p>These digital entries, stored on a blockchain, allow the buyers to prove that they are legitimate owners. While it&#8217;s different from a copyright, NFTs owners are rightsholders in a sense.<\/p>\n<h2>The NFT Bay<\/h2>\n<p>However, that doesn&#8217;t mean that other people can&#8217;t copy the associated files, which are often widely available. This is made pretty clear by The NFT Bay, which launched just a few hours ago. The site, which is clearly inspired by The Pirate Bay, claims to share a torrent with “pirated” versions of NFTs.<\/p>\n<p><strong>Update: <\/strong>We haven&#8217;t verified the content of the archive and after publication ClubNFT reported that the release doesn&#8217;t include all NFTs. We updated this article accordingly but left most of the original text intact.<\/p>\n<p>“The Billion Dollar Torrent,” as it&#8217;s called, reportedly includes all the NFTs on the Ethereum and Solana blockchains. These files are bundled in a massive torrent that points to roughly 15 terabytes of data. Unpacked, this adds up to almost 20 terabytes.<\/p>\n<p><center><img class=\"alignnone size-full wp-image-211742 lazyload\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653229116_385_The-NFT-Bay-Claims-to-Share-Multi-Terabyte-Archive-of-Pirated.jpg\" alt=\"geoff tweet\" width=\"540\" height=\"514\" \/><\/center>Australian developer Geoff is the brains behind the platform, which he describes as an art project. Speaking with TorrentFreak, he says that The Pirate Bay was used as inspiration for nostalgic reasons, which needs further explanation.<\/p>\n<h2>Too Much for PRQ<\/h2>\n<p>The NFT Bay itself lists a few examples of “pirated” NFT images but these uploads point to the same massive torrent file. Downloading the torrent can be a challenge as it requires quite a bit of disk space. In fact, finding a hosting solution for the seedbox wasn&#8217;t straightforward either.<\/p>\n<p>“For authenticity I was going to host at PRQ but unfortunately they don&#8217;t offer servers with enough disk space,” Geoff notes.<\/p>\n<p>This comment may not mean much to the general public. However, veteran followers of file-sharing news will recognize PRQ as the former hosting partner of The Pirate Bay, launched by the site&#8217;s founders Gottfrid Svartholm and Fredrik Neij.<\/p>\n<p>The developer eventually hosted the torrented NFT archive elsewhere. And despite the massive size and the attention it&#8217;s getting, both the site and seedbox are running smoothly.<\/p>\n<p>“The seedbox hosting the torrent has 4 x 10TB SATA drives configured in RAID0 and the website is humming along just fine even though the website is going insanely viral,” Geoff says.<\/p>\n<h2>Wake Up Call<\/h2>\n<p>The NFT Bay is not just any random art project. It does come with a message, perhaps a wake-up call, for people who jump on the NFT bandwagon without fully realizing what they&#8217;re spending their crypto profits on.<\/p>\n<p>“Purchasing NFT art right now is nothing more than directions on how to access or download an image. The image is not stored on the blockchain and the majority of images I&#8217;ve seen are hosted on Web 2.0 storage which is likely to end up as 404 meaning the NFT has even less value.”<\/p>\n<p>The same warning is more sharply articulated in the torrent&#8217;s release notes which are styled in true pirate fashion.<\/p>\n<p>“[T]his handy torrent contains all of the NFT&#8217;s so that future generations can study this generation&#8217;s tulip mania and collectively go…” it reads.<\/p>\n<p><center><img class=\"alignnone size-full wp-image-211740 lazyload\" src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653229116_967_The-NFT-Bay-Claims-to-Share-Multi-Terabyte-Archive-of-Pirated.jpg\" alt=\"nft release notes\" width=\"550\" height=\"432\" \/><\/center>Fifteen years ago this would have been a project The Pirate Bay could have come up with. It&#8217;s a thought-provoking piece of art that shows that ownership can be a trivial concept, especially in the digital realm.<\/p>\n<h2>Greed and Scams<\/h2>\n<p>This is not to say that all NFTs are useless and have no future. Some will probably remain very valuable. However, people who aspire to own them should understand how they work and what they represent. And making a personal copy of is probably a good start.<\/p>\n<p>Geoff himself appears to be quite critical of the NFT hype. While the software developer believes in the possibilities that Web 3.0 can offer, today&#8217;s implementations often result in greed and scamming, which he describes as sickening.<\/p>\n<p>He doesn&#8217;t own CryptoPunk, obviously.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>NFTs are unique blockchain entries through which people can prove that they &#8216;own&#8217; something. However, the underlying images can be copied with a single click. This point is illustrated by The NFT Bay which links to a 19.5 Terabyte collection that supposedly includes &#8216;all NFTs&#8217; on the Ethereum and Solana blockchains. And it comes with [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":823,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/822"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=822"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/822\/revisions"}],"predecessor-version":[{"id":906,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/822\/revisions\/906"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/823"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=822"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=822"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=822"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}