{"id":846,"date":"2022-05-22T16:59:55","date_gmt":"2022-05-22T16:59:55","guid":{"rendered":"https:\/\/infobloom.site\/ebay-allows-you-to-sell-nfts-thus-being-a-pioneer-among-traditional-online-sales-platforms\/"},"modified":"2022-05-22T16:59:55","modified_gmt":"2022-05-22T16:59:55","slug":"ebay-allows-you-to-sell-nfts-thus-being-a-pioneer-among-traditional-online-sales-platforms","status":"publish","type":"post","link":"https:\/\/infobloom.site\/ebay-allows-you-to-sell-nfts-thus-being-a-pioneer-among-traditional-online-sales-platforms\/","title":{"rendered":"eBay allows you to sell NFTs, thus being a pioneer among traditional online sales platforms"},"content":{"rendered":"<p>The fever of the NFT (abbreviations in English of &#8216;Non-Fungible Tokens&#8217;) continues in what seems to be its great year and the <strong>The latest development in this regard is that the traditional platform for buying and selling eBay products<\/strong> also accepts from today (Tuesday) the transaction of these NFT.<\/p>\n<p>eBay <strong>allows the sale of non-fungible tokens of digital collectibles<\/strong>such as trading cards, images or video clips, on its platform, being the first traditional e-commerce platform to take advantage of the recent frenzy around NFTs, as Reuters recalls.<\/p>\n<p> What are NFTs and why does a kitten avatar SELL for $115.00<\/p>\n<h2>eBay is a pioneer with this ad<\/h2>\n<p>    <\/p>\n<p>in the art world <strong>NFTs have become very common<\/strong> (This year millionaire transactions have been made).  But eBay is the forerunner in accepting these digital pieces on a conventional buying and selling platform. <\/p>\n<p>Short term, <strong>an inventory of NFTs will be provided to sellers who meet eBay standards<\/strong>, the company has told Reuters.  The objective is to be able in the future to add the offer of programs, policies and tools that allow buying and selling NFTs in a wider range of categories.<\/p>\n<p>Jordan Sweetnam, eBay&#8217;s senior vice president and general manager for the North American market, has said that in the coming months the company will add new features where <strong>Blockchain-powered NFT collectibles expected on platform<\/strong>. <\/p>\n<p>    <img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653238794_542_eBay-allows-you-to-sell-NFTs-thus-being-a-pioneer.jpeg\" alt=\"The NFT revolution in the &quot;art&quot;: They pay 1.36 million euros for a gray pixel at auction\"\/><\/p>\n<p>It should be remembered that, although traditional platforms, <strong>eBay is the first to open up to NFTs<\/strong>there is a place called Bitski, which is a startup that aims to become a kind of &#8216;Shopify for NFTs&#8217;. <\/p>\n<p>Bitski&#8217;s goal is to offer a wide range of subscription plans that <strong>allow brands and celebrities to offer their own &#8220;digital storefronts&#8221; to sell NFTs<\/strong>in such a way as to spare both sellers and buyers some of the crypto complexities of this market.<\/p>\n<h2>The year of the NFT in art and on social media<\/h2>\n<p>  <img class=\"sf-lazy centro_sinmarco\"  src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653238795_805_eBay-allows-you-to-sell-NFTs-thus-being-a-pioneer.jpeg\" alt=\"nft\"\/>  <\/p>\n<p>Last March, the London auction house Christie&#8217;s held its first auction of digital art and the experience ended with the sale of the NFT of the crypto artist Beeple for 69 million dollars.  At that time, his work became the most expensive work of digital art in history and placed its author, in addition, among the three most successful living artists.<\/p>\n<p>Another important event was carried out by Jack Dorsey, CEO of Twitter, also in March.  On the first weekend of the month he asked his followers, &#8220;do you want to buy this tweet?&#8221;  Y <strong>put up for sale his first message published through Twitter in 2006<\/strong> (where it said &#8220;Just setting up my twttr&#8221;), in the form of a non-fungible token (NFT). <\/p>\n<p>In April Sotheby&#8217;s, one of the world&#8217;s leading art and collectibles auction houses, witnessed a milestone in history, art and technology: a one-pixel NFT (non-fungible token) was purchased by $1.36 million. <\/p>\n<p>Another of the great recent events regarding this phenomenon came from the sale of a meme.  Zoë Roth, better known as &#8220;Disaster Girl&#8221;, sold the original copy of her meme a few days ago (a well-known photograph in the Roth, as a child, appeared smiling at the camera while a house behind her was on fire), in the form of NFT (non-fungible token) for 180 ethers, worth nearly $500,000.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The fever of the NFT (abbreviations in English of &#8216;Non-Fungible Tokens&#8217;) continues in what seems to be its great year and the The latest development in this regard is that the traditional platform for buying and selling eBay products also accepts from today (Tuesday) the transaction of these NFT. eBay allows the sale of non-fungible [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":850,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/846"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=846"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/846\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/850"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=846"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=846"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=846"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}