{"id":851,"date":"2022-05-22T17:32:10","date_gmt":"2022-05-22T17:32:10","guid":{"rendered":"https:\/\/infobloom.site\/xifras-scam\/"},"modified":"2022-05-22T17:32:10","modified_gmt":"2022-05-22T17:32:10","slug":"xifras-scam","status":"publish","type":"post","link":"https:\/\/infobloom.site\/xifras-scam\/","title":{"rendered":"Xifra&#8217;s scam"},"content":{"rendered":"<p>Today at 9:00 in the morning there will be an event called Momentum World Tour at Hacienda de los Morales with the aim of promoting a company called<\/p>\n<p>Xifra Group that promises prosperity and extraordinary returns that will take anyone with a little capital to a state of unparalleled abundance, is the second event in Mexico City, they have already been in Puebla and are going to other cities in the country .<\/p>\n<p>When reviewing the advertising of this company about which some people have asked me on social networks, I found that a well-known face among those who promote Xifra Group, which also calls itself Xifra Lifestyle, is Sergio Peñuñuri, who is now called not only president, but royal president in Xifra.  Peñuñuri is a veteran in this type of scheme.  I found out about it in 2016 when a friend asked my advice on whether to invest in a cryptocurrency called Space Coin which was also called SCoin, I went to find out and it became very obvious that it was a pyramid scheme and one of its main drivers in Mexico was Peñuñuri.<\/p>\n<p>Obviously at the end of that year it was evident to many investors that they had fallen into a fraud but between the pain of disappointment and the fact that it is not easy to file a complaint practically nobody did anything, besides the amounts are not that high and the defrauded probably will not have reached two thousand to which is added that they were geographically dispersed and these scammers bet on this.  Each geographical region was controlled by a group of multilevel fraudsters who paid a kind of franchise for the brand and the pages that supposedly showed the cryptocurrencies, also giving them the right to invite someone from the global corporate, at that time they invited Ante Kelava, who by the way to cover himself later he sued CoinSpace.  The Peñuñuris are usually very non-technical, but specialized in multilevel sales based on aspirational and self-improvement concepts.<\/p>\n<p>In the case of Xifra Lifestyle, they offer a &#8220;license&#8221; of 100, 300, 500, and so on progressively until they reach 50,000 dollars and supposedly they begin to give daily dividends to achieve a monthly return of 13 percent, that is, little more than 150 percent a year, here I would put emoticons of faces dying of laughter, dear reader.  What explains the supposed profitability?  the answer is “trading” in cryptocurrencies, binary schemes, forex, health wellness products and cannabis crops, that is to say a great amalgamation of bullshit.<\/p>\n<p>Do not believe, dear reader, that the performance can be withdrawn at the end of the month, of course not, the performance is withdrawn when you have already accumulated profits for 200 percent of the cost of the license, which occurs at least in a year and medium, if all goes according to plan the scammers and their henchmen will be somewhere hatching the next scheme in a year and a half but that&#8217;s not all.  Naturally they offer 8 percent commission for each guest who invests and 2 percent of the guest&#8217;s guest&#8217;s investment amount, plus there are binary bonuses for team building and matching bonuses, then there are also schemes for investing in cannabis plantations , etc etc.  I mean, it&#8217;s a nice full-fledged pyramid.<\/p>\n<p>The founder is a guy named George Goodman whose LinkedIn profile only has two sections, founder of Xifra and who studied at the University of Texas, although he doesn&#8217;t say what he studied, we must admit that they have already sold franchises in Europe.  Anyway, if you know someone tell them to stay away and hopefully this time the National Banking and Securities Commission, led by Juan Pablo Graf Noriega, will do something like the Condusef, headed by Óscar Rosado Jiménez.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today at 9:00 in the morning there will be an event called Momentum World Tour at Hacienda de los Morales with the aim of promoting a company called Xifra Group that promises prosperity and extraordinary returns that will take anyone with a little capital to a state of unparalleled abundance, is the second event in [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":852,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/851"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=851"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/851\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/852"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=851"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=851"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=851"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}