{"id":855,"date":"2022-05-22T18:36:39","date_gmt":"2022-05-22T18:36:39","guid":{"rendered":"https:\/\/infobloom.site\/do-nfts-require-regulation-to-trade-goods\/"},"modified":"2022-05-22T18:36:39","modified_gmt":"2022-05-22T18:36:39","slug":"do-nfts-require-regulation-to-trade-goods","status":"publish","type":"post","link":"https:\/\/infobloom.site\/do-nfts-require-regulation-to-trade-goods\/","title":{"rendered":"Do NFTs require regulation to trade goods?"},"content":{"rendered":"<p>                    <\/p>\n<p class=\"autorDate\">Saturday, February 5, 2022<\/p>\n<p>NFTs (Non-Fungible Tokens), as digital assets supported by blockchain technology, allow goods to be traded digitally, generating million-dollar sales of works of art, songs, videos, collectibles, among others.  Of course, the Meta company, understanding the current importance of the use of NFTs, is analyzing the usefulness of capitalizing on them by supporting itself in its two most significant social networks, that is, Facebook and Instagram;  Indeed, these social networks could add functions and mechanisms for users to promote the purchase and sale of goods using NFTs, which implies a growth in the digital economy.<\/p>\n<p>Based on the foregoing, it is appropriate to analyze the concept of the Metaverse, which takes place in a virtual online space and connects multiple users who can work, socialize, buy, sell and play, among others, in 3D spaces.  Needless to say, some platforms contain Metaverse-like elements, for example, video games currently provide the closest Metaverse experience.  Thus, NFTs and the Metaverse are closely related and, additionally, they are capable of altering the traditional paradigm of social networks, that is, they will change the interaction, socialization and transaction, to the extent that the transformation of the real world materializes. to a decentralized virtual environment, known as the Metaverse.<\/p>\n<p>Does the need for regulation arise?  For a certain sector of the doctrine it is required.  For example, in 2021, the Luxembourg Parliament approved the Blockchain II Law, which allows, among other activities, the issuance of dematerialized securities directly on DLT devices (distributed ledger technology), which are digital systems that allow users record transactions related to digital assets.  Certainly, this example can highlight the need to create regulation that is at the forefront of technological developments, which encourage the digital and decentralized economy.<\/p>\n<p>In the same way, regulatory advances have been evidenced in European countries, such as Germany, or Latin American countries, such as El Salvador, for example, in the face of the transactionality of crypto assets and the implementation of blockchain technology.  It is emphasized that in the United States an important bill is under debate, related to technological antitrust, which seeks to significantly reform the laws around Big Tech, a project that could have a considerable impact on companies such as Amazon, Apple , Google and Meta.<\/p>\n<p>In conclusion, although regulatory sandboxes for crypto assets and blockchain have been presented in Colombia, a regulatory update is inescapably necessary in order to implement technological developments such as NFTs, a regulatory update that requires an arduous task of State policy.  Indeed, the implementation of the NTFs for the purchase and sale of goods through social networks can have complications in the face of current Colombian regulations, since they cannot be understood as a value in the face of Law 964 of 2005, this is, they do not meet the requirements of this law to be considered as such;  Per se, the NTFs are a right of a negotiable nature, but they are not part of an issue, they do not have as their object or effect the capture of resources from the public and, of course, they do not have liberating power in Colombia.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Saturday, February 5, 2022 NFTs (Non-Fungible Tokens), as digital assets supported by blockchain technology, allow goods to be traded digitally, generating million-dollar sales of works of art, songs, videos, collectibles, among others. Of course, the Meta company, understanding the current importance of the use of NFTs, is analyzing the usefulness of capitalizing on them by [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":856,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/855"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=855"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/855\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/856"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=855"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=855"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=855"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}