{"id":861,"date":"2022-05-23T09:48:11","date_gmt":"2022-05-23T09:48:11","guid":{"rendered":"https:\/\/infobloom.site\/government-will-install-a-physical-and-virtual-casino-to-buy-and-sell-nfts-with-cryptocurrencies\/"},"modified":"2022-05-23T13:17:25","modified_gmt":"2022-05-23T13:17:25","slug":"government-will-install-a-physical-and-virtual-casino-to-buy-and-sell-nfts-with-cryptocurrencies","status":"publish","type":"post","link":"https:\/\/infobloom.site\/government-will-install-a-physical-and-virtual-casino-to-buy-and-sell-nfts-with-cryptocurrencies\/","title":{"rendered":"Government will install a physical and virtual casino to buy and sell NFTs with cryptocurrencies"},"content":{"rendered":"<p>The announcement was made by a company called Astro Babies, which is dedicated to selling and buying NFTs, a kind of digital file that is traded with cryptocurrencies.  The casino will also &#8220;work&#8221; in the metaverse, according to the company.<\/p>\n<p>The Salvadoran government and a company dedicated to the sale and purchase of NFTs (Non-Fungible Tokens) will build a physical and virtual casino that will be used for this type of activity.<\/p>\n<p>The administration of Nayib Bukele has not made any official announcement, however, it was the same company called Astro Babies that gave the first announcement about the project, without specifying what the planning process for said casino has been and it is only known that it will be in San Salvador.<\/p>\n<p>In theory, the casino will also function as a VIP club, that is, for &#8220;very important people&#8221; and will have a presence in the metaverse, that is, in virtual reality.<\/p>\n<p><strong>You can read: The Government would have already spent up to $120 million to promote the use of Chivo Wallet<\/strong><\/p>\n<p>According to a video published by the company, the place will have a terrace, bar area, disco, restaurant.<\/p>\n<p>The only government official who has confirmed this information was Mónica Taher, director of Technological and Strategic Affairs of the Secretariat of Commerce and Investments of the Presidency of the Republic, who also pointed out that the company that will issue these NFTs works on the Solana blockchain. .<\/p>\n<p>The foregoing means that the transactions of that casino would be carried out in a chain of blocks different from the one that Bitcoin works, the cryptocurrency with which salvadorans have become more familiar in recent months and which has not been accepted by the majority of the population despite government support.<\/p>\n<p>According to specialized sites, Solana (abbreviated as SOL) is one of the cryptocurrencies that grew the most in 2021 along with Ethereum, another cryptoactive that is most used in non-fungible token transactions.<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">@astrobabiesnft would like to Officially Announce the Development of #AstroCasino, an NFT based Crypto Casino in Partnership with the Government of #ElSalvador.#Solana #SolanaNFTs #Bitcoin #NFT #Crypto @nayibbukele @monicataher pic.twitter.com\/OjX6J2CXrx<\/p>\n<p>— Astro Babies (@AstroBabiesNFT) January 19, 2022<\/p><\/blockquote>\n<p><strong>But what is an NFT?<\/strong><\/p>\n<p>In the last year these digital products have taken a greater boom, having been marketed for up to millions of dollars.  According to the BBC, they are a kind of digital representation that is equivalent to a physical art collection piece.<\/p>\n<p>Basically, an NFT can be anything from an image, a meme, to a Twitter post, because what gives them value is a kind of digital property certificate that gives validity and legitimacy to the file and is recorded in the chain. of blocks, in this case, from Solana.<\/p>\n<p><strong>Also read: Bitcoin user was the victim of “the biggest single scam” and lost a large sum of money<\/strong><\/p>\n<p>Therefore, an NFT cannot be imitated, although it can be made available to the public for viewing, as in the case of a 10-second video that an American named Pablo Rodríguez-Fraile sold for up to $6 million in March 2021.<\/p>\n<p>In this case, there have been digital works that have been sold for up to $69 million, however, experts consulted by the British media consider that the NFT market is full of &#8220;crypto-fraudsters&#8221; who make people believe that a digital file has a high value even if it is not.<\/p>\n<p><script async=\"\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The announcement was made by a company called Astro Babies, which is dedicated to selling and buying NFTs, a kind of digital file that is traded with cryptocurrencies. The casino will also &#8220;work&#8221; in the metaverse, according to the company. The Salvadoran government and a company dedicated to the sale and purchase of NFTs (Non-Fungible [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":862,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/861"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=861"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/861\/revisions"}],"predecessor-version":[{"id":912,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/861\/revisions\/912"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/862"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=861"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=861"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=861"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}