{"id":888,"date":"2022-05-23T12:42:06","date_gmt":"2022-05-23T12:42:06","guid":{"rendered":"https:\/\/infobloom.site\/cryptocurrencies-are-a-scam-says-the-creator-of-dogecoin\/"},"modified":"2022-05-23T12:42:06","modified_gmt":"2022-05-23T12:42:06","slug":"cryptocurrencies-are-a-scam-says-the-creator-of-dogecoin","status":"publish","type":"post","link":"https:\/\/infobloom.site\/cryptocurrencies-are-a-scam-says-the-creator-of-dogecoin\/","title":{"rendered":"“Cryptocurrencies are a scam”, says the creator of Dogecoin"},"content":{"rendered":"<p><strong>jackson palmer<\/strong>one of the creators of <strong>Dogecoin<\/strong>, returned to Twitter to give his opinion on cryptocurrencies.  After making his account private in mid-2019, the former Adobe software engineer resurfaced on the social network to say that cryptocurrencies are basically <strong>a scam designed to make the rich richer<\/strong>.<\/p>\n<p>In a Twitter thread, Palmer explains that he constantly has to answer questions related to cryptocurrencies and his possible return to them, so he decided to express everything he thinks on the subject there.  This includes <strong>Dogecoin<\/strong>which he created together with IBM engineer Billy Marcus in 2013.<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">After years of studying it, I believe that cryptocurrency is an inherently right-wing, hyper-capitalistic technology built primarily to amplify the wealth of its proponents through a combination of tax avoidance, diminished regulatory oversight and artificially enforced scarcity.<\/p>\n<p>— Jackson Palmer (@ummjackson) July 14, 2021<\/p><\/blockquote>\n<blockquote class=\"wp-block-quote\">\n<p>“After years of studying it, I think <strong>cryptocurrencies are an inherently right-wing technology<\/strong>&#8220;, writes.  &#8220;A <strong>hypercapitalist technology<\/strong> built primarily to amplify the wealth of its proponents through a combination of tax avoidance, less regulatory oversight, and artificially enhanced scarcity.”<\/p>\n<\/blockquote>\n<p class=\"lico-related-post\">Banxico stops Banco Azteca and says that banks cannot operate with cryptocurrencies<\/p>\n<p>Jackson goes on to say that despite the argument of the <strong>decentralization<\/strong>the industry is controlled by a &#8220;powerful cartel of wealthy characters&#8221; and takes advantage of certain connections to perpetuate what he calls <strong>“a kind of cult”<\/strong> designed to take advantage of “financially desperate and naive people”.<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Cryptocurrency is like taking the worst parts of today&#8217;s capitalist system (eg. corruption, fraud, inequality) and using software to technically limit the use of interventions (eg. audits, regulation, taxation) which serve as protections or safety nets for the average person .<\/p>\n<p>— Jackson Palmer (@ummjackson) July 14, 2021<\/p><\/blockquote>\n<blockquote class=\"wp-block-quote\">\n<p>“Cryptocurrencies are like taking the worst of the current capitalist system (<strong>corruption, fraud, inequality<\/strong>) and use software to technically limit the use of interventions (audits, regulation, tax collection), which serve as protection for the average person”.<\/p>\n<\/blockquote>\n<p>In this way, he continues, people who lose the password to access their savings or who fall for a scam are considered &#8220;guilty&#8221;, while billionaires who manipulate markets are considered &#8220;geniuses&#8221;.  However, he points out that today <strong>any criticism of cryptocurrencies is cause for attack<\/strong> by powerful figures, as well as investors &#8220;to whom they sold the false promise of being billionaires one day.&#8221;<\/p>\n<p class=\"lico-related-post\">Bitcoin: Harmful to the Environment?<\/p>\n<p>Finally, <strong>jackson palmer<\/strong> answers the question that was initially raised and categorically denies the possibility of returning, one day, to the business.  He points out that he is no longer interested in participating in the public discussion about the <strong>cryptocurrencies<\/strong> nor do you have the time or energy to do so.<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">I applaud those with the energy to continue asking the hard questions and applying the lens of rigorous skepticism all technology should be subject to.  New technology can make the world a better place, but not when decoupled from its inherent politics or societal consequences.<\/p>\n<p>— Jackson Palmer (@ummjackson) July 14, 2021<\/p><\/blockquote>\n<p>“I applaud those who still have the energy to keep asking the tough questions and applying the lens of rigorous skepticism that all technology must undergo. <strong>New technologies can make the world a better place<\/strong>but not when they are decoupled from their inherent policies or their social consequences”, he concludes.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>jackson palmerone of the creators of Dogecoin, returned to Twitter to give his opinion on cryptocurrencies. After making his account private in mid-2019, the former Adobe software engineer resurfaced on the social network to say that cryptocurrencies are basically a scam designed to make the rich richer. In a Twitter thread, Palmer explains that he [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":889,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/888"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=888"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/888\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/889"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=888"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=888"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=888"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}