{"id":90,"date":"2022-05-03T11:09:39","date_gmt":"2022-05-03T11:09:39","guid":{"rendered":"https:\/\/infobloom.site\/the-new-speculative-fever-based-on-digital-art\/"},"modified":"2022-05-03T11:09:39","modified_gmt":"2022-05-03T11:09:39","slug":"the-new-speculative-fever-based-on-digital-art","status":"publish","type":"post","link":"https:\/\/infobloom.site\/the-new-speculative-fever-based-on-digital-art\/","title":{"rendered":"the new speculative fever based on digital art"},"content":{"rendered":"<p class=\"dropcap dropcap-simple\">Who knows.  Maybe you are tremendously rich, because you have an NFT of incalculable value and you have not even realized it.  It is true that it is unlikely, but if you have been surprised at your invisible friend or for Christmas with an unusual gift, such as a tweet or an artistic creation, <strong>could be worth thousands or millions of euros<\/strong>.  You do not own the work &#8216;physically&#8217;, nor are you going to hang the painting in your home, but you have a <strong>digital certificate that accredits you as its owner<\/strong> and in which all the data of the author and his work appear, all supported from a blockchain code.  This is the new reality that attracts thousands of people to bid on them, the famous <strong>NFT<\/strong>.  So if it can make you rich or just make money, cybercriminals are also interested.<\/p>\n<p>It is said that in matters of art everything is possible and in the world of technological advances and the internet every day the barriers are lower.  Who could imagine collecting digital and exclusive works of art?  However, this year several headlines echoed an auction that reached 57 million euros for the purchase of what is considered the first work of digital art Every day: the first 5000 days, by Mike Winkelmann, a digital artist known as beeple.<\/p>\n<h2>And what exactly are NFTs?<\/h2>\n<p><strong>Don&#8217;t worry, if you are new to this, let&#8217;s first get to know what NFTs consist of. <\/strong>The acronym NFT stands for “Non-Fungible Token”, that is, a non-fungible token.  Unlike expendable goods (such as money), these are not consumed by use and cannot be exchanged as you would in any transaction. <strong>NFTs are unique digital certificates that are associated with a file, becoming collectible assets with a value.<\/strong><\/p>\n<p>To focus, just as there is current money, which we all have in our portfolio, and which fluctuates with the market;  the tokens <strong>they are cryptocurrencies with various utilities<\/strong>.  Cryptocurrencies have their own blockchain and mining system. <strong>Tokens are units of value or files based on cryptography, which cannot be mined and are used for other uses such as generating employment contracts or transferring data, among many other uses.<\/strong> In short, its usefulness serves to offer an experience to the user.<\/p>\n<p><strong>In the words of William Mougayar, author of the book &#8216;<\/strong><strong>The business blockchain<\/strong><strong>&#8216;<\/strong>, a token is a unit of value that an organization creates to govern its business model and give its users more power to interact with its products, while facilitating the distribution and sharing of benefits among all its shareholders.  We should not confuse the tokens, in English, &#8220;chips&#8221;, such as those that we would use to play in an amusement park or activate the pressure washer to clean the car, with cryptocurrencies such as Bitcoin. <strong>Cryptocurrencies are tokens, but tokens can be put to more uses, such as NFTs.<\/strong><\/p>\n<p>“The potential that blockchain has in security and in the generation of new business models is unimaginable at this time.  However, as with all new technologies, it is a double-edged sword if it is not developed with the highest security standards.  In this sense, the regulators together with the cybersecurity industry have to collaborate to promote and develop the best practices for cybersecurity within cryptography”, highlights Hervé Lambert, Global Consumer Operations Manager of Panda Security.<\/p>\n<p>Many experts point out that what lies behind the NFT boom is nothing more than a speculative bubble.  As they are unique assets, they acquire a much higher value as there is no other like them, so people buy them with the hope of seeing that value grow and reselling it in the future.<\/p>\n<p><\/p>\n<h2>Four security recommendations in the NFT world<\/h2>\n<p><strong>If you are already thinking about wanting to get rich by entering the cryptocurrency and NFT market, it is recommended that you be alert to these recommendations to avoid fraud.<\/strong> Because cybercriminals have already deployed several of their techniques to make you fall for their bait.<\/p>\n<ol>\n<li><strong>Beware of fake NFT websites. <\/strong>As with other cases of phishing or hacker schemes to hijack your data, organized hacking groups develop fake NFT trading websites.  The intention of these sites is to get you to fill out forms with the intention of getting your recovery phrase from your digital wallet and stealing all your cryptocurrencies.<\/li>\n<\/ol>\n<p>To avoid falling into this trap:<\/p>\n<ul>\n<li><strong>Check the price at which NFTs sell with other trading portals<\/strong>.  If they offer it for a much lower price, doubt this claim.<\/li>\n<li>You can too <strong>look for a blue check mark<\/strong> next to the username and the list of collection properties.<\/li>\n<li><strong>Check if the NFT contact address matches the creator&#8217;s website<\/strong>.<\/li>\n<li>Make the transaction through <strong>well-known and trusted sites<\/strong>such as OpenSea, the largest NFT marketplace on the web.<\/li>\n<\/ul>\n<ol>\n<li><strong>Impersonation of NFT artists.  <\/strong>Although NFTs have been created so that artists can sell their work directly and avoid commission from galleries and dealers, cybercriminals have found a way to “intermediate” the transaction.  Thus, hackers pose as authors of renowned NFT works to create plagiarism and copies under their name.  This is the case of Liam Sharp, a renowned comic book artist, who announced in December that he is going to close his entire gallery on DeviantArt because people keep stealing his art and, what is more bloody, creating NFTs with him.<\/li>\n<\/ol>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Sadly I&#8217;m going to have to completely shut down my entire @DeviantArt gallery as people keep stealing my art and making NFTs.  I can&#8217;t – and shouldn&#8217;t have to – report each one and make a case, which is consistently ignored.  Sad and frustrating.  pic.twitter.com\/oNH6yXQtyU<\/p>\n<p>— Liam &#8216;Sharpy&#8217; Sharp (@LiamRSharp) December 17, 2021<\/p>\n<\/blockquote>\n<ol>\n<li><strong>phishing<\/strong><strong>  in the email.<\/strong> The electronic messaging system is usually the first platform to launch this type of scam.  Be especially careful with notifications that reach your inbox or spam about fake NFT offers.  Read the entire message carefully and note the sender and the website to which it intends to redirect you.  Surely it is a false website that intends to steal the data from your digital wallet.  Another possibility is that you receive a kind of security alert telling you that someone has tried to access your accounts.  In that case, and if you want to check it, do not click on the attached links and go directly to the official web portal or call the technical service.<\/li>\n<li><strong>Free gifts and promotions.<\/strong> It is the typical case of phishing in which scammers launch ads through social networks such as Twitter, Facebook, Telegram and Discord on how to get more cryptocurrencies to take away the ones you already have in your wallet.<\/li>\n<\/ol>\n<p>The boom that the world of cryptocurrencies is experiencing, which <strong>is poorly regulated <\/strong>and there is a gap in its protection, together with society&#8217;s little knowledge of it, making it a very attractive as well as dangerous business.  “These are new technologies that are not known as much and depending on the use made, it can become a beta in which cybercriminals with a thirst for collectible tokens introduce their tricks to steal from those who are not fully attentive”, adds Hervé Lambert, Global Consumer Operations Manager at Panda Security.<\/p>\n<p>                <script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Who knows. Maybe you are tremendously rich, because you have an NFT of incalculable value and you have not even realized it. It is true that it is unlikely, but if you have been surprised at your invisible friend or for Christmas with an unusual gift, such as a tweet or an artistic creation, could [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":92,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/90"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=90"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/90\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/92"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=90"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=90"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=90"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}