{"id":929,"date":"2022-05-24T00:31:26","date_gmt":"2022-05-24T00:31:26","guid":{"rendered":"https:\/\/infobloom.site\/how-this-nfts-marketplace-works\/"},"modified":"2022-05-24T00:31:26","modified_gmt":"2022-05-24T00:31:26","slug":"how-this-nfts-marketplace-works","status":"publish","type":"post","link":"https:\/\/infobloom.site\/how-this-nfts-marketplace-works\/","title":{"rendered":"How this NFTs Marketplace Works"},"content":{"rendered":"<p>Have you heard of Mintable?  We tell you what this NFT marketplace is all about, what can be bought or sold in it and how it differs from others. <\/p>\n<p>NFTs, or non-fungible tokens, have become a way for creatives, artists, and content creators to distribute and monetize their art. <\/p>\n<p>Just as platforms like Twitch allowed artists to become independent from television networks, cultivate audiences and monetize their work, NFT marketplaces seek to be the digital version of art galleries.<\/p>\n<h2 id=\"qu%C3%A9-es-mintable\">What is mintable?<\/h2>\n<p>Mintable is a platform that allows you to create and publish non-fungible tokens (NFTs).  In this note you can read more about what NFTs are. <\/p>\n<p>It basically allows anyone with internet access the ability to create, mint, publish and sell NFTs based on the Ethereum network and without the need to code smart contracts. <\/p>\n<p>In addition to the ability to create and publish NFTs, Mintable also functions as a marketplace where buyers can view assets for sale and purchase directly from there.  That way, creators and artists can connect with buyers. <\/p>\n<p>As each NFT is stored as a unique token on the Ethereum blockchain, the creator, and subsequently the holder, has verifiable ownership of the digital asset. <\/p>\n<p><strong>Warning: Keep in mind that all NFT marketplaces are different and therefore you should review and study them carefully before registering to ensure that they are safe and reliable.  At Buda.com we do not endorse the use of particular platforms or investment in NFTs.<\/strong><\/p>\n<h2 id=\"qu%C3%A9-nfts-se-pueden-comprar-y-vender-en-mintable\">Which NFTs can be bought and sold on Mintable<\/h2>\n<p>In Mintable you can create and sell different types of NFTs from art and collectibles to music and website domains. <\/p>\n<h3 id=\"arte\">Art<\/h3>\n<p>Many prominent and popular artists have featured their work on Mintable.  In fact, it is one of the most frequent uses of the platform. <\/p>\n<h3 id=\"coleccionables\">collectibles<\/h3>\n<p>Collectible items, such as sports cards, also have an important place in Mintable. <\/p>\n<p>Collectible items are identified as such on the platform so that they can be easily identified by buyers. <\/p>\n<h3 id=\"art%C3%ADculos-de-juegos\">game items<\/h3>\n<p>Other products that can be obtained and created in Mintable are game items. <\/p>\n<p>For example, skins or characters from NFT games can be bought and sold. <\/p>\n<h3 id=\"m%C3%BAsica\">Music<\/h3>\n<p>Music is definitely one of the newer use cases for NFTs and one that requires further development.  But it is possible to support musicians by buying their tracks and singles on Mintable.<\/p>\n<h3 id=\"dominios\">domains<\/h3>\n<p>Crypto domains, which seek to position themselves as the new Web 3 addresses, can also be purchased at Mintable.  Mintable has a library of over 5,000 .eth domains to choose from. <\/p>\n<h2 id=\"cu%C3%A1l-es-la-diferencia-entre-mintable-rarible-y-opensea\">What is the difference between Mintable, Rarible and OpenSea<\/h2>\n<p>Mintable is not the only marketplace for NFTs.  Rarible and OpenSea are two others with similar features and functionality. <\/p>\n<h3 id=\"historia\">History<\/h3>\n<p>OpenSea is the first NFT marketplace created.  It was launched in 2017, so it is already several years old allowing the creation and sale of non-fungible tokens.  It is a platform based in the United States.<\/p>\n<p>Mintable, on the other hand, was launched in 2018, a year after OpenSea.  It is a platform based in Singapore. <\/p>\n<p>Finally, Rarible was launched in 2017 but began operating in the format we know today in 2020. Like OpenSea, it is headquartered in the United States. <\/p>\n<h3 id=\"creaci%C3%B3n-de-nfts\">Creation of NFTs<\/h3>\n<p>Both Mintable and OpenSea have gasless options, that is, a marketplace option in which it is not necessary to pay for gas (the denomination in which commissions are paid in Ethereum).<\/p>\n<p>The way they work is that they allow an NFT to be put up for sale but without registering it directly on the blockchain until it is sold.  When the NFT is sold, the asset is registered, the transaction in the blockchain and the gas is paid only at that moment. <\/p>\n<p>In this way, they eliminate the barrier to entry to the world of NFTs and allow the process of creating a digital asset to be done without investment. <\/p>\n<p>Rarible, on the other hand, does not have the gasless publication option. <\/p>\n<h3 id=\"tipos-de-activos\">asset types<\/h3>\n<p>While all 3 function as open marketplaces where NFTs can be bought, sold, minted and traded, OpenSea and Rarible tend to attract audiences who prefer to buy and sell art or collectibles. <\/p>\n<p>However, Mintable, on which you can also buy and sell assets, tends to attract an audience looking to trade NFTs without commissions or fees.  This makes it attractive for trading video game NFTs. <\/p>\n<h2 id=\"%C2%BFinvertir-en-nfts-o-en-bitcoin\">Invest in NFTs or bitcoin?<\/h2>\n<p>This is a question that many ask themselves when they see new terms appearing in the crypto world. <\/p>\n<p>The truth is that NFTs and other cryptocurrencies, such as bitcoin or ethereum, are not really the same nor do they have the same purpose or functions. <\/p>\n<p>NFTs are, to date, digital tokens of art and collectibles.  Bitcoin, on the other hand, has positioned itself as a store of value and a 100% digital currency.<\/p>\n<p>If you are an artist or content creator and want a marketplace where you can share your creations, mint and sell NFTs, you can do so through marketplaces like Mintable.<\/p>\n<p>If, instead, you are looking to invest in a digital currency that has a lot of institutional backing, a strong team of developers behind it, and a robust technology that more projects are being built on and that has kick-started a decentralized economy, then a crypto like ether or bitcoin are a better alternative.<\/p>\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you heard of Mintable? We tell you what this NFT marketplace is all about, what can be bought or sold in it and how it differs from others. NFTs, or non-fungible tokens, have become a way for creatives, artists, and content creators to distribute and monetize their art. Just as platforms like Twitch allowed [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":931,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/929"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=929"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/929\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/931"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=929"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=929"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=929"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}