{"id":946,"date":"2022-05-24T13:16:18","date_gmt":"2022-05-24T13:16:18","guid":{"rendered":"https:\/\/infobloom.site\/nfts-and-photography-footer\/"},"modified":"2022-05-24T13:16:18","modified_gmt":"2022-05-24T13:16:18","slug":"nfts-and-photography-footer","status":"publish","type":"post","link":"https:\/\/infobloom.site\/nfts-and-photography-footer\/","title":{"rendered":"NFTs and Photography &#8211; Footer"},"content":{"rendered":"<p><strong>Something is happening on the Internet: people spend millions of dollars buying “unique” files called NFTs (Non-Fungible Tokens).  NFTs are digital assets that can be seen but not touched, nor are they tradable.<\/strong><\/p>\n<p>@Maria_Efemere <\/p>\n<p>The fever started this year when Jack Dorsey (CEO of Twitter) sold his first tweet (a screenshot of it) for more than 2.5 million dollars.  Transactions are made from a cryptocurrency called Ethereum.<\/p>\n<p>This web phenomenon has been supported by the famous gallery Christie&#8217;s, which auctioned off the work “Everydays: Tha First 5000 Days” by artist Mike Winkelmann, known on the Internet as Beeple.  The work was sold for 69 million dollars (42,329,453 ETH).<\/p>\n<p>NFTs are not only being exploited by digital artists.  Other arts such as dance or music are making use of this format to publicize their work.  In the photo it is also happening and these are some examples:<\/p>\n<p>In this interview with Vist Projects, Sam Bohorquez tells about his experience selling his photos through NFTs.  Bohorquez says that several well-known photographers are building a community of documentary photography around NFTs, but that art photography, in particular, is doing the best.<\/p>\n<p>That is the case for photographer Kate Woodman, who initially sold her photograph Always Coca Cola for 1.25 ETH ($2,325) on March 4.  After 15 resales she reached the sum of 11.9 ETH (22 thousand dollars) according to information from Aesthetics of Photography.<\/p>\n<p>And how can we sell photography as NFTs?  The Aesthetics of photography medium explains it here.  In the note they say that it is essential to know the definitions of terms such as blockchain (computer system for sharing and storing data) and Smart Contracts (intelligent contract \/ from these photographers earn commission every time they resell their NFT).<\/p>\n<p>The artist does not lose the intellectual rights of his photography, however, whoever buys it decides what to do with it, thanks to smart contracts the photographers behind the photos continue to benefit.<\/p>\n<p>You have to register in the blockchain first if you want to start selling your photos in NTF, choose one like Ethereum.  Choose a wallet that is linked to your credit card or bank account.  Then look to crypto art markets, Aesthetics of Photography suggests Opensea, Ghostmarket and SuperRare.<\/p>\n<p>It may work, it may not, we have to inform ourselves a lot and continue exploring the world of NFTs.  We will have to try, with luck one of our photos may be bought for thousands of dollars.<\/p>\n<p>                    <\/p>\n<p>Always a foreigner, her thing is the audiovisual and journalism is the way she meets and questions the world.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Something is happening on the Internet: people spend millions of dollars buying “unique” files called NFTs (Non-Fungible Tokens). NFTs are digital assets that can be seen but not touched, nor are they tradable. @Maria_Efemere The fever started this year when Jack Dorsey (CEO of Twitter) sold his first tweet (a screenshot of it) for more [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":948,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/946"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=946"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/946\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/948"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=946"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=946"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=946"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}