{"id":949,"date":"2022-05-24T13:48:37","date_gmt":"2022-05-24T13:48:37","guid":{"rendered":"https:\/\/infobloom.site\/rewoven-the-elaborate-scam-that-revived-a-pandemic-with-spiritual-gurus-by-zoom-national\/"},"modified":"2022-05-24T13:48:37","modified_gmt":"2022-05-24T13:48:37","slug":"rewoven-the-elaborate-scam-that-revived-a-pandemic-with-spiritual-gurus-by-zoom-national","status":"publish","type":"post","link":"https:\/\/infobloom.site\/rewoven-the-elaborate-scam-that-revived-a-pandemic-with-spiritual-gurus-by-zoom-national\/","title":{"rendered":"Rewoven: the elaborate scam that revived a pandemic with &#8220;spiritual gurus&#8221; by Zoom |  National"},"content":{"rendered":"<p>An already classic pyramid scheme is gaining strength again, now disguised as movements that claim to be &#8220;alchemists&#8221; and deceiving with concepts of &#8220;circular economy&#8221;.  Thanks to the pandemic, the recruitment process for potential victims became via Zoom, with supposed &#8220;spiritual&#8221; workshops.  This new plot is revealed by the BioBioChile Research Unit.<\/p>\n<p>Cell, Mandala, Circle of Prosperity.  Several names have received an already historic <strong>pyramid scheme<\/strong>which arrived in Chile in the summer of 2008 in Concepción, but has spread throughout the world, with new techniques that disguise deception, to swindle people.<\/p>\n<p>“The prettiest, most polished tool that exists, which is <strong>the Rewoven”<\/strong>.  Thus begins an excerpt from the presentation of a supposed guru or leader of a group of self-proclaimed &#8220;Alchemists&#8221;, who invites to participate in a &#8220;tribe&#8221;, which is actually a network that promises huge profits of money to those who enter.<\/p>\n<p>A pyramid figure would expose the scam, so now they establish <strong>a circle<\/strong>under an assumption of collaborative economy, which has the natural elements as protagonists: Wind, Earth, Fire and Water, within a &#8220;Ship&#8221;.<\/p>\n<p>Scheme disseminated by organizations<\/p>\n<p>“I am in the &#8216;Water&#8217;, my &#8216;Nave&#8217; was completed, the 8 &#8216;Fueguitos&#8217; were completed and that &#8216;Water&#8217; is going to enter again as a &#8216;Fueguito&#8217; in another &#8216;Nave&#8217;.  It reweaves, weaves again, and begins its transit again from &#8216;Fire&#8217; to &#8216;Water&#8217;”. This is how they explain the supposed miracle of the system, which would suppose an infinite effect of profits, in a video that circulates on the network and that compiles BioBioChile.<\/p>\n<p><iframe id=\"vrudo\" class=\"vrudo\" src=\"https:\/\/rudo.video\/vod\/bMleMF\" width=\"700\" height=\"394\" allowscriptaccess=\"always\" allowfullscreen=\"true\" webkitallowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" allow=\"autoplay; fullscreen\"><\/iframe><\/p>\n<p>They assure that this &#8220;makes it possible for this movement to become long-term (&#8230;) that we can continue with the same triad with which I initially formed.&#8221;<\/p>\n<h2>A leap of faith by Zoom<\/h2>\n<p>All this within the framework of a supposed spiritual workshop developed in videoconference of the platform <strong>zoom<\/strong>, with more than 270 participants.  To make the deception convincing, they summon a supposed beneficiary.  In his story he tries to persuade those who have doubts.<\/p>\n<p>At first he says he had the same concerns, commenting that he thought: “I screwed up with the lucas, this hueá was a story, whore la hueá.  Just as defeated, with a panic attack, kids, so bad, wanting to vomit.  But it turns out that after that crisis I had, I said &#8216;I&#8217;m going to empower myself&#8217;.  I began to study, I read all the &#8216;line hits&#8217;, I made my diagrams, I got into the &#8216;Nutri-Zoom&#8217;, which are Zooms where they teach you the spirit of movement and how they work, in detail”.<\/p>\n<p>“With that knowledge I began to &#8216;blow&#8217; and I achieved my goals in the &#8216;Little Wind&#8217;, I went to Earth and in that Wind-Earth-Water transit I began to realize that this question, children, has nothing to do with the lucas, but nothing to do with the lucas.  I realized that when you make a gift it is an act of faith, like taking a leap of faith”, says the facilitator.<\/p>\n<p><iframe id=\"vrudo\" class=\"vrudo\" src=\"https:\/\/rudo.video\/vod\/bMleRL\" width=\"700\" height=\"394\" allowscriptaccess=\"always\" allowfullscreen=\"true\" webkitallowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" allow=\"autoplay; fullscreen\"><\/iframe><\/p>\n<h2>scam method<\/h2>\n<p>To enter as &#8216;Fire&#8217; you must contribute about 2,000 euros, that is, <strong>almost 1.8 million Chilean pesos<\/strong>.  This would ensure the reception of close to <strong>$14 million<\/strong> &#8220;gift&#8221; from the other participants.  The offer is clearly tempting.<\/p>\n<p>&#8220;We are promoting the weekly rhythm by element (&#8230;) for each transit we are delaying a month,&#8221; they say.<\/p>\n<p>These types of pyramid scams are nothing more than a Ponzi scheme, born in Boston 100 years ago.  Although 15 people would suffice to start, when reaching level 10, 7,680 members will be needed and at level 20 almost 8 million people to sustain the rhythm, which <strong>causes these systems to quickly collapse and end up delivering profits only to the initial group<\/strong>.<\/p>\n<p>From the Investigative Police they indicated to BioBioChile that they still have no reports or complaints for scams with this new modus operandi, but they remain alert, because at any time a victim could be defrauded.<\/p>\n<p>“There is a culminating moment when <strong>the leaders of the organization must abandon the scheme, because it could collapse<\/strong> if all the investors or persons recruited decide to request the return of their investments.  Before that happens, the leader of the organization disappears and causes economic damage to all those who have made the money contributions,” explains Sub-Prefect Marcelo Romero, head of the PDI Economic Crimes Brigade.<\/p>\n<p>The detective details that the characteristics of these organizations are similar to the <strong>cellular division<\/strong>.  “It has a pyramid scheme or scam structure that is also called a Mandala.  A business scheme where the participant or investor is offered tempting returns in a short period of time and with the condition of recruiting new investors, the base of the pyramid is widened in favor of those who are at the top”.<\/p>\n<p>This is how the cell or leader that is located in the center is the one who is receiving the payments from those victims that are capturing and surrounding the main structure.<\/p>\n<p>“The perpetrators bet on a spirit of overcoming and spiritual advancement of the people who are victims of deception, who are vulnerable.  I think of people who are in an unfavorable mood, with self-esteem problems or who need to overcome some kind of addiction”, reflects the policeman.<\/p>\n<h2>effect 10%<\/h2>\n<p>One factor that could have revived this old form of scam would be the <strong>10% withdrawals<\/strong> from AFP funds.<\/p>\n<p>Romero maintains that “the fact of withdrawing 10% means that there is a permanent flow of cash and resources in the market.  We have seen how the crime of fraud has increased, especially through virtual platforms.  The Internet is a breeding ground for this type of deception, taking advantage of the anonymity offered by the network”.<\/p>\n<p>The Economic Crimes Brigade issues a warning: “Many times the perpetrator makes a <strong>follow-up<\/strong> of the most recurrent sites of the victim and make the contact in attention to the type of subject that the victim searches on the internet”, says the sub-prefect.<\/p>\n<p>Finally, the detective emphasizes that &#8220;we must be wary of all types of businesses where the contribution of a new group of investors is required, <strong>distrust when there is no clarity<\/strong> in which is the business or investment that will be done with this money.  That is a signal or warning light that we may be facing a pyramid scam crime.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>An already classic pyramid scheme is gaining strength again, now disguised as movements that claim to be &#8220;alchemists&#8221; and deceiving with concepts of &#8220;circular economy&#8221;. Thanks to the pandemic, the recruitment process for potential victims became via Zoom, with supposed &#8220;spiritual&#8221; workshops. This new plot is revealed by the BioBioChile Research Unit. Cell, Mandala, Circle [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":951,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/949"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=949"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/949\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/951"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=949"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=949"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=949"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}