{"id":95,"date":"2022-05-03T11:38:41","date_gmt":"2022-05-03T11:38:41","guid":{"rendered":"https:\/\/infobloom.site\/an-nft-project-for-minecraft-turned-out-to-be-a-millionaire-scam\/"},"modified":"2022-05-03T11:38:41","modified_gmt":"2022-05-03T11:38:41","slug":"an-nft-project-for-minecraft-turned-out-to-be-a-millionaire-scam","status":"publish","type":"post","link":"https:\/\/infobloom.site\/an-nft-project-for-minecraft-turned-out-to-be-a-millionaire-scam\/","title":{"rendered":"An NFT project for Minecraft turned out to be a millionaire scam"},"content":{"rendered":"<p>With NFTs occupying an increasingly prominent place in various fields, controversy is the order of the day.  This time it has been the users of <strong>Blockverse<\/strong>a Minecraft-based NFT game that <strong>seems to have been nothing more than a millionaire scam<\/strong>.<\/p>\n<p>Blockverse was born as a project aimed at creating a video game under the play-to-earn mode (that is, playing for profit) over Minecraft.  This generated immediate interest among the public, but the story took an unwelcome turn.  Just two days after they released a collection of 10,000 NFTs, which sold out in just 8 minutes, <strong>the developers of the game disappeared with the money of the buyers<\/strong>.<\/p>\n<p>The Blockverse Discord server was shut down, as was the official website.  As published by NFT Ethics on Twitter, the creators of this initiative not only pocketed the equivalent of 500 ETH —something like 1.3 million dollars, according to the current price of Ethereum—, but also an extra 792 ETH ($2 million, approximately) in &#8220;secondary sales&#8221;. <\/p>\n<p>https:\/\/twitter.com\/Blockverse_NFT\/status\/1485415643440508929\n<\/p>\n<p>The accusations that <strong>it was all part of a rug pull<\/strong> they did not take long to appear, especially considering that the Blockverse developers remained anonymous the entire time.  NFTs with Minecraft-based characters are still listed on OpenSea, but user complaints are becoming more visible on social media.<\/p>\n<p>see more<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\" placeholder=\"\">\n<p lang=\"en\" dir=\"ltr\">Just heard about the @Blockverse_NFT rug.  The project sold out yesterday in less than 8 minutes (500 ETH) and had 792 ETH in secondary sales.  Discord &#038; website closed and the anonymous devs are gone.  Do we need a federated entity that approves all NFT projects and its doxxed founders?<\/p>\n<p>— NFT Ethics (@NFTethics) January 25, 2022<\/p><\/blockquote>\n<p>A rug pull is a widely used form of scam in the world of cryptocurrencies and decentralized finance.  It happens when developers take investors&#8217; money, destined for liquidity pools, and simply run away.  In some cases, as recently happened with the Squid Game cryptocurrency, its creators generate a lot of hype around the token so that its value increases and then they sell it all at once —and in large quantities— so that it loses all its value, preventing also that the rest of the users get rid of them.<\/p>\n<h2 class=\"has-text-align-center\" id=\"h-blockverse-el-juego-nft-basado-en-minecraft-que-termino-en-estafa\">Blockverse, the Minecraft-based NFT game that ended up a scam<\/h2>\n<p>Image: Twitter<\/p>\n<p>Users affected in the Blockverse case have come together in a new Discord channel to try to find a way out of this problem.  However, the victims would not be only those who believed in this new NFT game based on Minecraft, <strong>but also some collaborators hired by the developers<\/strong>.<\/p>\n<p>On Twitter, @illiquidassets backed away from accusations of helping bring the scam to life.  The user explained that the creators of the Blockverse contacted him to collaborate with the marketing campaign of the game&#8217;s launch.  He even mentioned that he hired influencers with his own money (he would have spent around 26 thousand dollars) to strengthen the image of the product, but that when the story took a dark turn <strong>they also left him lying<\/strong>. <\/p>\n<p>&#8220;Starting today, I will help find and catch these guys,&#8221; he posted.  In any case, he assured that he never knew their names because the deal was always anonymous.<\/p>\n<p>see more<\/p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\" placeholder=\"\">\n<p lang=\"en\" dir=\"ltr\">Starting today, I will be helping to find and hunt down these guys.  I wasn&#8217;t given any names as they kept everything very anon from me.  For any inquires or info, plz message me here or on discord.  Add me to your chats and I&#8217;ll see what I can do in anyway to help (end)<\/p>\n<p>— wgmi?  (@illiquidassets) January 25, 2022<\/p><\/blockquote>\n<h2 class=\"has-text-align-center\" id=\"no-tuvimos-la-intencion-de-que-fuese-una-estafa\">&#8220;We didn&#8217;t mean for it to be a scam&#8221;<\/h2>\n<p>According to NME, one of the Blockverse developers entered the Discord server where the victims met to try to give an explanation.  Needless to say, the end result was not positive.<\/p>\n<p>&#8220;We hope you can believe that, with the amount of time we&#8217;ve put into this, <strong>we never intended it to be a rug pull<\/strong>, but we ended up not being able to handle the chat after the mess during the server launch.  There seemed to be too much negativity and we couldn&#8217;t moderate the issues, and we planned to just step back and focus on development,&#8221; said the user identified simply as Kashx, one of the promoters of the Minecraft-based NFT game.<\/p>\n<p>But he also indicated that when things heated up, death threats and doxing appeared, and that they panicked.  He also mentioned that they would refund the money but first they had to deal with the situation that had arisen. <\/p>\n<p>In any case, this possibility does not seem to present itself in a very convincing way;  the same developer stated that <strong>they considered it fair to keep the 500 ETH<\/strong> as payment for work done, and as compensation for threats received.<\/p>\n<p>Another proposal is for the community to take control of the Blockverse project and retain the profits from the resale of NFTs.  However, the alternative does not seduce users either, regardless of their fanaticism for Minecraft.  For now, there were no more news regarding this soap opera, but it is clear that the last word has not yet been said.  We will be attentive to what happens in the future.<\/p>\n<p><script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<p>With NFTs occupying an increasingly prominent place in various fields, controversy is the order of the day. This time it has been the users of Blockversea Minecraft-based NFT game that seems to have been nothing more than a millionaire scam. Blockverse was born as a project aimed at creating a video game under the play-to-earn [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":96,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/95"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=95"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/95\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/96"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=95"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=95"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=95"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}