{"id":952,"date":"2022-05-24T16:07:32","date_gmt":"2022-05-24T16:07:32","guid":{"rendered":"https:\/\/infobloom.site\/how-to-detect-and-act-against-a-real-estate-fraud\/"},"modified":"2022-05-24T16:07:32","modified_gmt":"2022-05-24T16:07:32","slug":"how-to-detect-and-act-against-a-real-estate-fraud","status":"publish","type":"post","link":"https:\/\/infobloom.site\/how-to-detect-and-act-against-a-real-estate-fraud\/","title":{"rendered":"How to detect and act against a real estate fraud"},"content":{"rendered":"<p>During the search for a house, it is important that you do not lose sight of everything that concerns this situation: housing options, location, prices, or the legal status of the property, since you may be exposed to real estate fraud, in which You will only lose time, but also money.<\/p>\n<p>In this regard, Sergio San Sebastián, director of the Credi Mejora broker, assured that, regarding the legal field, future buyers should not lower their guard and need to be duly advised, since this will determine the viability of the purchase, in addition to avoiding possible fraud. .<\/p>\n<p>“It is important to verify that the property is properly regulated.  Not necessarily free of liens, but that they have the documents in order, that they have a Predial, water bill or that they have deeds, ”he said.<\/p>\n<p>The director explained that there are different aspects where special attention should be paid.  One of them falls on the deeds of the property, where you have to make sure that it is in the name of the person who sells it and that it matches the official identification that is presented at the time of signing the housing contract.<\/p>\n<p>The existence of the property is another aspect, and it is not for less, since many times a property is not for sale and is published on some Internet site.  All the properties are registered, and in these cases you can consult it before the Public Registry of Property.<\/p>\n<p>“The registry assigns a folio to each property that is registered and where the entire history of the property is recorded, as well as who is the current owner.  By having a folio, a search can be carried out in order to know its situation, since it is important to know that the property that is being offered really exists”, mentioned San Sebastián.<\/p>\n<p>Another aspect, said the director of Credimemora, is to review the fees of the property, in order to avoid out-of-pocket expenses.<\/p>\n<p>&#8220;It is important to verify that the property is up to date with payments such as Predial and water, because in certain cases the law requires the new owner to take charge of them,&#8221; he explained.<\/p>\n<h2>Don&#8217;t fall for fraud<\/h2>\n<p>According to Sergio San Sebastián, three types of fraud have been observed in Mexico and are frequently committed.<\/p>\n<p>The first consists of requesting amounts to set aside the property.  This type of fraud consists of requesting advance payments from the buyer without there being a guarantee of the property.<\/p>\n<p>&#8220;Whether by a natural person or a ghost real estate agent who seeks to obtain money without showing the property to the interested party and summoning him to a ghost office, delaying the delivery of the home and then disappearing with the requested down payment,&#8221; he commented.<\/p>\n<p>A duplicate sale is that the offered home is sold by the owner twice or more, in that sense, that is the second most recurrent type of fraud.<\/p>\n<p>“In this case, the first person who made the purchase may be the owner and the people who also made the purchase get scammed.  Despite the fact that a contract is signed before a notary, he does not send a preventive notice of sale, and when another person verifies the registry and there is no purchase request, said property can be sold on several occasions, &#8220;said San Sebastián.<\/p>\n<p>It is very common to see advertisements for housing offers on the Internet.  However, these properties are not for sale and the buyer is not really the owner of the property, so they deceitfully request advance payments from the person interested in buying the property.  This is the third type of fraud, so the manager of the broker recommended a measure to avoid falling into these.<\/p>\n<p>“To avoid this, it is recommended to ask the seller for the property title of the property, conduct a survey in the area to verify that this person really lives there and that the property is for sale, in addition to avoiding providing documents with personal data that allow the scammer to use them to force the sale”, he added.<\/p>\n<h2>Measures to consider<\/h2>\n<p>Unfortunately, there is a risk of falling for these types of scams, so it is important that you know what to do and who to turn to if you are a victim of fraud.<\/p>\n<p>“In the first instance, you can resort to the Federal Consumer Protection Agency, where a complaint is issued when there is a buyer-seller relationship.  In this instance, a recommendation is issued where the affected parties are summoned to reach an agreement, either due to breach of contract to avoid reaching higher instances.  In this you can recover the advance made as long as the contract is registered, ”explained the manager.<\/p>\n<p>Another option, according to San Sebastián, is to go to the Public Ministry, where a record is drawn up indicating the facts, the contract and the identification of the seller are presented, there the two parties are summoned to determine if it is carried out a judgment that allows to define responsibilities and to be able to recover the money deposited if there was any payment in advance.<\/p>\n<p>“If the record does not proceed before the Public Ministry, a third instance would be a lawsuit before a court.  In this case, an initial writ of demand is requested, in which it is specified that the victim of fraud was, what amount of money is involved, the documents that prove that said amount was actually deposited to the seller and the contract of sale is also presented. sale,&#8221; he said.<\/p>\n<p>He also commented that the process consists of calling a meeting between seller and buyer.  However, many times what buyers face is that the scammer does not go to ratify said demand, because he changes his address to continue with his practices, and proceeds to make edicts with the aim of reaching an agreement.  However, the victims choose to leave this option aside, since it takes time and many times they are not successful and the money awarded is lost, in case of having made a down payment.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>During the search for a house, it is important that you do not lose sight of everything that concerns this situation: housing options, location, prices, or the legal status of the property, since you may be exposed to real estate fraud, in which You will only lose time, but also money. In this regard, Sergio [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":953,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/952"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=952"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/952\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/953"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=952"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=952"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=952"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}