{"id":969,"date":"2022-05-24T18:48:23","date_gmt":"2022-05-24T18:48:23","guid":{"rendered":"https:\/\/infobloom.site\/what-is-phishing-and-how-to-protect-yourself\/"},"modified":"2022-05-25T13:09:34","modified_gmt":"2022-05-25T13:09:34","slug":"what-is-phishing-and-how-to-protect-yourself","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-is-phishing-and-how-to-protect-yourself\/","title":{"rendered":"What is phishing and how to protect yourself."},"content":{"rendered":"<h3 class=\"ltitulo\">What is phishing and how to protect yourself.<\/h3>\n<p><strong>Surely in recent months you have been hearing the word Phishing several times in the media and also relating it most of the time to Internet banking. Due to the confusion that exists in some novice Internet users and in some media, which can lead to confusion in the Internet user due to the treatment of the news in an alarmist way, where it can even be deduced that online banking is not safe, leaving in doubt the security of banking entities. For all this, the Internet Users Association wants to explain what Phishing is and how to protect yourself from it.<\/strong><\/p>\n<p>05-28-2005 &#8211; <b><i>What is Phishing?<\/i><\/b><br \/>\n&#8220;Phishing&#8221; is a form of fraud with the aim of trying to obtain a user&#8217;s data, passwords, bank accounts, credit card numbers, identities, etc. Summarizing &#8220;all possible data&#8221; to later be used fraudulently.<\/p>\n<p><b><i>What does it consist of?<\/i><\/b><br \/>\nIt can be easily summarized, deceiving the possible scammed, &#8220;impersonating the image of a company or public entity&#8221;, in this way they make the possible victim &#8220;believe&#8221; that the requested data really comes from the &#8220;Official&#8221; site when in fact it does not. it is.<\/p>\n<p><b><i>How do they do it?<\/i><\/b><br \/>\nPhishing can occur in various ways, from a simple message to your mobile phone, a phone call, a website that simulates an entity, a pop-up window, and the most used and known by Internet users, receiving an email. There may be more formats but at this time we only mention the most common;<\/p>\n<p>&#8211; SMS (short message); Reception of a message requesting your personal data.<\/p>\n<p>&#8211; Telephone call; They may receive a phone call in which the sender impersonates a private or public entity so that you provide them with private data. A clear example is the one produced these days with the Tax Agency, which warned that some people are calling taxpayers on their behalf to ask for data, such as their current account, which they then use to make monetary charges.<\/p>\n<p>&#8211; Web page or pop-up window; It is very classic and quite used. It simulates visually supplanting the image of an official entity, companies, etc., appearing to be the official ones. The main purpose is for the user to provide their private data. The most widely used is the &#8220;imitation&#8221; of bank websites, the resemblance being almost identical but not official. Nor do we forget false websites with flashy lures, in which unreal offers are offered and where the novice user provides all their data, an example was the one discovered by the Association of Internet Users and reported to the State forces: Web-Trap of recharges of phones created to steal bank details.<\/p>\n<p>http:\/\/security.internauts.org\/html\/1\/425.html<\/p>\n<p><\/p>\n<p>Example of a fake website that simulates a bank entity;<br \/>\nhttp:\/\/security.internauts.org\/html\/1\/447.html<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653418102_629_What-is-phishing-and-how-to-protect-yourself.jpg\" \/><\/p>\n<p>&#8211; E-mail, the most used and best known by Internet users. The procedure is the receipt of an email where they SIMULATE the entity or body they want to impersonate to obtain data from the new user. The data is supposedly requested for security reasons, maintenance of the entity, improving its service, surveys, confirmation of your identity or any excuse, so that you provide any data. The email may contain forms, fake links, original texts, official images, etc., all to make it visually identical to the original website. They also take advantage of vulnerabilities in browsers and email managers, all with the sole objective of making the user enter their personal information and unknowingly send it directly to the scammer, so that they can then use them fraudulently: stealing your money, making purchases, etc. .<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653418102_637_What-is-phishing-and-how-to-protect-yourself.jpg\" \/><\/p>\n<p><b><i>How to protect myself?<\/i><\/b><br \/>\nThe surest way to rest easy and not get scammed is to NEVER respond to ANY requests for personal information via email, phone call or short message (SMS).<\/p>\n<p>Entities or organizations NEVER ask you for passwords, credit card numbers or any personal information by email, phone or SMS. They already have your data, in any case you are the one who can request them due to forgetfulness or loss and they will provide it to you. They will NEVER ask for it because they already have it, it&#8217;s common sense.<\/p>\n<p>To visit Web sites, type the URL in the address bar. NEVER FOR LINKS FROM ANY SITE. Banking entities contain security certificates and secure encryption DO NOT BE AFRAID when using internet banking.<\/p>\n<p><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/What-is-phishing-and-how-to-protect-yourself.gif\" \/><\/p>\n<p><b><i>How do I report it?<\/i><\/b><br \/>\nWhen you are the victim of this type of fraud attempt, report to the competent authorities, the Association of Internet Users created several months ago a conduit through which Internet users can report emails that pretend to be banking entities, fake websites or any type of scam. through the use of phishing on the Internet.<\/p>\n<p>To do this, you just have to send an email to <b>phishing@internautas.org<\/b> attaching the email received or the website that tries to steal data. We report it to the affected company or organization and notify the State forces.<\/p>\n<p>The purpose of the Internet Users Association is to avoid and ERADICATE ONCE the possible scam attempts made through the use of phishing.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is phishing and how to protect yourself. Surely in recent months you have been hearing the word Phishing several times in the media and also relating it most of the time to Internet banking. Due to the confusion that exists in some novice Internet users and in some media, which can lead to confusion [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":970,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/969"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=969"}],"version-history":[{"count":1,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/969\/revisions"}],"predecessor-version":[{"id":1061,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/969\/revisions\/1061"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/970"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=969"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=969"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=969"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}