{"id":975,"date":"2022-05-24T19:52:51","date_gmt":"2022-05-24T19:52:51","guid":{"rendered":"https:\/\/infobloom.site\/10-tips-to-sell-your-work-in-the-nft-market\/"},"modified":"2022-05-24T19:52:51","modified_gmt":"2022-05-24T19:52:51","slug":"10-tips-to-sell-your-work-in-the-nft-market","status":"publish","type":"post","link":"https:\/\/infobloom.site\/10-tips-to-sell-your-work-in-the-nft-market\/","title":{"rendered":"10 tips to sell your work in the NFT market"},"content":{"rendered":"<h4>Digital Artists Share Strategies On How To Promote Your Digital Works In The Crypto Art Market<\/h4>\n<p>The possibility of selling pieces of digital art has revolutionized the universe of artists in just a few weeks.  And is not for less.  In January alone, the value of Ethereum, the base cryptocurrency for trading in this market, grew 10 times.  And this is expected to be just the beginning in the NFT market. <\/p>\n<p>Sales figures are tempting and many artists have jumped on the new circuit.  However, this opportunity has not only brought possibilities.  It also implies new tasks for the artists.  Self-promotion is one of them.  If you have already tokenized your works and managed to access a market such as Foundation, Opensea, Superrare, Rarible or Makers Place, you are probably wondering what to do to sell. <\/p>\n<p>We asked artists who sell art online what communication strategies work best for them, what networks to be present on, and what kind of content seems to attract collectors.  These are his 10 marketing strategies to spread your digital art:<\/p><source media=\"only screen and (max-width: 479px)\" data-\/><source media=\"only screen and (min-width: 480px ) and (max-width: 767px)\" data-\/><source media=\"only screen and (min-width: 768px ) and (max-width: 991px)\" data-\/><source media=\"only screen and (min-width: 992px)\" data-\/>Planet 04, by Óscar Lloréns, was recently sold for 1.00 ETH, equivalent to $2,385.82.<\/p>\n<h4>1. The move to Twitter<\/h4>\n<p>The impossibility of inserting links on Instagram if you have less than 10 thousand followers is a very specific limit.  When your sale depends on promoting the link of the next auction and directing people to your gallery, that &#8220;link in bio&#8221; does not convince anyone.  This explains why Twitter[whichdoesallow[quesípermite<strong>share link<\/strong>has been established as the network to spread crypto art par excellence.  <\/p>\n<p>Although the arty world thought that it was not such a visual network, many have discovered that its use as an exhibition space can be even better than that of Instagram.  “Twitter allows you to display several images at the same time without forgetting to put the text in an important place, because it is the first thing you see”, highlights the illustrator and designer Óscar Lloréns (@ollorens).  The artist, who has sold 7 of the 8 works that he has put on the market through Foundation, acknowledges that the little bird&#8217;s social network works wonders to show his series, a format that seems to please the current market a lot. <\/p>\n<p>Another possibility offered by Twitter is that of <strong>feedback<\/strong>: that is, sharing and retweeting the work of other artists helps to create a community and a diffusion network. <\/p><source media=\"only screen and (max-width: 479px)\" data-\/><source media=\"only screen and (min-width: 480px ) and (max-width: 767px)\" data-\/><source media=\"only screen and (min-width: 768px ) and (max-width: 991px)\" data-\/><source media=\"only screen and (min-width: 992px)\" data-\/><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653421971_854_10-tips-to-sell-your-work-in-the-NFT-market.jpeg\" alt=\"10 tips to sell your work in the NFT market 4\" class=\" lazyload\"\/>The banner that Lloréns used on Twitter to broadcast Planeta 04. <\/p>\n<h4>2. Taking care of Instagram<\/h4>\n<p>When it comes to selling, all networks add up, that&#8217;s why, although Twitter is the highlight of dissemination, most artists agree that if you already have a <strong>community<\/strong> on Instagram, however humble it may be, it should not be neglected.  Instagram is still a space to show a <strong>portfolio<\/strong> and a place to exhibit not only the present, but also the past.  The trajectory and evolution of an artist&#8217;s work can be decisive for collectors.<\/p>\n<h4>3. The correct use of hashtags<\/h4>\n<p>In a universe where millions of conversations and images are happening at the same time, the way to build circuits is to follow the <strong>correct hashtags<\/strong>.  They increase the chances of being part of a scene and being seen by collectors and other artists. <\/p>\n<p>The twelve most used hashtags are:<\/p>\n<p>  #nft #nftart #nftartist #nfts #nftcollector #nftcommunity #cryptoart #critoartist #nftphotography #nftanimation #nftvideo #digitalart<\/p>\n<p>It is useful to incorporate some of these hashtags or terms in your description of<strong> profile<\/strong>.  These tags are valid for both Twitter and Instagram.<\/p><source media=\"only screen and (max-width: 479px)\" data-\/><source media=\"only screen and (min-width: 480px ) and (max-width: 767px)\" data-\/><source media=\"only screen and (min-width: 768px ) and (max-width: 991px)\" data-\/><source media=\"only screen and (min-width: 992px)\" data-\/><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653421971_6_10-tips-to-sell-your-work-in-the-NFT-market.jpeg\" alt=\"10 tips to sell your work in the NFT market 7\" class=\" lazyload\"\/>The banner that Zigor used on Twitter to spread Celulin. <\/p>\n<h4>4. Sharing more than work<\/h4>\n<p>&#8220;Share the <strong>creative process,<\/strong> Showing how a work is put together, what your inspirations are, is something that seems to be of great interest”, observes the 3D illustrator artist Zigor Samaniego (@zigor).  Zigor was one of the first Spaniards to enter the NFT universe.  He did it in October 2020 and through the front door, with an auction at the Nifty Gateway gallery, from which he obtained 10 thousand dollars.  Since then he pays more attention to self-promotional techniques.  “I understand that it works to create some intrigue in the weeks leading up to an auction,” he explains.  <\/p>\n<p>Llorens agrees.  The best way to do this?  Through timelapses, captures of fragments and advances on details that the works will contain.  The images of the artists working in their studios are also attractive, as are the works of others that the artist selects to share on their networks, as a kind of curator service. <\/p><source media=\"only screen and (max-width: 479px)\" data-\/><source media=\"only screen and (min-width: 480px ) and (max-width: 767px)\" data-\/><source media=\"only screen and (min-width: 768px ) and (max-width: 991px)\" data-\/><source media=\"only screen and (min-width: 992px)\" data-\/><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/1653421971_572_10-tips-to-sell-your-work-in-the-NFT-market.jpeg\" alt=\"10 tips to sell your work in the NFT market 9\" class=\" lazyload\"\/>Óscar Lloréns in his study.<\/p>\n<h4>5. Court collectors, but not too much!<\/h4>\n<p>“In the Twitter universe, people often appear who claim to have certain sums of money to spend on crypto art and ask to be convinced.  They could be real but that is not always true”, explains the creative Gabriel Suchowolski (@microbians).  The result is that many artists are tempted to go out <strong>hunt collectors <\/strong>explicitly, sweeping them off their sales and sending them private messages.  Is this a good idea?  All interviewees say no.  Lloréns explains that he only sends messages to those who have already bought his work &#8220;or those who have bid for me at an auction,&#8221; he says. <\/p>\n<h4>6. Discord Forums<\/h4>\n<p>Discord is a social platform intended to allow you to create <strong>chat rooms <\/strong>for different purposes.  It is known as the Slack of gamers and now, also, of crypto artists.  In addition to chatting, in Discord you have more professional functions that allow you to share and store material and documents.  In general, crypto galleries usually have their own chat rooms that you can join to share works. <\/p>\n<p>There are also more or less closed groups to which you can be invited as you meet users who enable you to join.  There are even great collectors&#8217; rooms that are already almost mythical in the world of NFT art.  Access to them is restricted and those who manage to enter are considered elite. <\/p><source media=\"only screen and (max-width: 479px)\" data-\/><source media=\"only screen and (min-width: 480px ) and (max-width: 767px)\" data-\/><source media=\"only screen and (min-width: 768px ) and (max-width: 991px)\" data-\/><source media=\"only screen and (min-width: 992px)\" data-\/><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/10-tips-to-sell-your-work-in-the-NFT-market.jpg\" alt=\"10 tips to sell your work in the NFT market 12\" class=\" lazyload\"\/>The Microbians instagram as a portfolio. <\/p>\n<h4>7. Promotion on Reddit<\/h4>\n<p>Reddit is a content aggregator determined by a voting community.  If a post gets a lot of upvotes, it goes up in Reddit rankings and therefore more people can see it.  If you receive downvotes, your visibility is reduced.  <\/p>\n<p>There you can not only exhibit work in <strong>artist communities <\/strong>like reddit.com\/r\/CryptoArt, which has nearly 8 million users.  You can also investigate what you don&#8217;t understand in forums that select very educational articles in groups such as one dedicated exclusively to Ethereum. <\/p>\n<h4>8. The newsletters dedicated to the NFT<\/h4>\n<p>There are already trends hunters of NFT works that look for the works that have the greatest potential to be listed.  NFT Hunters is one of them.  Once or twice a week, this site sends a list of outstanding works to the email or Telegram account of its subscribers.  In some cases, if a trend or information breaks very suddenly in the market, they will receive an extra email with details.  Posting your works to be taken into account is very easy: you just have to send an email to the address that appears on their website. <\/p>\n<h4>9. Collaborations<\/h4>\n<p>In the NFT universe, there is strength in union.  And the trend of alliances seems to grow both in the big leagues and in the not so big ones.  German DJ Boys Noize recently teamed up with visual artists Art Camp, Danae Gosset and Danica to create a clip that sold for $25,000. <\/p>\n<p>A similar figure was achieved by Taiwanese singer Eric Chou, joining forces with Hong Kong visual artist and filmmaker Wing Shea.  In the smaller leagues, this works too: days ago, a collaboration of 100 little-known artists, curated by an artist and feature writer named Loopify, managed to sell for seven times the price originally listed on Rarible: grossing $89K. .<\/p><source media=\"only screen and (max-width: 479px)\" data-\/><source media=\"only screen and (min-width: 480px ) and (max-width: 767px)\" data-\/><source media=\"only screen and (min-width: 768px ) and (max-width: 991px)\" data-\/><source media=\"only screen and (min-width: 992px)\" data-\/><img src=\"https:\/\/infobloom.site\/wp-content\/uploads\/2022\/05\/10-tips-to-sell-your-work-in-the-NFT-market.png\" alt=\"10 tips to sell your work in the NFT market 16\" class=\" lazyload\"\/>The collaboration of 100 artists. <\/p>\n<h4>10. The protection of artistic identity <\/h4>\n<p>Although, in a context of economic crisis, it is understandable that many artists bet on NFTs, those who are already inside understand the addictive potential that all this can have.  &#8220;Everything is so new and unpredictable that it gives the feeling that this will end tomorrow and that we have to take advantage of it now,&#8221; observes Lloréns. <\/p>\n<p>However, he warns of the risk involved in paying so much attention to marketing.  &#8220;I think it is important not to become obsessed with pleasing a market and to continue producing art with its own personality, after all, that is the opportunity that the world of NFT brings us. To stop thinking about a client and be able to offer our own &#8220;, advise. <\/p>\n<p>Do you want to learn techniques to create digital art?  You can check the course Illustration techniques and styles with Procreate by Óscar Lloréns.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Digital Artists Share Strategies On How To Promote Your Digital Works In The Crypto Art Market The possibility of selling pieces of digital art has revolutionized the universe of artists in just a few weeks. And is not for less. In January alone, the value of Ethereum, the base cryptocurrency for trading in this market, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":982,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/975"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=975"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/975\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/982"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=975"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=975"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=975"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}