{"id":983,"date":"2022-05-24T20:25:03","date_gmt":"2022-05-24T20:25:03","guid":{"rendered":"https:\/\/infobloom.site\/what-are-nfts-and-why-are-comics-companies-selling-them\/"},"modified":"2022-05-24T20:25:03","modified_gmt":"2022-05-24T20:25:03","slug":"what-are-nfts-and-why-are-comics-companies-selling-them","status":"publish","type":"post","link":"https:\/\/infobloom.site\/what-are-nfts-and-why-are-comics-companies-selling-them\/","title":{"rendered":"What Are NFTs and Why Are Comics Companies Selling Them?"},"content":{"rendered":"<h2 id=\"h-the-next-evolution-in-comics-hucksterism\"><strong>THE NEXT EVOLUTION IN COMICS HUCKSTERISM<\/strong><\/h2>\n<p>Two full decades after Metallica teamed up with record labels to make sure we didn&#8217;t own anything we purchased digitally, a group of rejected Captain Planet villains came up with a workaround: NFTs.<\/p>\n<p>NFTs use blockchain, a distributed AI accountant that requires ENORMOUS amounts of processing power to work properly, to assign certificates of ownership and record transactions.  Accepting the pitch behind blockchain technology requires one to step back to an absurdly abstract level, then a zoom back into the extremely micro. <\/p>\n<p>Every transaction between two people is built around trust: I trust that you are giving me the thing I&#8217;m paying for, while we both trust that the currency I&#8217;m handing you has a (relatively) absolute value which will allow it to be traded for other things.  Blockchain purports to eliminate that trust: it uses a distributed ledger that anyone can see and confirm to record our transaction;  it uses an algorithm to make sure every copy of the ledger is the same;  and it assigns tokens to each transaction that can be given a value. <\/p>\n<p>NFTs add in an absurd additional abstraction: ownership of digital media.  I have always had the ability to, for example, produce an animated reaction gif from a television show and sell that animated reaction gif to you for a fixed sum of money.  You would be an idiot for purchasing that reaction gif for several reasons: anyone else could make the exact same gif and you could find it in iMessage&#8217;s search engine, for one.  But nothing in the past has ever prevented this transaction from occurring. <\/p>\n<p>The “innovation” around NFTs is that it uses blockchain technology to “prove” “ownership” and “authenticity,” a sentence that is so heavily caveated that to express it correctly in writing makes the writer look like a conspiracy theorist.  The NFT assigns a ledger value to the piece of digital artwork, and then that ledger value is what is sold between parties.  It is a non-fungible token – unlike Bitcoin or other cryptocurrency, the idea is these art pieces&#8217; tokens&#8217; inherent value doesn&#8217;t change (hence the non-fungible), while cryptocurrency is a token whose value is relative to other less imaginary currency. <\/p>\n<p>This has led to some frankly embarrassing sales online.  Jack Dorsey, the vacuous and bizarre founder of Twitter, is auctioning off his first tweet from him, something that already happened, that you can find with one simple Google search, for millions of dollars.  Beeple, an artist the internet assures me is real, auctioned off a digital JPEG collage of all their previous works for $69 million.  Jose Delgo, a comics artist from the &#8217;70s that very few people remembered until this happened, has made almost $2 million selling NFTs of his own artwork, spurring DC to email freelancers to remind them that they should not be using DC characters to try and skate atop this obvious bubble.  Not because of the catastrophic environmental impacts caused by the blockchain algorithm, mind you.  No, it was because AT&#038;T needed to get some of that sweet, sweet tulip money.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>THE NEXT EVOLUTION IN COMICS HUCKSTERISM Two full decades after Metallica teamed up with record labels to make sure we didn&#8217;t own anything we purchased digitally, a group of rejected Captain Planet villains came up with a workaround: NFTs. NFTs use blockchain, a distributed AI accountant that requires ENORMOUS amounts of processing power to work [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":984,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/983"}],"collection":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/comments?post=983"}],"version-history":[{"count":0,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/posts\/983\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media\/984"}],"wp:attachment":[{"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/media?parent=983"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/categories?post=983"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/infobloom.site\/wp-json\/wp\/v2\/tags?post=983"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}